/* automatically generated by rust-bindgen 0.64.0 */

pub const __STDC_WANT_LIB_EXT1_PREVIOUS__: i32 = -1;
pub const _PDCLIB_endl: &[u8; 2usize] = b"\n\0";
pub const _PDCLIB_SUCCESS: u32 = 0;
pub const _PDCLIB_FAILURE: i32 = -1;
pub const _PDCLIB_CHAR_SIGNED: u32 = 1;
pub const _PDCLIB_SHRT_BYTES: u32 = 2;
pub const _PDCLIB_INT_BYTES: u32 = 4;
pub const _PDCLIB_LONG_BYTES: u32 = 4;
pub const _PDCLIB_LLONG_BYTES: u32 = 8;
pub const _PDCLIB_CLOCKS_PER_SEC: u32 = 1000;
pub const _PDCLIB_TIME_UTC: u32 = 1;
pub const _PDCLIB_FLT_ROUNDS: i32 = -1;
pub const _PDCLIB_FLT_EVAL_METHOD: i32 = -1;
pub const _PDCLIB_DECIMAL_DIG: u32 = 17;
pub const _PDCLIB_PAGESIZE: u32 = 4096;
pub const _PDCLIB_MINALLOC: u32 = 8;
pub const _PDCLIB_BUFSIZ: u32 = 1024;
pub const _PDCLIB_FOPEN_MAX: u32 = 8;
pub const _PDCLIB_FILENAME_MAX: u32 = 128;
pub const _PDCLIB_L_tmpnam: u32 = 46;
pub const _PDCLIB_TMP_MAX: u32 = 50;
pub const _PDCLIB_SEEK_SET: u32 = 0;
pub const _PDCLIB_SEEK_CUR: u32 = 1;
pub const _PDCLIB_SEEK_END: u32 = 2;
pub const _PDCLIB_UNGETCBUFSIZE: u32 = 1;
pub const _PDCLIB_ATEXIT_SLOTS: u32 = 40;
pub const _PDCLIB_E2BIG: u32 = 7;
pub const _PDCLIB_EACCES: u32 = 13;
pub const _PDCLIB_EADDRINUSE: u32 = 100;
pub const _PDCLIB_EADDRNOTAVAIL: u32 = 101;
pub const _PDCLIB_EAFNOSUPPORT: u32 = 102;
pub const _PDCLIB_EAGAIN: u32 = 11;
pub const _PDCLIB_EALREADY: u32 = 103;
pub const _PDCLIB_EBADF: u32 = 9;
pub const _PDCLIB_EBADMSG: u32 = 104;

pub const USBH_ERR_TRANSACTION: i32 = -271;
pub const USBH_ERR_BABBLE_DETECTED: i32 = -272;
pub const USBH_ERR_DATA_BUFF: i32 = -274;
pub const USBH_ERR_CC_NO_ERR: i32 = -280;
pub const USBH_ERR_CRC: i32 = -281;
pub const USBH_ERR_BIT_STUFF: i32 = -282;
pub const USBH_ERR_DATA_TOGGLE: i32 = -283;
pub const USBH_ERR_STALL: i32 = -284;
pub const USBH_ERR_DEV_NO_RESP: i32 = -285;
pub const USBH_ERR_PID_CHECK: i32 = -286;
pub const USBH_ERR_UNEXPECT_PID: i32 = -287;
pub const USBH_ERR_DATA_OVERRUN: i32 = -288;
pub const USBH_ERR_DATA_UNDERRUN: i32 = -289;
pub const USBH_ERR_BUFF_OVERRUN: i32 = -292;
pub const USBH_ERR_BUFF_UNDERRUN: i32 = -293;
pub const USBH_ERR_NOT_ACCESS0: i32 = -294;
pub const USBH_ERR_NOT_ACCESS1: i32 = -295;
pub const USBH_ERR_OHCI_INIT: i32 = -301;
pub const USBH_ERR_OHCI_EP_BUSY: i32 = -303;
pub const USBH_ERR_EHCI_INIT: i32 = -501;
pub const USBH_ERR_EHCI_QH_BUSY: i32 = -503;
pub const UMAS_OK: u32 = 0;
pub const UMAS_ERR_NO_DEVICE: i32 = -1031;
pub const UMAS_ERR_IO: i32 = -1033;
pub const UMAS_ERR_INIT_DEVICE: i32 = -1035;
pub const UMAS_ERR_CMD_STATUS: i32 = -1037;
pub const UMAS_ERR_IVALID_PARM: i32 = -1038;
pub const UMAS_ERR_DRIVE_NOT_FOUND: i32 = -1039;
pub const HID_RET_OK: u32 = 0;
pub const HID_RET_DEV_NOT_FOUND: i32 = -1081;
pub const HID_RET_IO_ERR: i32 = -1082;
pub const HID_RET_INVALID_PARAMETER: i32 = -1083;
pub const HID_RET_OUT_OF_MEMORY: i32 = -1084;
pub const HID_RET_NOT_SUPPORTED: i32 = -1085;
pub const HID_RET_EP_NOT_FOUND: i32 = -1086;
pub const HID_RET_XFER_IS_RUNNING: i32 = -1089;
pub const UAC_RET_OK: u32 = 0;
pub const UAC_RET_DEV_NOT_FOUND: i32 = -2001;
pub const UAC_RET_FUNC_NOT_FOUND: i32 = -2002;
pub const UAC_RET_IO_ERR: i32 = -2003;
pub const UAC_RET_DATA_LEN: i32 = -2004;
pub const UAC_RET_INVALID: i32 = -2005;
pub const UAC_RET_OUT_OF_MEMORY: i32 = -2007;
pub const UAC_RET_DRV_NOT_SUPPORTED: i32 = -2009;
pub const UAC_RET_DEV_NOT_SUPPORTED: i32 = -2011;
pub const UAC_RET_PARSER: i32 = -2013;
pub const UAC_RET_IS_STREAMING: i32 = -2015;
pub const UVC_RET_OK: u32 = 0;
pub const UVC_RET_DEV_NOT_FOUND: i32 = -3001;
pub const UVC_RET_FUNC_NOT_FOUND: i32 = -3002;
pub const UVC_RET_IO_ERR: i32 = -3003;
pub const UVC_RET_DATA_LEN: i32 = -3004;
pub const UVC_RET_INVALID: i32 = -3005;
pub const UVC_RET_OUT_OF_MEMORY: i32 = -3007;
pub const UVC_RET_DRV_NOT_SUPPORTED: i32 = -3009;
pub const UVC_RET_DEV_NOT_SUPPORTED: i32 = -3011;
pub const UVC_RET_NOT_SUPPORT: i32 = -3012;
pub const UVC_RET_PARSER: i32 = -3013;
pub const UVC_RET_IS_STREAMING: i32 = -3015;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PDCLIB_div_t {
    pub quot: libc::c_int,
    pub rem: libc::c_int,
}
#[test]
fn bindgen_test_layout__PDCLIB_div_t() {
    const UNINIT: ::core::mem::MaybeUninit<_PDCLIB_div_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_PDCLIB_div_t>(),
        8usize,
        concat!("Size of: ", stringify!(_PDCLIB_div_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_PDCLIB_div_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_PDCLIB_div_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_div_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_div_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PDCLIB_ldiv_t {
    pub quot: libc::c_long,
    pub rem: libc::c_long,
}
#[test]
fn bindgen_test_layout__PDCLIB_ldiv_t() {
    const UNINIT: ::core::mem::MaybeUninit<_PDCLIB_ldiv_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_PDCLIB_ldiv_t>(),
        8usize,
        concat!("Size of: ", stringify!(_PDCLIB_ldiv_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_PDCLIB_ldiv_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_PDCLIB_ldiv_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_ldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_ldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PDCLIB_lldiv_t {
    pub quot: libc::c_longlong,
    pub rem: libc::c_longlong,
}
#[test]
fn bindgen_test_layout__PDCLIB_lldiv_t() {
    const UNINIT: ::core::mem::MaybeUninit<_PDCLIB_lldiv_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_PDCLIB_lldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(_PDCLIB_lldiv_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_PDCLIB_lldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_PDCLIB_lldiv_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PDCLIB_imaxdiv_t {
    pub quot: libc::c_longlong,
    pub rem: libc::c_longlong,
}
#[test]
fn bindgen_test_layout__PDCLIB_imaxdiv_t() {
    const UNINIT: ::core::mem::MaybeUninit<_PDCLIB_imaxdiv_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_PDCLIB_imaxdiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(_PDCLIB_imaxdiv_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_PDCLIB_imaxdiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_PDCLIB_imaxdiv_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_imaxdiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_imaxdiv_t),
            "::",
            stringify!(rem)
        )
    );
}
pub type _PDCLIB_va_list = __builtin_va_list;
pub type _PDCLIB_fd_t = *mut libc::c_void;
pub type _PDCLIB_thrd_t = *mut libc::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __PDCLIB_cnd_t {
    pub eventHandles: [*mut libc::c_void; 2usize],
    pub waitCount: u32,
}
#[test]
fn bindgen_test_layout___PDCLIB_cnd_t() {
    const UNINIT: ::core::mem::MaybeUninit<__PDCLIB_cnd_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<__PDCLIB_cnd_t>(),
        12usize,
        concat!("Size of: ", stringify!(__PDCLIB_cnd_t))
    );
    assert_eq!(
        ::core::mem::align_of::<__PDCLIB_cnd_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__PDCLIB_cnd_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).eventHandles) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__PDCLIB_cnd_t),
            "::",
            stringify!(eventHandles)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).waitCount) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__PDCLIB_cnd_t),
            "::",
            stringify!(waitCount)
        )
    );
}
pub type _PDCLIB_cnd_t = __PDCLIB_cnd_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __PDCLIB_mtx_t {
    pub handle: *mut libc::c_void,
}
#[test]
fn bindgen_test_layout___PDCLIB_mtx_t() {
    const UNINIT: ::core::mem::MaybeUninit<__PDCLIB_mtx_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<__PDCLIB_mtx_t>(),
        4usize,
        concat!("Size of: ", stringify!(__PDCLIB_mtx_t))
    );
    assert_eq!(
        ::core::mem::align_of::<__PDCLIB_mtx_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__PDCLIB_mtx_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).handle) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__PDCLIB_mtx_t),
            "::",
            stringify!(handle)
        )
    );
}
pub type _PDCLIB_mtx_t = __PDCLIB_mtx_t;
pub type _PDCLIB_tss_t = libc::c_uint;
pub type _PDCLIB_once_flag = libc::c_int;
pub type _PDCLIB_int8_t = libc::c_schar;
pub type _PDCLIB_uint8_t = libc::c_uchar;
pub type _PDCLIB_int16_t = libc::c_short;
pub type _PDCLIB_uint16_t = libc::c_ushort;
pub type _PDCLIB_int32_t = libc::c_int;
pub type _PDCLIB_uint32_t = libc::c_uint;
pub type _PDCLIB_int64_t = libc::c_longlong;
pub type _PDCLIB_uint64_t = libc::c_ulonglong;
pub type _PDCLIB_int_fast8_t = libc::c_int;
pub type _PDCLIB_uint_fast8_t = libc::c_uint;
pub type _PDCLIB_int_fast16_t = libc::c_int;
pub type _PDCLIB_uint_fast16_t = libc::c_uint;
pub type _PDCLIB_int_fast32_t = libc::c_int;
pub type _PDCLIB_uint_fast32_t = libc::c_uint;
pub type _PDCLIB_int_fast64_t = libc::c_long;
pub type _PDCLIB_uint_fast64_t = libc::c_ulong;
pub type _PDCLIB_ptrdiff_t = libc::c_int;
pub type _PDCLIB_size_t = libc::c_uint;
pub type _PDCLIB_wchar_t = libc::c_ushort;
pub type _PDCLIB_wint_t = libc::c_ushort;
pub type _PDCLIB_intptr_t = libc::c_long;
pub type _PDCLIB_uintptr_t = libc::c_ulong;
pub type _PDCLIB_intmax_t = libc::c_longlong;
pub type _PDCLIB_uintmax_t = libc::c_ulonglong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PDCLIB_fpos_t {
    pub offset: _PDCLIB_uint64_t,
    pub status: libc::c_int,
}
#[test]
fn bindgen_test_layout__PDCLIB_fpos_t() {
    const UNINIT: ::core::mem::MaybeUninit<_PDCLIB_fpos_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_PDCLIB_fpos_t>(),
        16usize,
        concat!("Size of: ", stringify!(_PDCLIB_fpos_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_PDCLIB_fpos_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_PDCLIB_fpos_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).offset) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_fpos_t),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_fpos_t),
            "::",
            stringify!(status)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PDCLIB_file_t {
    pub handle: _PDCLIB_fd_t,
    pub buffer: *mut libc::c_char,
    pub bufsize: _PDCLIB_size_t,
    pub bufidx: _PDCLIB_size_t,
    pub bufend: _PDCLIB_size_t,
    pub pos: _PDCLIB_fpos_t,
    pub ungetidx: _PDCLIB_size_t,
    pub ungetbuf: *mut libc::c_uchar,
    pub status: libc::c_uint,
    pub filename: *mut libc::c_char,
    pub next: *mut _PDCLIB_file_t,
}
#[test]
fn bindgen_test_layout__PDCLIB_file_t() {
    const UNINIT: ::core::mem::MaybeUninit<_PDCLIB_file_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_PDCLIB_file_t>(),
        64usize,
        concat!("Size of: ", stringify!(_PDCLIB_file_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_PDCLIB_file_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_PDCLIB_file_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).handle) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_file_t),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).buffer) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_file_t),
            "::",
            stringify!(buffer)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bufsize) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_file_t),
            "::",
            stringify!(bufsize)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bufidx) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_file_t),
            "::",
            stringify!(bufidx)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bufend) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_file_t),
            "::",
            stringify!(bufend)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pos) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_file_t),
            "::",
            stringify!(pos)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ungetidx) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_file_t),
            "::",
            stringify!(ungetidx)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ungetbuf) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_file_t),
            "::",
            stringify!(ungetbuf)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_file_t),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).filename) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_file_t),
            "::",
            stringify!(filename)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_file_t),
            "::",
            stringify!(next)
        )
    );
}
pub type _PDCLIB_time_t = libc::c_long;
pub type _PDCLIB_clock_t = libc::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PDCLIB_exitfunc_t {
    pub next: *mut _PDCLIB_exitfunc_t,
    pub func: ::core::option::Option<unsafe extern "C" fn()>,
}
#[test]
fn bindgen_test_layout__PDCLIB_exitfunc_t() {
    const UNINIT: ::core::mem::MaybeUninit<_PDCLIB_exitfunc_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_PDCLIB_exitfunc_t>(),
        8usize,
        concat!("Size of: ", stringify!(_PDCLIB_exitfunc_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_PDCLIB_exitfunc_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_PDCLIB_exitfunc_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_exitfunc_t),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).func) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_exitfunc_t),
            "::",
            stringify!(func)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PDCLIB_status_t {
    pub base: libc::c_int,
    pub flags: _PDCLIB_int_fast32_t,
    pub n: _PDCLIB_size_t,
    pub i: _PDCLIB_size_t,
    pub current: _PDCLIB_size_t,
    pub s: *mut libc::c_char,
    pub width: _PDCLIB_size_t,
    pub prec: libc::c_int,
    pub stream: *mut _PDCLIB_file_t,
    pub arg: _PDCLIB_va_list,
}
#[test]
fn bindgen_test_layout__PDCLIB_status_t() {
    const UNINIT: ::core::mem::MaybeUninit<_PDCLIB_status_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_PDCLIB_status_t>(),
        40usize,
        concat!("Size of: ", stringify!(_PDCLIB_status_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_PDCLIB_status_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_PDCLIB_status_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).base) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_status_t),
            "::",
            stringify!(base)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_status_t),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).n) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_status_t),
            "::",
            stringify!(n)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).i) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_status_t),
            "::",
            stringify!(i)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).current) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_status_t),
            "::",
            stringify!(current)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).s) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_status_t),
            "::",
            stringify!(s)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).width) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_status_t),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).prec) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_status_t),
            "::",
            stringify!(prec)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).stream) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_status_t),
            "::",
            stringify!(stream)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).arg) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_status_t),
            "::",
            stringify!(arg)
        )
    );
}
extern "C" {
    pub fn _PDCLIB_atomax(s: *const libc::c_char) -> _PDCLIB_intmax_t;
}
extern "C" {
    pub fn _PDCLIB_strtox_prelim(
        p: *const libc::c_char,
        sign: *mut libc::c_char,
        base: *mut libc::c_int,
    ) -> *const libc::c_char;
}
extern "C" {
    pub fn _PDCLIB_strtox_main(
        p: *mut *const libc::c_char,
        base: libc::c_uint,
        error: _PDCLIB_uintmax_t,
        limval: _PDCLIB_uintmax_t,
        limdigit: libc::c_int,
        sign: *mut libc::c_char,
    ) -> _PDCLIB_uintmax_t;
}
extern "C" {
    pub static _PDCLIB_digits: [libc::c_char; 0usize];
}
extern "C" {
    pub static _PDCLIB_Xdigits: [libc::c_char; 0usize];
}
extern "C" {
    pub fn _PDCLIB_print(
        spec: *const libc::c_char,
        status: *mut _PDCLIB_status_t,
    ) -> *const libc::c_char;
}
extern "C" {
    pub fn _PDCLIB_scan(
        spec: *const libc::c_char,
        status: *mut _PDCLIB_status_t,
    ) -> *const libc::c_char;
}
extern "C" {
    pub fn _PDCLIB_filemode(mode: *const libc::c_char) -> libc::c_uint;
}
extern "C" {
    pub fn _PDCLIB_prepread(stream: *mut _PDCLIB_file_t) -> libc::c_int;
}
extern "C" {
    pub fn _PDCLIB_prepwrite(stream: *mut _PDCLIB_file_t) -> libc::c_int;
}
extern "C" {
    pub fn _PDCLIB_closeall();
}
extern "C" {
    pub fn _PDCLIB_is_leap(year_offset: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn _PDCLIB_load_lines(
        stream: *mut _PDCLIB_file_t,
        lines: _PDCLIB_size_t,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn _PDCLIB_getstream(stream: *mut _PDCLIB_file_t) -> libc::c_int;
}
extern "C" {
    pub fn _PDCLIB_setstream(stream: *mut _PDCLIB_file_t);
}
extern "C" {
    pub fn _PDCLIB_strtok(
        s1: *mut libc::c_char,
        s1max: *mut _PDCLIB_size_t,
        s2: *const libc::c_char,
        ptr: *mut *mut libc::c_char,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn _PDCLIB_errno_func() -> *mut libc::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PDCLIB_lc_lconv_numeric_t {
    pub decimal_point: *mut libc::c_char,
    pub thousands_sep: *mut libc::c_char,
    pub grouping: *mut libc::c_char,
}
#[test]
fn bindgen_test_layout__PDCLIB_lc_lconv_numeric_t() {
    const UNINIT: ::core::mem::MaybeUninit<_PDCLIB_lc_lconv_numeric_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_PDCLIB_lc_lconv_numeric_t>(),
        12usize,
        concat!("Size of: ", stringify!(_PDCLIB_lc_lconv_numeric_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_PDCLIB_lc_lconv_numeric_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_PDCLIB_lc_lconv_numeric_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).decimal_point) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_lconv_numeric_t),
            "::",
            stringify!(decimal_point)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).thousands_sep) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_lconv_numeric_t),
            "::",
            stringify!(thousands_sep)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).grouping) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_lconv_numeric_t),
            "::",
            stringify!(grouping)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PDCLIB_lc_lconv_monetary_t {
    pub mon_decimal_point: *mut libc::c_char,
    pub mon_thousands_sep: *mut libc::c_char,
    pub mon_grouping: *mut libc::c_char,
    pub positive_sign: *mut libc::c_char,
    pub negative_sign: *mut libc::c_char,
    pub currency_symbol: *mut libc::c_char,
    pub int_curr_symbol: *mut libc::c_char,
    pub frac_digits: libc::c_char,
    pub p_cs_precedes: libc::c_char,
    pub n_cs_precedes: libc::c_char,
    pub p_sep_by_space: libc::c_char,
    pub n_sep_by_space: libc::c_char,
    pub p_sign_posn: libc::c_char,
    pub n_sign_posn: libc::c_char,
    pub int_frac_digits: libc::c_char,
    pub int_p_cs_precedes: libc::c_char,
    pub int_n_cs_precedes: libc::c_char,
    pub int_p_sep_by_space: libc::c_char,
    pub int_n_sep_by_space: libc::c_char,
    pub int_p_sign_posn: libc::c_char,
    pub int_n_sign_posn: libc::c_char,
}
#[test]
fn bindgen_test_layout__PDCLIB_lc_lconv_monetary_t() {
    const UNINIT: ::core::mem::MaybeUninit<_PDCLIB_lc_lconv_monetary_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_PDCLIB_lc_lconv_monetary_t>(),
        44usize,
        concat!("Size of: ", stringify!(_PDCLIB_lc_lconv_monetary_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_PDCLIB_lc_lconv_monetary_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_PDCLIB_lc_lconv_monetary_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mon_decimal_point) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_lconv_monetary_t),
            "::",
            stringify!(mon_decimal_point)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mon_thousands_sep) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_lconv_monetary_t),
            "::",
            stringify!(mon_thousands_sep)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mon_grouping) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_lconv_monetary_t),
            "::",
            stringify!(mon_grouping)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).positive_sign) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_lconv_monetary_t),
            "::",
            stringify!(positive_sign)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).negative_sign) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_lconv_monetary_t),
            "::",
            stringify!(negative_sign)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).currency_symbol) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_lconv_monetary_t),
            "::",
            stringify!(currency_symbol)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).int_curr_symbol) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_lconv_monetary_t),
            "::",
            stringify!(int_curr_symbol)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).frac_digits) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_lconv_monetary_t),
            "::",
            stringify!(frac_digits)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).p_cs_precedes) as usize - ptr as usize },
        29usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_lconv_monetary_t),
            "::",
            stringify!(p_cs_precedes)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).n_cs_precedes) as usize - ptr as usize },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_lconv_monetary_t),
            "::",
            stringify!(n_cs_precedes)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).p_sep_by_space) as usize - ptr as usize },
        31usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_lconv_monetary_t),
            "::",
            stringify!(p_sep_by_space)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).n_sep_by_space) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_lconv_monetary_t),
            "::",
            stringify!(n_sep_by_space)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).p_sign_posn) as usize - ptr as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_lconv_monetary_t),
            "::",
            stringify!(p_sign_posn)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).n_sign_posn) as usize - ptr as usize },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_lconv_monetary_t),
            "::",
            stringify!(n_sign_posn)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).int_frac_digits) as usize - ptr as usize },
        35usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_lconv_monetary_t),
            "::",
            stringify!(int_frac_digits)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).int_p_cs_precedes) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_lconv_monetary_t),
            "::",
            stringify!(int_p_cs_precedes)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).int_n_cs_precedes) as usize - ptr as usize },
        37usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_lconv_monetary_t),
            "::",
            stringify!(int_n_cs_precedes)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).int_p_sep_by_space) as usize - ptr as usize },
        38usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_lconv_monetary_t),
            "::",
            stringify!(int_p_sep_by_space)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).int_n_sep_by_space) as usize - ptr as usize },
        39usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_lconv_monetary_t),
            "::",
            stringify!(int_n_sep_by_space)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).int_p_sign_posn) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_lconv_monetary_t),
            "::",
            stringify!(int_p_sign_posn)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).int_n_sign_posn) as usize - ptr as usize },
        41usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_lconv_monetary_t),
            "::",
            stringify!(int_n_sign_posn)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PDCLIB_lc_numeric_monetary_t {
    pub lconv: *mut lconv,
    pub numeric_alloced: libc::c_int,
    pub monetary_alloced: libc::c_int,
}
#[test]
fn bindgen_test_layout__PDCLIB_lc_numeric_monetary_t() {
    const UNINIT: ::core::mem::MaybeUninit<_PDCLIB_lc_numeric_monetary_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_PDCLIB_lc_numeric_monetary_t>(),
        12usize,
        concat!("Size of: ", stringify!(_PDCLIB_lc_numeric_monetary_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_PDCLIB_lc_numeric_monetary_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_PDCLIB_lc_numeric_monetary_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lconv) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_numeric_monetary_t),
            "::",
            stringify!(lconv)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).numeric_alloced) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_numeric_monetary_t),
            "::",
            stringify!(numeric_alloced)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).monetary_alloced) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_numeric_monetary_t),
            "::",
            stringify!(monetary_alloced)
        )
    );
}
extern "C" {
    pub static mut _PDCLIB_lc_numeric_monetary: _PDCLIB_lc_numeric_monetary_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PDCLIB_lc_collate_t {
    pub alloced: libc::c_int,
}
#[test]
fn bindgen_test_layout__PDCLIB_lc_collate_t() {
    const UNINIT: ::core::mem::MaybeUninit<_PDCLIB_lc_collate_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_PDCLIB_lc_collate_t>(),
        4usize,
        concat!("Size of: ", stringify!(_PDCLIB_lc_collate_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_PDCLIB_lc_collate_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_PDCLIB_lc_collate_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).alloced) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_collate_t),
            "::",
            stringify!(alloced)
        )
    );
}
extern "C" {
    pub static mut _PDCLIB_lc_collate: _PDCLIB_lc_collate_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PDCLIB_lc_ctype_entry_t {
    pub flags: _PDCLIB_uint16_t,
    pub upper: libc::c_uchar,
    pub lower: libc::c_uchar,
}
#[test]
fn bindgen_test_layout__PDCLIB_lc_ctype_entry_t() {
    const UNINIT: ::core::mem::MaybeUninit<_PDCLIB_lc_ctype_entry_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_PDCLIB_lc_ctype_entry_t>(),
        4usize,
        concat!("Size of: ", stringify!(_PDCLIB_lc_ctype_entry_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_PDCLIB_lc_ctype_entry_t>(),
        2usize,
        concat!("Alignment of ", stringify!(_PDCLIB_lc_ctype_entry_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_ctype_entry_t),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).upper) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_ctype_entry_t),
            "::",
            stringify!(upper)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lower) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_ctype_entry_t),
            "::",
            stringify!(lower)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PDCLIB_lc_ctype_t {
    pub alloced: libc::c_int,
    pub digits_low: libc::c_int,
    pub digits_high: libc::c_int,
    pub Xdigits_low: libc::c_int,
    pub Xdigits_high: libc::c_int,
    pub xdigits_low: libc::c_int,
    pub xdigits_high: libc::c_int,
    pub entry: *mut _PDCLIB_lc_ctype_entry_t,
}
#[test]
fn bindgen_test_layout__PDCLIB_lc_ctype_t() {
    const UNINIT: ::core::mem::MaybeUninit<_PDCLIB_lc_ctype_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_PDCLIB_lc_ctype_t>(),
        32usize,
        concat!("Size of: ", stringify!(_PDCLIB_lc_ctype_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_PDCLIB_lc_ctype_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_PDCLIB_lc_ctype_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).alloced) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_ctype_t),
            "::",
            stringify!(alloced)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).digits_low) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_ctype_t),
            "::",
            stringify!(digits_low)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).digits_high) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_ctype_t),
            "::",
            stringify!(digits_high)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Xdigits_low) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_ctype_t),
            "::",
            stringify!(Xdigits_low)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Xdigits_high) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_ctype_t),
            "::",
            stringify!(Xdigits_high)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xdigits_low) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_ctype_t),
            "::",
            stringify!(xdigits_low)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xdigits_high) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_ctype_t),
            "::",
            stringify!(xdigits_high)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).entry) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_ctype_t),
            "::",
            stringify!(entry)
        )
    );
}
extern "C" {
    pub static mut _PDCLIB_lc_ctype: _PDCLIB_lc_ctype_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PDCLIB_lc_messages_t {
    pub alloced: libc::c_int,
    pub errno_texts: [*mut libc::c_char; 141usize],
}
#[test]
fn bindgen_test_layout__PDCLIB_lc_messages_t() {
    const UNINIT: ::core::mem::MaybeUninit<_PDCLIB_lc_messages_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_PDCLIB_lc_messages_t>(),
        568usize,
        concat!("Size of: ", stringify!(_PDCLIB_lc_messages_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_PDCLIB_lc_messages_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_PDCLIB_lc_messages_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).alloced) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_messages_t),
            "::",
            stringify!(alloced)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).errno_texts) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_messages_t),
            "::",
            stringify!(errno_texts)
        )
    );
}
extern "C" {
    pub static mut _PDCLIB_lc_messages: _PDCLIB_lc_messages_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PDCLIB_lc_time_t {
    pub alloced: libc::c_int,
    pub month_name_abbr: [*mut libc::c_char; 12usize],
    pub month_name_full: [*mut libc::c_char; 12usize],
    pub day_name_abbr: [*mut libc::c_char; 7usize],
    pub day_name_full: [*mut libc::c_char; 7usize],
    pub date_time_format: *mut libc::c_char,
    pub time_format_12h: *mut libc::c_char,
    pub date_format: *mut libc::c_char,
    pub time_format: *mut libc::c_char,
    pub am_pm: [*mut libc::c_char; 2usize],
}
#[test]
fn bindgen_test_layout__PDCLIB_lc_time_t() {
    const UNINIT: ::core::mem::MaybeUninit<_PDCLIB_lc_time_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_PDCLIB_lc_time_t>(),
        180usize,
        concat!("Size of: ", stringify!(_PDCLIB_lc_time_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_PDCLIB_lc_time_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_PDCLIB_lc_time_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).alloced) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_time_t),
            "::",
            stringify!(alloced)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).month_name_abbr) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_time_t),
            "::",
            stringify!(month_name_abbr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).month_name_full) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_time_t),
            "::",
            stringify!(month_name_full)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).day_name_abbr) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_time_t),
            "::",
            stringify!(day_name_abbr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).day_name_full) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_time_t),
            "::",
            stringify!(day_name_full)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).date_time_format) as usize - ptr as usize },
        156usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_time_t),
            "::",
            stringify!(date_time_format)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).time_format_12h) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_time_t),
            "::",
            stringify!(time_format_12h)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).date_format) as usize - ptr as usize },
        164usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_time_t),
            "::",
            stringify!(date_format)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).time_format) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_time_t),
            "::",
            stringify!(time_format)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).am_pm) as usize - ptr as usize },
        172usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_time_t),
            "::",
            stringify!(am_pm)
        )
    );
}
extern "C" {
    pub static mut _PDCLIB_lc_time: _PDCLIB_lc_time_t;
}
extern "C" {
    pub fn _PDCLIB_load_lc_numeric(
        path: *const libc::c_char,
        locale: *const libc::c_char,
    ) -> *mut _PDCLIB_lc_lconv_numeric_t;
}
extern "C" {
    pub fn _PDCLIB_load_lc_monetary(
        path: *const libc::c_char,
        locale: *const libc::c_char,
    ) -> *mut _PDCLIB_lc_lconv_monetary_t;
}
extern "C" {
    pub fn _PDCLIB_load_lc_collate(
        path: *const libc::c_char,
        locale: *const libc::c_char,
    ) -> *mut _PDCLIB_lc_collate_t;
}
extern "C" {
    pub fn _PDCLIB_load_lc_ctype(
        path: *const libc::c_char,
        locale: *const libc::c_char,
    ) -> *mut _PDCLIB_lc_ctype_t;
}
extern "C" {
    pub fn _PDCLIB_load_lc_time(
        path: *const libc::c_char,
        locale: *const libc::c_char,
    ) -> *mut _PDCLIB_lc_time_t;
}
extern "C" {
    pub fn _PDCLIB_load_lc_messages(
        path: *const libc::c_char,
        locale: *const libc::c_char,
    ) -> *mut _PDCLIB_lc_messages_t;
}
pub const _PDCLIB_assert_568: _bindgen_ty_1 = 1;
pub type _bindgen_ty_1 = libc::c_int;
pub const _PDCLIB_assert_569: _bindgen_ty_2 = 1;
pub type _bindgen_ty_2 = libc::c_int;
pub const _PDCLIB_assert_570: _bindgen_ty_3 = 1;
pub type _bindgen_ty_3 = libc::c_int;
pub const _PDCLIB_assert_571: _bindgen_ty_4 = 1;
pub type _bindgen_ty_4 = libc::c_int;
pub const _PDCLIB_assert_574: _bindgen_ty_5 = 1;
pub type _bindgen_ty_5 = libc::c_int;
pub const _PDCLIB_assert_577: _bindgen_ty_6 = 1;
pub type _bindgen_ty_6 = libc::c_int;
pub const _PDCLIB_assert_580: _bindgen_ty_7 = 1;
pub type _bindgen_ty_7 = libc::c_int;
pub const _PDCLIB_assert_586: _bindgen_ty_8 = 1;
pub type _bindgen_ty_8 = libc::c_int;
pub const _PDCLIB_assert_589: _bindgen_ty_9 = 1;
pub type _bindgen_ty_9 = libc::c_int;
pub type fpos_t = _PDCLIB_fpos_t;
pub type FILE = _PDCLIB_file_t;
extern "C" {
    pub static mut stdin: *mut FILE;
}
extern "C" {
    pub static mut stdout: *mut FILE;
}
extern "C" {
    pub static mut stderr: *mut FILE;
}
extern "C" {
    pub fn remove(filename: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn rename(oldpath: *const libc::c_char, newpath: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
extern "C" {
    pub fn tmpnam(s: *mut libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn fclose(stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn fflush(stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn fopen(filename: *const libc::c_char, mode: *const libc::c_char) -> *mut FILE;
}
extern "C" {
    pub fn freopen(
        filename: *const libc::c_char,
        mode: *const libc::c_char,
        stream: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn setbuf(stream: *mut FILE, buf: *mut libc::c_char);
}
extern "C" {
    pub fn setvbuf(
        stream: *mut FILE,
        buf: *mut libc::c_char,
        mode: libc::c_int,
        size: usize,
    ) -> libc::c_int;
}
extern "C" {
    pub fn fprintf(stream: *mut FILE, format: *const libc::c_char, ...) -> libc::c_int;
}
extern "C" {
    pub fn fscanf(stream: *mut FILE, format: *const libc::c_char, ...) -> libc::c_int;
}
extern "C" {
    pub fn printf(format: *const libc::c_char, ...) -> libc::c_int;
}
extern "C" {
    pub fn scanf(format: *const libc::c_char, ...) -> libc::c_int;
}
extern "C" {
    pub fn snprintf(
        s: *mut libc::c_char,
        n: libc::c_uint,
        format: *const libc::c_char,
        ...
    ) -> libc::c_int;
}
extern "C" {
    pub fn sprintf(s: *mut libc::c_char, format: *const libc::c_char, ...) -> libc::c_int;
}
extern "C" {
    pub fn sscanf(s: *const libc::c_char, format: *const libc::c_char, ...) -> libc::c_int;
}
extern "C" {
    pub fn vfprintf(
        stream: *mut FILE,
        format: *const libc::c_char,
        arg: __builtin_va_list,
    ) -> libc::c_int;
}
extern "C" {
    pub fn vfscanf(
        stream: *mut FILE,
        format: *const libc::c_char,
        arg: __builtin_va_list,
    ) -> libc::c_int;
}
extern "C" {
    pub fn vprintf(format: *const libc::c_char, arg: __builtin_va_list) -> libc::c_int;
}
extern "C" {
    pub fn vscanf(format: *const libc::c_char, arg: __builtin_va_list) -> libc::c_int;
}
extern "C" {
    pub fn vsnprintf(
        s: *mut libc::c_char,
        n: libc::c_uint,
        format: *const libc::c_char,
        arg: __builtin_va_list,
    ) -> libc::c_int;
}
extern "C" {
    pub fn vsprintf(
        s: *mut libc::c_char,
        format: *const libc::c_char,
        arg: __builtin_va_list,
    ) -> libc::c_int;
}
extern "C" {
    pub fn vsscanf(
        s: *const libc::c_char,
        format: *const libc::c_char,
        arg: __builtin_va_list,
    ) -> libc::c_int;
}
extern "C" {
    pub fn fgetc(stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn fgets(s: *mut libc::c_char, n: libc::c_int, stream: *mut FILE) -> *mut libc::c_char;
}
extern "C" {
    pub fn fputc(c: libc::c_int, stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn fputs(s: *const libc::c_char, stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn getc(stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn getchar() -> libc::c_int;
}
extern "C" {
    pub fn putc(c: libc::c_int, stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn putchar(c: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn puts(s: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn ungetc(c: libc::c_int, stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn fread(
        ptr: *mut libc::c_void,
        size: libc::c_uint,
        nmemb: libc::c_uint,
        stream: *mut FILE,
    ) -> libc::c_uint;
}
extern "C" {
    pub fn fwrite(
        ptr: *const libc::c_void,
        size: libc::c_uint,
        nmemb: libc::c_uint,
        stream: *mut FILE,
    ) -> libc::c_uint;
}
extern "C" {
    pub fn fgetpos(stream: *mut FILE, pos: *mut fpos_t) -> libc::c_int;
}
extern "C" {
    pub fn fseek(stream: *mut FILE, offset: libc::c_long, whence: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn fsetpos(stream: *mut FILE, pos: *const fpos_t) -> libc::c_int;
}
extern "C" {
    pub fn ftell(stream: *mut FILE) -> libc::c_long;
}
extern "C" {
    pub fn rewind(stream: *mut FILE);
}
extern "C" {
    pub fn clearerr(stream: *mut FILE);
}
extern "C" {
    pub fn feof(stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn ferror(stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn perror(s: *const libc::c_char);
}
extern "C" {
    pub fn atof(nptr: *const libc::c_char) -> f64;
}
extern "C" {
    pub fn strtod(nptr: *const libc::c_char, endptr: *mut *mut libc::c_char) -> f64;
}
extern "C" {
    pub fn strtof(nptr: *const libc::c_char, endptr: *mut *mut libc::c_char) -> f32;
}
extern "C" {
    pub fn strtold(nptr: *const libc::c_char, endptr: *mut *mut libc::c_char) -> f64;
}
extern "C" {
    pub fn strtol(
        nptr: *const libc::c_char,
        endptr: *mut *mut libc::c_char,
        base: libc::c_int,
    ) -> libc::c_long;
}
extern "C" {
    pub fn strtoll(
        nptr: *const libc::c_char,
        endptr: *mut *mut libc::c_char,
        base: libc::c_int,
    ) -> libc::c_longlong;
}
extern "C" {
    pub fn strtoul(
        nptr: *const libc::c_char,
        endptr: *mut *mut libc::c_char,
        base: libc::c_int,
    ) -> libc::c_ulong;
}
extern "C" {
    pub fn strtoull(
        nptr: *const libc::c_char,
        endptr: *mut *mut libc::c_char,
        base: libc::c_int,
    ) -> libc::c_ulonglong;
}
extern "C" {
    pub fn atoi(nptr: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn atol(nptr: *const libc::c_char) -> libc::c_long;
}
extern "C" {
    pub fn atoll(nptr: *const libc::c_char) -> libc::c_longlong;
}
extern "C" {
    pub static mut _PDCLIB_seed: libc::c_ulong;
}
extern "C" {
    pub fn rand() -> libc::c_int;
}
extern "C" {
    pub fn srand(seed: libc::c_uint);
}
extern "C" {
    pub fn malloc(size: libc::c_uint) -> *mut libc::c_void;
}
extern "C" {
    pub fn calloc(nmemb: libc::c_uint, size: libc::c_uint) -> *mut libc::c_void;
}
extern "C" {
    pub fn aligned_alloc(alignment: libc::c_uint, size: libc::c_uint) -> *mut libc::c_void;
}
extern "C" {
    pub fn free(ptr: *mut libc::c_void);
}
extern "C" {
    pub fn realloc(ptr: *mut libc::c_void, size: libc::c_uint) -> *mut libc::c_void;
}
extern "C" {
    pub fn abort() -> !;
}
extern "C" {
    pub fn at_quick_exit(func: ::core::option::Option<unsafe extern "C" fn()>) -> libc::c_int;
}
extern "C" {
    pub fn atexit(func: ::core::option::Option<unsafe extern "C" fn()>) -> libc::c_int;
}
extern "C" {
    pub fn exit(status: libc::c_int) -> !;
}
extern "C" {
    pub fn quick_exit(status: libc::c_int);
}
extern "C" {
    pub fn _Exit(status: libc::c_int) -> !;
}
extern "C" {
    pub fn getenv(name: *const libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn system(string: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn bsearch(
        key: *const libc::c_void,
        base: *const libc::c_void,
        nmemb: usize,
        size: usize,
        compar: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *const libc::c_void,
                arg2: *const libc::c_void,
            ) -> libc::c_int,
        >,
    ) -> *mut libc::c_void;
}
extern "C" {
    pub fn qsort(
        base: *mut libc::c_void,
        nmemb: usize,
        size: usize,
        compar: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *const libc::c_void,
                arg2: *const libc::c_void,
            ) -> libc::c_int,
        >,
    );
}
extern "C" {
    pub fn abs(j: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn labs(j: libc::c_long) -> libc::c_long;
}
extern "C" {
    pub fn llabs(j: libc::c_longlong) -> libc::c_longlong;
}
pub type div_t = _PDCLIB_div_t;
pub type ldiv_t = _PDCLIB_ldiv_t;
pub type lldiv_t = _PDCLIB_lldiv_t;
extern "C" {
    pub fn div(numer: libc::c_int, denom: libc::c_int) -> div_t;
}
extern "C" {
    pub fn ldiv(numer: libc::c_long, denom: libc::c_long) -> ldiv_t;
}
extern "C" {
    pub fn lldiv(numer: libc::c_longlong, denom: libc::c_longlong) -> lldiv_t;
}
extern "C" {
    pub fn _byteswap_ushort(val: libc::c_ushort) -> libc::c_ushort;
}
extern "C" {
    pub fn _byteswap_ulong(val: libc::c_ulong) -> libc::c_ulong;
}
extern "C" {
    pub fn _byteswap_uint64(val: libc::c_ulonglong) -> libc::c_ulonglong;
}
pub type _purecall_handler = ::core::option::Option<unsafe extern "C" fn()>;
extern "C" {
    pub fn _get_purecall_handler() -> _purecall_handler;
}
extern "C" {
    pub fn _set_purecall_handler(function: _purecall_handler) -> _purecall_handler;
}
pub type int_least8_t = i8;
pub type int_least16_t = i16;
pub type int_least32_t = i32;
pub type int_least64_t = i64;
pub type uint_least8_t = u8;
pub type uint_least16_t = u16;
pub type uint_least32_t = u32;
pub type uint_least64_t = u64;
pub type int_fast8_t = _PDCLIB_int_fast8_t;
pub type int_fast16_t = _PDCLIB_int_fast16_t;
pub type int_fast32_t = _PDCLIB_int_fast32_t;
pub type int_fast64_t = _PDCLIB_int_fast64_t;
pub type uint_fast8_t = _PDCLIB_uint_fast8_t;
pub type uint_fast16_t = _PDCLIB_uint_fast16_t;
pub type uint_fast32_t = _PDCLIB_uint_fast32_t;
pub type uint_fast64_t = _PDCLIB_uint_fast64_t;
pub type intmax_t = _PDCLIB_intmax_t;
pub type uintmax_t = _PDCLIB_uintmax_t;
pub type wchar_t = _PDCLIB_wchar_t;
pub type wint_t = _PDCLIB_wint_t;
pub type wctrans_t = libc::c_int;
pub type wctype_t = libc::c_int;
extern "C" {
    pub fn iswalnum(wc: wint_t) -> libc::c_int;
}
extern "C" {
    pub fn iswalpha(wc: wint_t) -> libc::c_int;
}
extern "C" {
    pub fn iswblank(wc: wint_t) -> libc::c_int;
}
extern "C" {
    pub fn iswcntrl(wc: wint_t) -> libc::c_int;
}
extern "C" {
    pub fn iswdigit(wc: wint_t) -> libc::c_int;
}
extern "C" {
    pub fn iswgraph(wc: wint_t) -> libc::c_int;
}
extern "C" {
    pub fn iswlower(wc: wint_t) -> libc::c_int;
}
extern "C" {
    pub fn iswprint(wc: wint_t) -> libc::c_int;
}
extern "C" {
    pub fn iswpunct(wc: wint_t) -> libc::c_int;
}
extern "C" {
    pub fn iswspace(wc: wint_t) -> libc::c_int;
}
extern "C" {
    pub fn iswupper(wc: wint_t) -> libc::c_int;
}
extern "C" {
    pub fn iswxdigit(wc: wint_t) -> libc::c_int;
}
extern "C" {
    pub fn iswctype(wc: wint_t, desc: wctype_t) -> libc::c_int;
}
extern "C" {
    pub fn wctype(property: *const libc::c_char) -> wctype_t;
}
extern "C" {
    pub fn towlower(wc: wint_t) -> wint_t;
}
extern "C" {
    pub fn towupper(wc: wint_t) -> wint_t;
}
extern "C" {
    pub fn towctrans(wc: wint_t, desc: wctrans_t) -> wint_t;
}
extern "C" {
    pub fn wctrans(property: *const libc::c_char) -> wctrans_t;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct XBOXRT_mbstate {
    pub __bindgen_anon_1: XBOXRT_mbstate__bindgen_ty_1,
    pub _Surrogate: u16,
    pub _PendState: libc::c_uchar,
    pub _PendChar: libc::c_char,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union XBOXRT_mbstate__bindgen_ty_1 {
    pub _St64: [u64; 15usize],
    pub _St32: [u32; 31usize],
    pub _St16: [u16; 62usize],
    pub _StUC: [libc::c_uchar; 124usize],
    pub _StSC: [libc::c_schar; 124usize],
    pub _StC: [libc::c_char; 124usize],
}
#[test]
fn bindgen_test_layout_XBOXRT_mbstate__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<XBOXRT_mbstate__bindgen_ty_1> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<XBOXRT_mbstate__bindgen_ty_1>(),
        128usize,
        concat!("Size of: ", stringify!(XBOXRT_mbstate__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<XBOXRT_mbstate__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(XBOXRT_mbstate__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._St64) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XBOXRT_mbstate__bindgen_ty_1),
            "::",
            stringify!(_St64)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._St32) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XBOXRT_mbstate__bindgen_ty_1),
            "::",
            stringify!(_St32)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._St16) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XBOXRT_mbstate__bindgen_ty_1),
            "::",
            stringify!(_St16)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._StUC) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XBOXRT_mbstate__bindgen_ty_1),
            "::",
            stringify!(_StUC)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._StSC) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XBOXRT_mbstate__bindgen_ty_1),
            "::",
            stringify!(_StSC)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._StC) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XBOXRT_mbstate__bindgen_ty_1),
            "::",
            stringify!(_StC)
        )
    );
}
#[test]
fn bindgen_test_layout_XBOXRT_mbstate() {
    const UNINIT: ::core::mem::MaybeUninit<XBOXRT_mbstate> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<XBOXRT_mbstate>(),
        136usize,
        concat!("Size of: ", stringify!(XBOXRT_mbstate))
    );
    assert_eq!(
        ::core::mem::align_of::<XBOXRT_mbstate>(),
        8usize,
        concat!("Alignment of ", stringify!(XBOXRT_mbstate))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._Surrogate) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(XBOXRT_mbstate),
            "::",
            stringify!(_Surrogate)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._PendState) as usize - ptr as usize },
        130usize,
        concat!(
            "Offset of field: ",
            stringify!(XBOXRT_mbstate),
            "::",
            stringify!(_PendState)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._PendChar) as usize - ptr as usize },
        131usize,
        concat!(
            "Offset of field: ",
            stringify!(XBOXRT_mbstate),
            "::",
            stringify!(_PendChar)
        )
    );
}
pub type XBOXRT_mbstate_t = XBOXRT_mbstate;
pub type mbstate_t = XBOXRT_mbstate_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm {
    _unused: [u8; 0],
}
extern "C" {
    pub fn wcscpy(s1: *mut wchar_t, s2: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsncpy(s1: *mut wchar_t, s2: *const wchar_t, n: usize) -> *mut wchar_t;
}
extern "C" {
    pub fn wmemcpy(
        s1: *mut libc::c_ushort,
        s2: *const libc::c_ushort,
        n: libc::c_uint,
    ) -> *mut libc::c_ushort;
}
extern "C" {
    pub fn wmemmove(
        s1: *mut libc::c_ushort,
        s2: *const libc::c_ushort,
        n: libc::c_uint,
    ) -> *mut libc::c_ushort;
}
extern "C" {
    pub fn wcscat(s1: *mut wchar_t, s2: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsncat(s1: *mut wchar_t, s2: *const wchar_t, n: usize) -> *mut wchar_t;
}
extern "C" {
    pub fn wcscmp(s1: *const libc::c_ushort, s2: *const libc::c_ushort) -> libc::c_int;
}
extern "C" {
    pub fn wcscoll(s1: *const wchar_t, s2: *const wchar_t) -> libc::c_int;
}
extern "C" {
    pub fn wcsncmp(
        s1: *const libc::c_ushort,
        s2: *const libc::c_ushort,
        n: libc::c_uint,
    ) -> libc::c_int;
}
extern "C" {
    pub fn wcsxfrm(s1: *mut wchar_t, s2: *const wchar_t, n: usize) -> usize;
}
extern "C" {
    pub fn wmemcmp(
        s1: *const libc::c_ushort,
        s2: *const libc::c_ushort,
        n: libc::c_uint,
    ) -> libc::c_int;
}
extern "C" {
    pub fn wcschr(s: *const libc::c_ushort, c: libc::c_ushort) -> *mut libc::c_ushort;
}
extern "C" {
    pub fn wcscspn(s1: *const wchar_t, s2: *const wchar_t) -> usize;
}
extern "C" {
    pub fn wcspbrk(s1: *const wchar_t, s2: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsrchr(s: *const wchar_t, c: wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsspn(s1: *const wchar_t, s2: *const wchar_t) -> usize;
}
extern "C" {
    pub fn wcsstr(s1: *const wchar_t, s2: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcstok(s1: *mut wchar_t, s2: *const wchar_t, ptr: *mut *mut wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wmemchr(
        s: *const libc::c_ushort,
        c: libc::c_ushort,
        n: libc::c_uint,
    ) -> *mut libc::c_ushort;
}
extern "C" {
    pub fn wcslen(s: *const libc::c_ushort) -> libc::c_uint;
}
extern "C" {
    pub fn mbsinit(ps: *const mbstate_t) -> libc::c_int;
}
extern "C" {
    pub fn mbrtowc(
        pwc: *mut wchar_t,
        s: *const libc::c_char,
        n: usize,
        ps: *mut mbstate_t,
    ) -> usize;
}
extern "C" {
    pub fn wcrtomb(s: *mut libc::c_char, wc: wchar_t, ps: *mut mbstate_t) -> usize;
}
extern "C" {
    pub fn wmemset(wcs: *mut wchar_t, wc: wchar_t, n: usize) -> *mut wchar_t;
}
extern "C" {
    pub fn wcstod(nptr: *const wchar_t, endptr: *mut *mut wchar_t) -> f64;
}
extern "C" {
    pub fn wcstof(nptr: *const wchar_t, endptr: *mut *mut wchar_t) -> f32;
}
extern "C" {
    pub fn wcstold(nptr: *const wchar_t, endptr: *mut *mut wchar_t) -> f64;
}
extern "C" {
    pub fn wcstol(
        nptr: *const wchar_t,
        endptr: *mut *mut wchar_t,
        base: libc::c_int,
    ) -> libc::c_long;
}
extern "C" {
    pub fn wcstoll(
        nptr: *const wchar_t,
        endptr: *mut *mut wchar_t,
        base: libc::c_int,
    ) -> libc::c_longlong;
}
extern "C" {
    pub fn wcstoul(
        nptr: *const wchar_t,
        endptr: *mut *mut wchar_t,
        base: libc::c_int,
    ) -> libc::c_ulong;
}
extern "C" {
    pub fn wcstoull(
        nptr: *const wchar_t,
        endptr: *mut *mut wchar_t,
        base: libc::c_int,
    ) -> libc::c_ulonglong;
}
extern "C" {
    pub fn mbrlen(s: *const libc::c_char, n: usize, ps: *mut mbstate_t) -> usize;
}
extern "C" {
    pub fn btowc(c: libc::c_int) -> wint_t;
}
extern "C" {
    pub fn mbsrtowcs(
        dest: *mut wchar_t,
        src: *mut *const libc::c_char,
        len: usize,
        ps: *mut mbstate_t,
    ) -> usize;
}
extern "C" {
    pub fn wctob(c: wint_t) -> libc::c_int;
}
extern "C" {
    pub fn wcrtomb_s(
        retval: *mut usize,
        s: *mut libc::c_char,
        ssz: usize,
        wc: wchar_t,
        ps: *mut mbstate_t,
    ) -> libc::c_int;
}
extern "C" {
    pub fn _snwprintf(
        buffer: *mut wchar_t,
        count: usize,
        format: *const wchar_t,
        ...
    ) -> libc::c_int;
}
extern "C" {
    pub fn mbtowc(pwc: *mut wchar_t, string: *const libc::c_char, n: usize) -> libc::c_int;
}
extern "C" {
    pub fn memcpy(
        s1: *mut libc::c_void,
        s2: *const libc::c_void,
        n: libc::c_uint,
    ) -> *mut libc::c_void;
}
extern "C" {
    pub fn memmove(
        s1: *mut libc::c_void,
        s2: *const libc::c_void,
        n: libc::c_uint,
    ) -> *mut libc::c_void;
}
extern "C" {
    pub fn strcpy(s1: *mut libc::c_char, s2: *const libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn strncpy(
        s1: *mut libc::c_char,
        s2: *const libc::c_char,
        n: libc::c_uint,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn strcat(s1: *mut libc::c_char, s2: *const libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn strncat(
        s1: *mut libc::c_char,
        s2: *const libc::c_char,
        n: libc::c_uint,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn memcmp(s1: *const libc::c_void, s2: *const libc::c_void, n: libc::c_uint)
        -> libc::c_int;
}
extern "C" {
    pub fn strcmp(s1: *const libc::c_char, s2: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn strcoll(s1: *const libc::c_char, s2: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn strncmp(
        s1: *const libc::c_char,
        s2: *const libc::c_char,
        n: libc::c_uint,
    ) -> libc::c_int;
}
extern "C" {
    pub fn strxfrm(s1: *mut libc::c_char, s2: *const libc::c_char, n: libc::c_uint)
        -> libc::c_uint;
}
extern "C" {
    pub fn memchr(s: *const libc::c_void, c: libc::c_int, n: libc::c_uint) -> *mut libc::c_void;
}
extern "C" {
    pub fn strchr(s: *const libc::c_char, c: libc::c_int) -> *mut libc::c_char;
}
extern "C" {
    pub fn strcspn(s1: *const libc::c_char, s2: *const libc::c_char) -> libc::c_uint;
}
extern "C" {
    pub fn strpbrk(s1: *const libc::c_char, s2: *const libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn strrchr(s: *const libc::c_char, c: libc::c_int) -> *mut libc::c_char;
}
extern "C" {
    pub fn strspn(s1: *const libc::c_char, s2: *const libc::c_char) -> libc::c_uint;
}
extern "C" {
    pub fn strstr(s1: *const libc::c_char, s2: *const libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn strtok(s1: *mut libc::c_char, s2: *const libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn memset(s: *mut libc::c_void, c: libc::c_int, n: libc::c_uint) -> *mut libc::c_void;
}
extern "C" {
    pub fn strerror(errnum: libc::c_int) -> *mut libc::c_char;
}
extern "C" {
    pub fn strlen(s: *const libc::c_char) -> libc::c_uint;
}
extern "C" {
    pub fn strdup(s: *const libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn _strnicmp(s1: *const libc::c_char, s2: *const libc::c_char, n: usize) -> libc::c_int;
}
extern "C" {
    pub fn _stricmp(s1: *const libc::c_char, s2: *const libc::c_char) -> libc::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct qTD_t {
    pub Next_qTD: u32,
    pub Alt_Next_qTD: u32,
    pub Token: u32,
    pub Bptr: [u32; 5usize],
    pub utr: *mut utr_t,
    pub xfer_len: u32,
    pub qh: *mut qh_t,
    pub next: *mut qTD_t,
}
#[test]
fn bindgen_test_layout_qTD_t() {
    const UNINIT: ::core::mem::MaybeUninit<qTD_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<qTD_t>(),
        48usize,
        concat!("Size of: ", stringify!(qTD_t))
    );
    assert_eq!(
        ::core::mem::align_of::<qTD_t>(),
        4usize,
        concat!("Alignment of ", stringify!(qTD_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Next_qTD) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(qTD_t),
            "::",
            stringify!(Next_qTD)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Alt_Next_qTD) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(qTD_t),
            "::",
            stringify!(Alt_Next_qTD)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Token) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(qTD_t),
            "::",
            stringify!(Token)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Bptr) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(qTD_t),
            "::",
            stringify!(Bptr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).utr) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(qTD_t),
            "::",
            stringify!(utr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xfer_len) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(qTD_t),
            "::",
            stringify!(xfer_len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).qh) as usize - ptr as usize },
        40usize,
        concat!("Offset of field: ", stringify!(qTD_t), "::", stringify!(qh))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(qTD_t),
            "::",
            stringify!(next)
        )
    );
}
pub type qTD_T = qTD_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct qh_t {
    pub HLink: u32,
    pub Chrst: u32,
    pub Cap: u32,
    pub Curr_qTD: u32,
    pub OL_Next_qTD: u32,
    pub OL_Alt_Next_qTD: u32,
    pub OL_Token: u32,
    pub OL_Bptr: [u32; 5usize],
    pub qtd_list: *mut qTD_T,
    pub done_list: *mut qTD_T,
    pub next: *mut qh_t,
}
#[test]
fn bindgen_test_layout_qh_t() {
    const UNINIT: ::core::mem::MaybeUninit<qh_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<qh_t>(),
        60usize,
        concat!("Size of: ", stringify!(qh_t))
    );
    assert_eq!(
        ::core::mem::align_of::<qh_t>(),
        4usize,
        concat!("Alignment of ", stringify!(qh_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HLink) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(qh_t),
            "::",
            stringify!(HLink)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Chrst) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(qh_t),
            "::",
            stringify!(Chrst)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Cap) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(qh_t), "::", stringify!(Cap))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Curr_qTD) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(qh_t),
            "::",
            stringify!(Curr_qTD)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).OL_Next_qTD) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(qh_t),
            "::",
            stringify!(OL_Next_qTD)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).OL_Alt_Next_qTD) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(qh_t),
            "::",
            stringify!(OL_Alt_Next_qTD)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).OL_Token) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(qh_t),
            "::",
            stringify!(OL_Token)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).OL_Bptr) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(qh_t),
            "::",
            stringify!(OL_Bptr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).qtd_list) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(qh_t),
            "::",
            stringify!(qtd_list)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).done_list) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(qh_t),
            "::",
            stringify!(done_list)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(qh_t),
            "::",
            stringify!(next)
        )
    );
}
pub type QH_T = qh_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct itd_t {
    pub Next_Link: u32,
    pub Transaction: [u32; 8usize],
    pub Bptr: [u32; 7usize],
    pub iso_ep: *mut iso_ep_t,
    pub utr: *mut utr_t,
    pub buff_base: u32,
    pub fidx: u8,
    pub trans_mask: u8,
    pub sched_frnidx: u32,
    pub next: *mut itd_t,
}
#[test]
fn bindgen_test_layout_itd_t() {
    const UNINIT: ::core::mem::MaybeUninit<itd_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<itd_t>(),
        88usize,
        concat!("Size of: ", stringify!(itd_t))
    );
    assert_eq!(
        ::core::mem::align_of::<itd_t>(),
        4usize,
        concat!("Alignment of ", stringify!(itd_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Next_Link) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(itd_t),
            "::",
            stringify!(Next_Link)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Transaction) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(itd_t),
            "::",
            stringify!(Transaction)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Bptr) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(itd_t),
            "::",
            stringify!(Bptr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).iso_ep) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(itd_t),
            "::",
            stringify!(iso_ep)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).utr) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(itd_t),
            "::",
            stringify!(utr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).buff_base) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(itd_t),
            "::",
            stringify!(buff_base)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).fidx) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(itd_t),
            "::",
            stringify!(fidx)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).trans_mask) as usize - ptr as usize },
        77usize,
        concat!(
            "Offset of field: ",
            stringify!(itd_t),
            "::",
            stringify!(trans_mask)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sched_frnidx) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(itd_t),
            "::",
            stringify!(sched_frnidx)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(itd_t),
            "::",
            stringify!(next)
        )
    );
}
pub type iTD_T = itd_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sitd_t {
    pub Next_Link: u32,
    pub Chrst: u32,
    pub Sched: u32,
    pub StsCtrl: u32,
    pub Bptr: [u32; 2usize],
    pub BackLink: u32,
    pub iso_ep: *mut iso_ep_t,
    pub utr: *mut utr_t,
    pub fidx: u8,
    pub sched_frnidx: u32,
    pub next: *mut sitd_t,
}
#[test]
fn bindgen_test_layout_sitd_t() {
    const UNINIT: ::core::mem::MaybeUninit<sitd_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sitd_t>(),
        48usize,
        concat!("Size of: ", stringify!(sitd_t))
    );
    assert_eq!(
        ::core::mem::align_of::<sitd_t>(),
        4usize,
        concat!("Alignment of ", stringify!(sitd_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Next_Link) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sitd_t),
            "::",
            stringify!(Next_Link)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Chrst) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sitd_t),
            "::",
            stringify!(Chrst)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Sched) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(sitd_t),
            "::",
            stringify!(Sched)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).StsCtrl) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(sitd_t),
            "::",
            stringify!(StsCtrl)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Bptr) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(sitd_t),
            "::",
            stringify!(Bptr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BackLink) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(sitd_t),
            "::",
            stringify!(BackLink)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).iso_ep) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(sitd_t),
            "::",
            stringify!(iso_ep)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).utr) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(sitd_t),
            "::",
            stringify!(utr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).fidx) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(sitd_t),
            "::",
            stringify!(fidx)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sched_frnidx) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(sitd_t),
            "::",
            stringify!(sched_frnidx)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(sitd_t),
            "::",
            stringify!(next)
        )
    );
}
pub type siTD_T = sitd_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iso_ep_t {
    pub ep: *mut ep_info_t,
    pub next_frame: u32,
    pub itd_list: *mut iTD_T,
    pub itd_done_list: *mut iTD_T,
    pub sitd_list: *mut siTD_T,
    pub sitd_done_list: *mut siTD_T,
    pub next: *mut iso_ep_t,
}
#[test]
fn bindgen_test_layout_iso_ep_t() {
    const UNINIT: ::core::mem::MaybeUninit<iso_ep_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<iso_ep_t>(),
        28usize,
        concat!("Size of: ", stringify!(iso_ep_t))
    );
    assert_eq!(
        ::core::mem::align_of::<iso_ep_t>(),
        4usize,
        concat!("Alignment of ", stringify!(iso_ep_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ep) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iso_ep_t),
            "::",
            stringify!(ep)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).next_frame) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(iso_ep_t),
            "::",
            stringify!(next_frame)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).itd_list) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(iso_ep_t),
            "::",
            stringify!(itd_list)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).itd_done_list) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(iso_ep_t),
            "::",
            stringify!(itd_done_list)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sitd_list) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(iso_ep_t),
            "::",
            stringify!(sitd_list)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sitd_done_list) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(iso_ep_t),
            "::",
            stringify!(sitd_done_list)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(iso_ep_t),
            "::",
            stringify!(next)
        )
    );
}
pub type ISO_EP_T = iso_ep_t;
extern "C" {
    pub fn scan_isochronous_list();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ed_t {
    pub Info: u32,
    pub TailP: u32,
    pub HeadP: u32,
    pub NextED: u32,
    pub bInterval: u8,
    pub next_sf: u16,
    pub next: *mut ed_t,
}
#[test]
fn bindgen_test_layout_ed_t() {
    const UNINIT: ::core::mem::MaybeUninit<ed_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<ed_t>(),
        24usize,
        concat!("Size of: ", stringify!(ed_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ed_t>(),
        4usize,
        concat!("Alignment of ", stringify!(ed_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Info) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ed_t),
            "::",
            stringify!(Info)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TailP) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ed_t),
            "::",
            stringify!(TailP)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HeadP) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ed_t),
            "::",
            stringify!(HeadP)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).NextED) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ed_t),
            "::",
            stringify!(NextED)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bInterval) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ed_t),
            "::",
            stringify!(bInterval)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).next_sf) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(ed_t),
            "::",
            stringify!(next_sf)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ed_t),
            "::",
            stringify!(next)
        )
    );
}
pub type ED_T = ed_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct td_t {
    pub Info: u32,
    pub CBP: u32,
    pub NextTD: u32,
    pub BE: u32,
    pub PSW: [u32; 4usize],
    pub buff_start: u32,
    pub ed: *mut ED_T,
    pub utr: *mut utr_t,
    pub next: *mut td_t,
}
#[test]
fn bindgen_test_layout_td_t() {
    const UNINIT: ::core::mem::MaybeUninit<td_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<td_t>(),
        48usize,
        concat!("Size of: ", stringify!(td_t))
    );
    assert_eq!(
        ::core::mem::align_of::<td_t>(),
        4usize,
        concat!("Alignment of ", stringify!(td_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Info) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(td_t),
            "::",
            stringify!(Info)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CBP) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(td_t), "::", stringify!(CBP))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).NextTD) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(td_t),
            "::",
            stringify!(NextTD)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BE) as usize - ptr as usize },
        12usize,
        concat!("Offset of field: ", stringify!(td_t), "::", stringify!(BE))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).PSW) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(td_t), "::", stringify!(PSW))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).buff_start) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(td_t),
            "::",
            stringify!(buff_start)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ed) as usize - ptr as usize },
        36usize,
        concat!("Offset of field: ", stringify!(td_t), "::", stringify!(ed))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).utr) as usize - ptr as usize },
        40usize,
        concat!("Offset of field: ", stringify!(td_t), "::", stringify!(utr))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(td_t),
            "::",
            stringify!(next)
        )
    );
}
pub type TD_T = td_t;
pub const OCHI_CC_CODE_CC_NOERROR: OCHI_CC_CODE = 0;
pub const OCHI_CC_CODE_CC_CRC: OCHI_CC_CODE = 1;
pub const OCHI_CC_CODE_CC_BITSTUFF: OCHI_CC_CODE = 2;
pub const OCHI_CC_CODE_CC_DATA_TOGGLE: OCHI_CC_CODE = 3;
pub const OCHI_CC_CODE_CC_STALL: OCHI_CC_CODE = 4;
pub const OCHI_CC_CODE_CC_NOTRESPONSE: OCHI_CC_CODE = 5;
pub const OCHI_CC_CODE_CC_PID_CHECK: OCHI_CC_CODE = 6;
pub const OCHI_CC_CODE_CC_UNEXPECTED_PID: OCHI_CC_CODE = 7;
pub const OCHI_CC_CODE_CC_DATA_OVERRUN: OCHI_CC_CODE = 8;
pub const OCHI_CC_CODE_CC_DATA_UNDERRUN: OCHI_CC_CODE = 9;
pub const OCHI_CC_CODE_CC_RESERVED1: OCHI_CC_CODE = 10;
pub const OCHI_CC_CODE_CC_RESERVED2: OCHI_CC_CODE = 11;
pub const OCHI_CC_CODE_CC_BUFFER_OVERRUN: OCHI_CC_CODE = 12;
pub const OCHI_CC_CODE_CC_BUFFER_UNDERRUN: OCHI_CC_CODE = 13;
pub const OCHI_CC_CODE_CC_NOT_ACCESS: OCHI_CC_CODE = 14;
pub type OCHI_CC_CODE = libc::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HCCA_T {
    pub int_table: [u32; 32usize],
    pub frame_no: u16,
    pub pad1: u16,
    pub done_head: u32,
    pub reserved_for_hc: [u8; 116usize],
}
#[test]
fn bindgen_test_layout_HCCA_T() {
    const UNINIT: ::core::mem::MaybeUninit<HCCA_T> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<HCCA_T>(),
        252usize,
        concat!("Size of: ", stringify!(HCCA_T))
    );
    assert_eq!(
        ::core::mem::align_of::<HCCA_T>(),
        4usize,
        concat!("Alignment of ", stringify!(HCCA_T))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).int_table) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(HCCA_T),
            "::",
            stringify!(int_table)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).frame_no) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(HCCA_T),
            "::",
            stringify!(frame_no)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pad1) as usize - ptr as usize },
        130usize,
        concat!(
            "Offset of field: ",
            stringify!(HCCA_T),
            "::",
            stringify!(pad1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).done_head) as usize - ptr as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(HCCA_T),
            "::",
            stringify!(done_head)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved_for_hc) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(HCCA_T),
            "::",
            stringify!(reserved_for_hc)
        )
    );
}
#[doc = "@addtogroup USBH USB Host Controller(USBH)\nMemory Mapped Structure for USBH Controller\n@{"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct USBH_T {
    #[doc = "< [0x0000] Host Controller Revision Register"]
    pub HcRevision: u32,
    #[doc = "< [0x0004] Host Controller Control Register"]
    pub HcControl: u32,
    #[doc = "< [0x0008] Host Controller Command Status Register"]
    pub HcCommandStatus: u32,
    #[doc = "< [0x000c] Host Controller Interrupt Status Register"]
    pub HcInterruptStatus: u32,
    #[doc = "< [0x0010] Host Controller Interrupt Enable Register"]
    pub HcInterruptEnable: u32,
    #[doc = "< [0x0014] Host Controller Interrupt Disable Register"]
    pub HcInterruptDisable: u32,
    #[doc = "< [0x0018] Host Controller Communication Area Register"]
    pub HcHCCA: u32,
    #[doc = "< [0x001c] Host Controller Period Current ED Register"]
    pub HcPeriodCurrentED: u32,
    #[doc = "< [0x0020] Host Controller Control Head ED Register"]
    pub HcControlHeadED: u32,
    #[doc = "< [0x0024] Host Controller Control Current ED Register"]
    pub HcControlCurrentED: u32,
    #[doc = "< [0x0028] Host Controller Bulk Head ED Register"]
    pub HcBulkHeadED: u32,
    #[doc = "< [0x002c] Host Controller Bulk Current ED Register"]
    pub HcBulkCurrentED: u32,
    #[doc = "< [0x0030] Host Controller Done Head Register"]
    pub HcDoneHead: u32,
    #[doc = "< [0x0034] Host Controller Frame Interval Register"]
    pub HcFmInterval: u32,
    #[doc = "< [0x0038] Host Controller Frame Remaining Register"]
    pub HcFmRemaining: u32,
    #[doc = "< [0x003c] Host Controller Frame Number Register"]
    pub HcFmNumber: u32,
    #[doc = "< [0x0040] Host Controller Periodic Start Register"]
    pub HcPeriodicStart: u32,
    #[doc = "< [0x0044] Host Controller Low-speed Threshold Register"]
    pub HcLSThreshold: u32,
    #[doc = "< [0x0048] Host Controller Root Hub Descriptor A Register"]
    pub HcRhDescriptorA: u32,
    #[doc = "< [0x004c] Host Controller Root Hub Descriptor B Register"]
    pub HcRhDescriptorB: u32,
    #[doc = "< [0x0050] Host Controller Root Hub Status Register"]
    pub HcRhStatus: u32,
    #[doc = "< [0x0054] Host Controller Root Hub Port Status [1]"]
    pub HcRhPortStatus: [u32; 4usize],
    pub RESERVE0: [u32; 105usize],
    #[doc = "< [0x0200] Host Controller PHY Control Register"]
    pub HcPhyControl: u32,
    #[doc = "< [0x0204] Host Controller Miscellaneous Control Register"]
    pub HcMiscControl: u32,
}
#[test]
fn bindgen_test_layout_USBH_T() {
    const UNINIT: ::core::mem::MaybeUninit<USBH_T> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<USBH_T>(),
        528usize,
        concat!("Size of: ", stringify!(USBH_T))
    );
    assert_eq!(
        ::core::mem::align_of::<USBH_T>(),
        4usize,
        concat!("Alignment of ", stringify!(USBH_T))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HcRevision) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(USBH_T),
            "::",
            stringify!(HcRevision)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HcControl) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(USBH_T),
            "::",
            stringify!(HcControl)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HcCommandStatus) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(USBH_T),
            "::",
            stringify!(HcCommandStatus)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HcInterruptStatus) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(USBH_T),
            "::",
            stringify!(HcInterruptStatus)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HcInterruptEnable) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(USBH_T),
            "::",
            stringify!(HcInterruptEnable)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HcInterruptDisable) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(USBH_T),
            "::",
            stringify!(HcInterruptDisable)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HcHCCA) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(USBH_T),
            "::",
            stringify!(HcHCCA)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HcPeriodCurrentED) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(USBH_T),
            "::",
            stringify!(HcPeriodCurrentED)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HcControlHeadED) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(USBH_T),
            "::",
            stringify!(HcControlHeadED)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HcControlCurrentED) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(USBH_T),
            "::",
            stringify!(HcControlCurrentED)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HcBulkHeadED) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(USBH_T),
            "::",
            stringify!(HcBulkHeadED)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HcBulkCurrentED) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(USBH_T),
            "::",
            stringify!(HcBulkCurrentED)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HcDoneHead) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(USBH_T),
            "::",
            stringify!(HcDoneHead)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HcFmInterval) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(USBH_T),
            "::",
            stringify!(HcFmInterval)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HcFmRemaining) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(USBH_T),
            "::",
            stringify!(HcFmRemaining)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HcFmNumber) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(USBH_T),
            "::",
            stringify!(HcFmNumber)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HcPeriodicStart) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(USBH_T),
            "::",
            stringify!(HcPeriodicStart)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HcLSThreshold) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(USBH_T),
            "::",
            stringify!(HcLSThreshold)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HcRhDescriptorA) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(USBH_T),
            "::",
            stringify!(HcRhDescriptorA)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HcRhDescriptorB) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(USBH_T),
            "::",
            stringify!(HcRhDescriptorB)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HcRhStatus) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(USBH_T),
            "::",
            stringify!(HcRhStatus)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HcRhPortStatus) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(USBH_T),
            "::",
            stringify!(HcRhPortStatus)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RESERVE0) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(USBH_T),
            "::",
            stringify!(RESERVE0)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HcPhyControl) as usize - ptr as usize },
        520usize,
        concat!(
            "Offset of field: ",
            stringify!(USBH_T),
            "::",
            stringify!(HcPhyControl)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HcMiscControl) as usize - ptr as usize },
        524usize,
        concat!(
            "Offset of field: ",
            stringify!(USBH_T),
            "::",
            stringify!(HcMiscControl)
        )
    );
}
#[doc = "@addtogroup HSUSBH High Speed USB Host Controller (HSUSBH)\nMemory Mapped Structure for HSUSBH Controller\n@{"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HSUSBH_T {
    #[doc = "< [0x0000] EHCI Version Number Register"]
    pub EHCVNR: u32,
    #[doc = "< [0x0004] EHCI Structural Parameters Register"]
    pub EHCSPR: u32,
    #[doc = "< [0x0008] EHCI Capability Parameters Register"]
    pub EHCCPR: u32,
    pub RESERVE0: [u32; 5usize],
    #[doc = "< [0x0020] USB Command Register"]
    pub UCMDR: u32,
    #[doc = "< [0x0024] USB Status Register"]
    pub USTSR: u32,
    #[doc = "< [0x0028] USB Interrupt Enable Register"]
    pub UIENR: u32,
    #[doc = "< [0x002c] USB Frame Index Register"]
    pub UFINDR: u32,
    pub RESERVE1: [u32; 1usize],
    #[doc = "< [0x0034] USB Periodic Frame List Base Address Register"]
    pub UPFLBAR: u32,
    #[doc = "< [0x0038] USB Current Asynchronous List Address Register"]
    pub UCALAR: u32,
    #[doc = "< [0x003c] USB Asynchronous Schedule Sleep Timer Register"]
    pub UASSTR: u32,
    pub RESERVE2: [u32; 8usize],
    #[doc = "< [0x0060] USB Configure Flag Register"]
    pub UCFGR: u32,
    #[doc = "< [0x0064] ~ [0x0068] USB Port 0 & 1 Status and Control Register"]
    pub UPSCR: [u32; 2usize],
    pub RESERVE3: [u32; 22usize],
    #[doc = "< [0x00c4] USB PHY 0 Control Register"]
    pub USBPCR0: u32,
    #[doc = "< [0x00c8] USB PHY 1 Control Register"]
    pub USBPCR1: u32,
}
#[test]
fn bindgen_test_layout_HSUSBH_T() {
    const UNINIT: ::core::mem::MaybeUninit<HSUSBH_T> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<HSUSBH_T>(),
        204usize,
        concat!("Size of: ", stringify!(HSUSBH_T))
    );
    assert_eq!(
        ::core::mem::align_of::<HSUSBH_T>(),
        4usize,
        concat!("Alignment of ", stringify!(HSUSBH_T))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).EHCVNR) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(HSUSBH_T),
            "::",
            stringify!(EHCVNR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).EHCSPR) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(HSUSBH_T),
            "::",
            stringify!(EHCSPR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).EHCCPR) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(HSUSBH_T),
            "::",
            stringify!(EHCCPR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RESERVE0) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(HSUSBH_T),
            "::",
            stringify!(RESERVE0)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).UCMDR) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(HSUSBH_T),
            "::",
            stringify!(UCMDR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).USTSR) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(HSUSBH_T),
            "::",
            stringify!(USTSR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).UIENR) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(HSUSBH_T),
            "::",
            stringify!(UIENR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).UFINDR) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(HSUSBH_T),
            "::",
            stringify!(UFINDR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RESERVE1) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(HSUSBH_T),
            "::",
            stringify!(RESERVE1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).UPFLBAR) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(HSUSBH_T),
            "::",
            stringify!(UPFLBAR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).UCALAR) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(HSUSBH_T),
            "::",
            stringify!(UCALAR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).UASSTR) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(HSUSBH_T),
            "::",
            stringify!(UASSTR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RESERVE2) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(HSUSBH_T),
            "::",
            stringify!(RESERVE2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).UCFGR) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(HSUSBH_T),
            "::",
            stringify!(UCFGR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).UPSCR) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(HSUSBH_T),
            "::",
            stringify!(UPSCR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RESERVE3) as usize - ptr as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(HSUSBH_T),
            "::",
            stringify!(RESERVE3)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).USBPCR0) as usize - ptr as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(HSUSBH_T),
            "::",
            stringify!(USBPCR0)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).USBPCR1) as usize - ptr as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(HSUSBH_T),
            "::",
            stringify!(USBPCR1)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hub_dev_t {
    _unused: [u8; 0],
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct DEV_REQ_T {
    pub bmRequestType: u8,
    pub bRequest: u8,
    pub wValue: u16,
    pub wIndex: u16,
    pub wLength: u16,
}
#[test]
fn bindgen_test_layout_DEV_REQ_T() {
    const UNINIT: ::core::mem::MaybeUninit<DEV_REQ_T> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<DEV_REQ_T>(),
        8usize,
        concat!("Size of: ", stringify!(DEV_REQ_T))
    );
    assert_eq!(
        ::core::mem::align_of::<DEV_REQ_T>(),
        1usize,
        concat!("Alignment of ", stringify!(DEV_REQ_T))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bmRequestType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DEV_REQ_T),
            "::",
            stringify!(bmRequestType)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bRequest) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(DEV_REQ_T),
            "::",
            stringify!(bRequest)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).wValue) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(DEV_REQ_T),
            "::",
            stringify!(wValue)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).wIndex) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DEV_REQ_T),
            "::",
            stringify!(wIndex)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).wLength) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(DEV_REQ_T),
            "::",
            stringify!(wLength)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct DESC_HDR_T {
    pub bLength: u8,
    pub bDescriptorType: u8,
}
#[test]
fn bindgen_test_layout_DESC_HDR_T() {
    const UNINIT: ::core::mem::MaybeUninit<DESC_HDR_T> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<DESC_HDR_T>(),
        2usize,
        concat!("Size of: ", stringify!(DESC_HDR_T))
    );
    assert_eq!(
        ::core::mem::align_of::<DESC_HDR_T>(),
        1usize,
        concat!("Alignment of ", stringify!(DESC_HDR_T))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bLength) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DESC_HDR_T),
            "::",
            stringify!(bLength)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bDescriptorType) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(DESC_HDR_T),
            "::",
            stringify!(bDescriptorType)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct DESC_DEV_T {
    #[doc = "< Length of device descriptor"]
    pub bLength: u8,
    #[doc = "< Device descriptor type"]
    pub bDescriptorType: u8,
    #[doc = "< USB version number"]
    pub bcdUSB: u16,
    #[doc = "< Device class code"]
    pub bDeviceClass: u8,
    #[doc = "< Device subclass code"]
    pub bDeviceSubClass: u8,
    #[doc = "< Device protocol code"]
    pub bDeviceProtocol: u8,
    #[doc = "< Maximum packet size of control endpoint"]
    pub bMaxPacketSize0: u8,
    #[doc = "< Vendor ID"]
    pub idVendor: u16,
    #[doc = "< Product ID"]
    pub idProduct: u16,
    #[doc = "< Device ID"]
    pub bcdDevice: u16,
    #[doc = "< Manufacture description string ID"]
    pub iManufacturer: u8,
    #[doc = "< Product description string ID"]
    pub iProduct: u8,
    #[doc = "< Serial number description string ID"]
    pub iSerialNumber: u8,
    #[doc = "< Total number of configurations"]
    pub bNumConfigurations: u8,
}
#[test]
fn bindgen_test_layout_DESC_DEV_T() {
    const UNINIT: ::core::mem::MaybeUninit<DESC_DEV_T> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<DESC_DEV_T>(),
        18usize,
        concat!("Size of: ", stringify!(DESC_DEV_T))
    );
    assert_eq!(
        ::core::mem::align_of::<DESC_DEV_T>(),
        1usize,
        concat!("Alignment of ", stringify!(DESC_DEV_T))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bLength) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DESC_DEV_T),
            "::",
            stringify!(bLength)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bDescriptorType) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(DESC_DEV_T),
            "::",
            stringify!(bDescriptorType)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bcdUSB) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(DESC_DEV_T),
            "::",
            stringify!(bcdUSB)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bDeviceClass) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DESC_DEV_T),
            "::",
            stringify!(bDeviceClass)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bDeviceSubClass) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(DESC_DEV_T),
            "::",
            stringify!(bDeviceSubClass)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bDeviceProtocol) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(DESC_DEV_T),
            "::",
            stringify!(bDeviceProtocol)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bMaxPacketSize0) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(DESC_DEV_T),
            "::",
            stringify!(bMaxPacketSize0)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).idVendor) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DESC_DEV_T),
            "::",
            stringify!(idVendor)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).idProduct) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(DESC_DEV_T),
            "::",
            stringify!(idProduct)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bcdDevice) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(DESC_DEV_T),
            "::",
            stringify!(bcdDevice)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).iManufacturer) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(DESC_DEV_T),
            "::",
            stringify!(iManufacturer)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).iProduct) as usize - ptr as usize },
        15usize,
        concat!(
            "Offset of field: ",
            stringify!(DESC_DEV_T),
            "::",
            stringify!(iProduct)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).iSerialNumber) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(DESC_DEV_T),
            "::",
            stringify!(iSerialNumber)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bNumConfigurations) as usize - ptr as usize },
        17usize,
        concat!(
            "Offset of field: ",
            stringify!(DESC_DEV_T),
            "::",
            stringify!(bNumConfigurations)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct usb_config_descriptor {
    #[doc = "< Length of configuration descriptor"]
    pub bLength: u8,
    #[doc = "< Descriptor type"]
    pub bDescriptorType: u8,
    #[doc = "< Total length of this configuration"]
    pub wTotalLength: u16,
    #[doc = "< Total number of interfaces"]
    pub bNumInterfaces: u8,
    #[doc = "< Configuration descriptor number"]
    pub bConfigurationValue: u8,
    #[doc = "< String descriptor ID"]
    pub iConfiguration: u8,
    #[doc = "< Configuration characteristics"]
    pub bmAttributes: u8,
    #[doc = "< Maximum power consumption"]
    pub MaxPower: u8,
}
#[test]
fn bindgen_test_layout_usb_config_descriptor() {
    const UNINIT: ::core::mem::MaybeUninit<usb_config_descriptor> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<usb_config_descriptor>(),
        9usize,
        concat!("Size of: ", stringify!(usb_config_descriptor))
    );
    assert_eq!(
        ::core::mem::align_of::<usb_config_descriptor>(),
        1usize,
        concat!("Alignment of ", stringify!(usb_config_descriptor))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bLength) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_config_descriptor),
            "::",
            stringify!(bLength)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bDescriptorType) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_config_descriptor),
            "::",
            stringify!(bDescriptorType)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).wTotalLength) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_config_descriptor),
            "::",
            stringify!(wTotalLength)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bNumInterfaces) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_config_descriptor),
            "::",
            stringify!(bNumInterfaces)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bConfigurationValue) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_config_descriptor),
            "::",
            stringify!(bConfigurationValue)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).iConfiguration) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_config_descriptor),
            "::",
            stringify!(iConfiguration)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bmAttributes) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_config_descriptor),
            "::",
            stringify!(bmAttributes)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MaxPower) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_config_descriptor),
            "::",
            stringify!(MaxPower)
        )
    );
}
pub type DESC_CONF_T = usb_config_descriptor;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct usb_interface_descriptor {
    #[doc = "< Length of interface descriptor"]
    pub bLength: u8,
    #[doc = "< Descriptor type"]
    pub bDescriptorType: u8,
    #[doc = "< Interface number"]
    pub bInterfaceNumber: u8,
    #[doc = "< Alternate setting number"]
    pub bAlternateSetting: u8,
    #[doc = "< Number of endpoints"]
    pub bNumEndpoints: u8,
    #[doc = "< Interface class code"]
    pub bInterfaceClass: u8,
    #[doc = "< Interface subclass code"]
    pub bInterfaceSubClass: u8,
    #[doc = "< Interface protocol code"]
    pub bInterfaceProtocol: u8,
    #[doc = "< Interface ID"]
    pub iInterface: u8,
}
#[test]
fn bindgen_test_layout_usb_interface_descriptor() {
    const UNINIT: ::core::mem::MaybeUninit<usb_interface_descriptor> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<usb_interface_descriptor>(),
        9usize,
        concat!("Size of: ", stringify!(usb_interface_descriptor))
    );
    assert_eq!(
        ::core::mem::align_of::<usb_interface_descriptor>(),
        1usize,
        concat!("Alignment of ", stringify!(usb_interface_descriptor))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bLength) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_interface_descriptor),
            "::",
            stringify!(bLength)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bDescriptorType) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_interface_descriptor),
            "::",
            stringify!(bDescriptorType)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bInterfaceNumber) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_interface_descriptor),
            "::",
            stringify!(bInterfaceNumber)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bAlternateSetting) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_interface_descriptor),
            "::",
            stringify!(bAlternateSetting)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bNumEndpoints) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_interface_descriptor),
            "::",
            stringify!(bNumEndpoints)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bInterfaceClass) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_interface_descriptor),
            "::",
            stringify!(bInterfaceClass)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bInterfaceSubClass) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_interface_descriptor),
            "::",
            stringify!(bInterfaceSubClass)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bInterfaceProtocol) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_interface_descriptor),
            "::",
            stringify!(bInterfaceProtocol)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).iInterface) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_interface_descriptor),
            "::",
            stringify!(iInterface)
        )
    );
}
pub type DESC_IF_T = usb_interface_descriptor;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct usb_endpoint_descriptor {
    #[doc = "< Length of endpoint descriptor"]
    pub bLength: u8,
    #[doc = "< Descriptor type"]
    pub bDescriptorType: u8,
    #[doc = "< Endpoint address"]
    pub bEndpointAddress: u8,
    #[doc = "< Endpoint attribute"]
    pub bmAttributes: u8,
    #[doc = "< Maximum packet size"]
    pub wMaxPacketSize: u16,
    #[doc = "< Synchronous transfer interval"]
    pub bInterval: u8,
    #[doc = "< Refresh"]
    pub bRefresh: u8,
    #[doc = "< Sync address"]
    pub bSynchAddress: u8,
}
#[test]
fn bindgen_test_layout_usb_endpoint_descriptor() {
    const UNINIT: ::core::mem::MaybeUninit<usb_endpoint_descriptor> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<usb_endpoint_descriptor>(),
        9usize,
        concat!("Size of: ", stringify!(usb_endpoint_descriptor))
    );
    assert_eq!(
        ::core::mem::align_of::<usb_endpoint_descriptor>(),
        1usize,
        concat!("Alignment of ", stringify!(usb_endpoint_descriptor))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bLength) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_endpoint_descriptor),
            "::",
            stringify!(bLength)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bDescriptorType) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_endpoint_descriptor),
            "::",
            stringify!(bDescriptorType)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bEndpointAddress) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_endpoint_descriptor),
            "::",
            stringify!(bEndpointAddress)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bmAttributes) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_endpoint_descriptor),
            "::",
            stringify!(bmAttributes)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).wMaxPacketSize) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_endpoint_descriptor),
            "::",
            stringify!(wMaxPacketSize)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bInterval) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_endpoint_descriptor),
            "::",
            stringify!(bInterval)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bRefresh) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_endpoint_descriptor),
            "::",
            stringify!(bRefresh)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bSynchAddress) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(usb_endpoint_descriptor),
            "::",
            stringify!(bSynchAddress)
        )
    );
}
pub type DESC_EP_T = usb_endpoint_descriptor;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HC_DRV_T {
    pub init: ::core::option::Option<unsafe extern "C" fn() -> libc::c_int>,
    pub shutdown: ::core::option::Option<unsafe extern "C" fn()>,
    pub suspend: ::core::option::Option<unsafe extern "C" fn()>,
    pub resume: ::core::option::Option<unsafe extern "C" fn()>,
    pub ctrl_xfer: ::core::option::Option<unsafe extern "C" fn(utr: *mut utr_t) -> libc::c_int>,
    pub bulk_xfer: ::core::option::Option<unsafe extern "C" fn(utr: *mut utr_t) -> libc::c_int>,
    pub int_xfer: ::core::option::Option<unsafe extern "C" fn(utr: *mut utr_t) -> libc::c_int>,
    pub iso_xfer: ::core::option::Option<unsafe extern "C" fn(utr: *mut utr_t) -> libc::c_int>,
    pub quit_xfer: ::core::option::Option<
        unsafe extern "C" fn(utr: *mut utr_t, ep: *mut ep_info_t) -> libc::c_int,
    >,
    pub rthub_port_reset:
        ::core::option::Option<unsafe extern "C" fn(port: libc::c_int) -> libc::c_int>,
    pub rthub_polling: ::core::option::Option<unsafe extern "C" fn() -> libc::c_int>,
}
#[test]
fn bindgen_test_layout_HC_DRV_T() {
    const UNINIT: ::core::mem::MaybeUninit<HC_DRV_T> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<HC_DRV_T>(),
        44usize,
        concat!("Size of: ", stringify!(HC_DRV_T))
    );
    assert_eq!(
        ::core::mem::align_of::<HC_DRV_T>(),
        4usize,
        concat!("Alignment of ", stringify!(HC_DRV_T))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).init) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(HC_DRV_T),
            "::",
            stringify!(init)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).shutdown) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(HC_DRV_T),
            "::",
            stringify!(shutdown)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).suspend) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(HC_DRV_T),
            "::",
            stringify!(suspend)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).resume) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(HC_DRV_T),
            "::",
            stringify!(resume)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ctrl_xfer) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(HC_DRV_T),
            "::",
            stringify!(ctrl_xfer)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bulk_xfer) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(HC_DRV_T),
            "::",
            stringify!(bulk_xfer)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).int_xfer) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(HC_DRV_T),
            "::",
            stringify!(int_xfer)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).iso_xfer) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(HC_DRV_T),
            "::",
            stringify!(iso_xfer)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).quit_xfer) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(HC_DRV_T),
            "::",
            stringify!(quit_xfer)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rthub_port_reset) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(HC_DRV_T),
            "::",
            stringify!(rthub_port_reset)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rthub_polling) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(HC_DRV_T),
            "::",
            stringify!(rthub_polling)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UDEV_DRV_T {
    pub probe: ::core::option::Option<unsafe extern "C" fn(iface: *mut iface_t) -> libc::c_int>,
    pub disconnect: ::core::option::Option<unsafe extern "C" fn(iface: *mut iface_t)>,
    pub suspend: ::core::option::Option<unsafe extern "C" fn(iface: *mut iface_t)>,
    pub resume: ::core::option::Option<unsafe extern "C" fn(iface: *mut iface_t)>,
}
#[test]
fn bindgen_test_layout_UDEV_DRV_T() {
    const UNINIT: ::core::mem::MaybeUninit<UDEV_DRV_T> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<UDEV_DRV_T>(),
        16usize,
        concat!("Size of: ", stringify!(UDEV_DRV_T))
    );
    assert_eq!(
        ::core::mem::align_of::<UDEV_DRV_T>(),
        4usize,
        concat!("Alignment of ", stringify!(UDEV_DRV_T))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).probe) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UDEV_DRV_T),
            "::",
            stringify!(probe)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).disconnect) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(UDEV_DRV_T),
            "::",
            stringify!(disconnect)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).suspend) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(UDEV_DRV_T),
            "::",
            stringify!(suspend)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).resume) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(UDEV_DRV_T),
            "::",
            stringify!(resume)
        )
    );
}
pub const SPEED_E_SPEED_LOW: SPEED_E = 0;
pub const SPEED_E_SPEED_FULL: SPEED_E = 1;
pub const SPEED_E_SPEED_HIGH: SPEED_E = 2;
pub type SPEED_E = libc::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ep_info_t {
    pub bEndpointAddress: u8,
    pub bmAttributes: u8,
    pub bInterval: u8,
    pub bToggle: u8,
    pub wMaxPacketSize: u16,
    #[doc = "< point to the HC assocaied endpoint    \\hideinitializer"]
    pub hw_pipe: *mut libc::c_void,
}
#[test]
fn bindgen_test_layout_ep_info_t() {
    const UNINIT: ::core::mem::MaybeUninit<ep_info_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<ep_info_t>(),
        12usize,
        concat!("Size of: ", stringify!(ep_info_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ep_info_t>(),
        4usize,
        concat!("Alignment of ", stringify!(ep_info_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bEndpointAddress) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ep_info_t),
            "::",
            stringify!(bEndpointAddress)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bmAttributes) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(ep_info_t),
            "::",
            stringify!(bmAttributes)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bInterval) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(ep_info_t),
            "::",
            stringify!(bInterval)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bToggle) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(ep_info_t),
            "::",
            stringify!(bToggle)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).wMaxPacketSize) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ep_info_t),
            "::",
            stringify!(wMaxPacketSize)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hw_pipe) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ep_info_t),
            "::",
            stringify!(hw_pipe)
        )
    );
}
pub type EP_INFO_T = ep_info_t;
#[doc = " @addtogroup N9H30_USBH_EXPORTED_STRUCT Data structure\n@{"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct udev_t {
    #[doc = "< Device descriptor.                    \\hideinitializer"]
    pub descriptor: DESC_DEV_T,
    #[doc = "< parent hub device                     \\hideinitializer"]
    pub parent: *mut hub_dev_t,
    #[doc = "< The hub port this device connected on \\hideinitializer"]
    pub port_num: u8,
    #[doc = "< device number                         \\hideinitializer"]
    pub dev_num: u8,
    #[doc = "< Currentll selected configuration      \\hideinitializer"]
    pub cur_conf: i8,
    #[doc = "< device speed (low/full/high)          \\hideinitializer"]
    pub speed: SPEED_E,
    #[doc = "< Configuration descriptor buffer.      \\hideinitializer"]
    pub cfd_buff: *mut u8,
    #[doc = "< Endpoint 0                            \\hideinitializer"]
    pub ep0: EP_INFO_T,
    #[doc = "< host controller driver                \\hideinitializer"]
    pub hc_driver: *mut HC_DRV_T,
    #[doc = "< Working interface list                \\hideinitializer"]
    pub iface_list: *mut iface_t,
    #[doc = "< link for global usb device list       \\hideinitializer"]
    pub next: *mut udev_t,
}
#[test]
fn bindgen_test_layout_udev_t() {
    const UNINIT: ::core::mem::MaybeUninit<udev_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<udev_t>(),
        60usize,
        concat!("Size of: ", stringify!(udev_t))
    );
    assert_eq!(
        ::core::mem::align_of::<udev_t>(),
        4usize,
        concat!("Alignment of ", stringify!(udev_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).descriptor) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(udev_t),
            "::",
            stringify!(descriptor)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).parent) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(udev_t),
            "::",
            stringify!(parent)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).port_num) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(udev_t),
            "::",
            stringify!(port_num)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dev_num) as usize - ptr as usize },
        25usize,
        concat!(
            "Offset of field: ",
            stringify!(udev_t),
            "::",
            stringify!(dev_num)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cur_conf) as usize - ptr as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(udev_t),
            "::",
            stringify!(cur_conf)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).speed) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(udev_t),
            "::",
            stringify!(speed)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cfd_buff) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(udev_t),
            "::",
            stringify!(cfd_buff)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ep0) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(udev_t),
            "::",
            stringify!(ep0)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hc_driver) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(udev_t),
            "::",
            stringify!(hc_driver)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).iface_list) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(udev_t),
            "::",
            stringify!(iface_list)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(udev_t),
            "::",
            stringify!(next)
        )
    );
}
#[doc = " @addtogroup N9H30_USBH_EXPORTED_STRUCT Data structure\n@{"]
pub type UDEV_T = udev_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct alt_iface_t {
    #[doc = "< point to the location of this alternative interface descriptor in UDEV_T->cfd_buff"]
    pub ifd: *mut DESC_IF_T,
    #[doc = "< endpoints of this alternative interface"]
    pub ep: [EP_INFO_T; 8usize],
}
#[test]
fn bindgen_test_layout_alt_iface_t() {
    const UNINIT: ::core::mem::MaybeUninit<alt_iface_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<alt_iface_t>(),
        100usize,
        concat!("Size of: ", stringify!(alt_iface_t))
    );
    assert_eq!(
        ::core::mem::align_of::<alt_iface_t>(),
        4usize,
        concat!("Alignment of ", stringify!(alt_iface_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ifd) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(alt_iface_t),
            "::",
            stringify!(ifd)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ep) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(alt_iface_t),
            "::",
            stringify!(ep)
        )
    );
}
pub type ALT_IFACE_T = alt_iface_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iface_t {
    #[doc = "< USB device                            \\hideinitializer"]
    pub udev: *mut UDEV_T,
    #[doc = "< Interface number                      \\hideinitializer"]
    pub if_num: u8,
    #[doc = "< Number of alternative interface       \\hideinitializer"]
    pub num_alt: u8,
    #[doc = "< Point to the active alternative interface"]
    pub aif: *mut ALT_IFACE_T,
    #[doc = "< List of alternative interface      \\hideinitializer"]
    pub alt: [ALT_IFACE_T; 12usize],
    #[doc = "< Interface associated driver           \\hideinitializer"]
    pub driver: *mut UDEV_DRV_T,
    #[doc = "< Reference to device context           \\hideinitializer"]
    pub context: *mut libc::c_void,
    #[doc = "< Point to next interface of the same device. Started from UDEV_T->iface_list   \\hideinitializer"]
    pub next: *mut iface_t,
}
#[test]
fn bindgen_test_layout_iface_t() {
    const UNINIT: ::core::mem::MaybeUninit<iface_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<iface_t>(),
        1224usize,
        concat!("Size of: ", stringify!(iface_t))
    );
    assert_eq!(
        ::core::mem::align_of::<iface_t>(),
        4usize,
        concat!("Alignment of ", stringify!(iface_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).udev) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iface_t),
            "::",
            stringify!(udev)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).if_num) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(iface_t),
            "::",
            stringify!(if_num)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).num_alt) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(iface_t),
            "::",
            stringify!(num_alt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).aif) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(iface_t),
            "::",
            stringify!(aif)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).alt) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(iface_t),
            "::",
            stringify!(alt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).driver) as usize - ptr as usize },
        1212usize,
        concat!(
            "Offset of field: ",
            stringify!(iface_t),
            "::",
            stringify!(driver)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).context) as usize - ptr as usize },
        1216usize,
        concat!(
            "Offset of field: ",
            stringify!(iface_t),
            "::",
            stringify!(context)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        1220usize,
        concat!(
            "Offset of field: ",
            stringify!(iface_t),
            "::",
            stringify!(next)
        )
    );
}
pub type IFACE_T = iface_t;
pub type FUNC_UTR_T = ::core::option::Option<unsafe extern "C" fn(arg1: *mut utr_t)>;
#[doc = " @cond HIDDEN_SYMBOLS"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct utr_t {
    #[doc = "< point to associated USB device        \\hideinitializer"]
    pub udev: *mut UDEV_T,
    #[doc = "< buffer for setup packet               \\hideinitializer"]
    pub setup: DEV_REQ_T,
    #[doc = "< associated endpoint                   \\hideinitializer"]
    pub ep: *mut EP_INFO_T,
    #[doc = "< transfer buffer                       \\hideinitializer"]
    pub buff: *mut u8,
    #[doc = "< tansfer done?                         \\hideinitializer"]
    pub bIsTransferDone: u8,
    #[doc = "< length of data to be transferred      \\hideinitializer"]
    pub data_len: u32,
    #[doc = "< length of transferred data            \\hideinitializer"]
    pub xfer_len: u32,
    #[doc = "< New schedule isochronous transfer     \\hideinitializer"]
    pub bIsoNewSched: u8,
    #[doc = "< Isochronous start frame number        \\hideinitializer"]
    pub iso_sf: u16,
    #[doc = "< transfer length of isochronous frames \\hideinitializer"]
    pub iso_xlen: [u16; 8usize],
    #[doc = "< transfer buffer address of isochronous frames \\hideinitializer"]
    pub iso_buff: [*mut u8; 8usize],
    #[doc = "< transfer status of isochronous frames \\hideinitializer"]
    pub iso_status: [libc::c_int; 8usize],
    #[doc = "< number of transfer descriptors        \\hideinitializer"]
    pub td_cnt: libc::c_int,
    #[doc = "< return status                         \\hideinitializer"]
    pub status: libc::c_int,
    #[doc = "< interrupt/isochronous interval        \\hideinitializer"]
    pub interval: libc::c_int,
    #[doc = "< point to deivce proprietary data area \\hideinitializer"]
    pub context: *mut libc::c_void,
    #[doc = "< tansfer done call-back function       \\hideinitializer"]
    pub func: FUNC_UTR_T,
    pub next: *mut utr_t,
}
#[test]
fn bindgen_test_layout_utr_t() {
    const UNINIT: ::core::mem::MaybeUninit<utr_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<utr_t>(),
        140usize,
        concat!("Size of: ", stringify!(utr_t))
    );
    assert_eq!(
        ::core::mem::align_of::<utr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(utr_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).udev) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(utr_t),
            "::",
            stringify!(udev)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).setup) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(utr_t),
            "::",
            stringify!(setup)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ep) as usize - ptr as usize },
        12usize,
        concat!("Offset of field: ", stringify!(utr_t), "::", stringify!(ep))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).buff) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(utr_t),
            "::",
            stringify!(buff)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bIsTransferDone) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(utr_t),
            "::",
            stringify!(bIsTransferDone)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data_len) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(utr_t),
            "::",
            stringify!(data_len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xfer_len) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(utr_t),
            "::",
            stringify!(xfer_len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bIsoNewSched) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(utr_t),
            "::",
            stringify!(bIsoNewSched)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).iso_sf) as usize - ptr as usize },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(utr_t),
            "::",
            stringify!(iso_sf)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).iso_xlen) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(utr_t),
            "::",
            stringify!(iso_xlen)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).iso_buff) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(utr_t),
            "::",
            stringify!(iso_buff)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).iso_status) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(utr_t),
            "::",
            stringify!(iso_status)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).td_cnt) as usize - ptr as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(utr_t),
            "::",
            stringify!(td_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(utr_t),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).interval) as usize - ptr as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(utr_t),
            "::",
            stringify!(interval)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).context) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(utr_t),
            "::",
            stringify!(context)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).func) as usize - ptr as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(utr_t),
            "::",
            stringify!(func)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(utr_t),
            "::",
            stringify!(next)
        )
    );
}
#[doc = " @cond HIDDEN_SYMBOLS"]
pub type UTR_T = utr_t;
extern "C" {
    pub static mut _ohci: *mut USBH_T;
}
extern "C" {
    pub static mut _ehci: *mut HSUSBH_T;
}
extern "C" {
    pub static mut ohci_driver: HC_DRV_T;
}
extern "C" {
    pub static mut ehci_driver: HC_DRV_T;
}
extern "C" {
    pub static mut g_udev_list: *mut UDEV_T;
}
extern "C" {
    pub static mut _IsInUsbInterrupt: libc::c_int;
}
extern "C" {
    pub fn delay_us(usec: libc::c_int);
}
extern "C" {
    pub fn sysprintf(format: *const libc::c_char, ...);
}
extern "C" {
    pub fn dma_to_virt(physical_address: *mut libc::c_void) -> *mut libc::c_void;
}
extern "C" {
    pub fn virt_to_dma(virtual_address: *mut libc::c_void) -> *mut libc::c_void;
}
extern "C" {
    #[doc = " @cond HIDDEN_SYMBOLS"]
    pub fn dump_ohci_regs();
}
extern "C" {
