/* automatically generated by rust-bindgen 0.69.5 */

pub const XBOX: u32 = 1;
pub const __XBOX__: u32 = 1;
pub const HAVE_WINAPIFAMILY_H: u32 = 1;
pub const WINAPI_FAMILY_PC_APP: u32 = 2;
pub const WINAPI_FAMILY_PHONE_APP: u32 = 3;
pub const WINAPI_FAMILY_SYSTEM: u32 = 4;
pub const WINAPI_FAMILY_SERVER: u32 = 5;
pub const WINAPI_FAMILY_DESKTOP_APP: u32 = 100;
pub const WINAPI_FAMILY: u32 = 100;
pub const __WINDOWS__: u32 = 1;
pub const __WIN32__: u32 = 1;
pub const HAVE_LIBC: u32 = 1;
pub const STDC_HEADERS: u32 = 1;
pub const HAVE_STDIO_H: u32 = 1;
pub const HAVE_STDLIB_H: u32 = 1;
pub const HAVE_STDDEF_H: u32 = 1;
pub const HAVE_STDARG_H: u32 = 1;
pub const HAVE_STRING_H: u32 = 1;
pub const HAVE_INTTYPES_H: u32 = 1;
pub const HAVE_STDINT_H: u32 = 1;
pub const HAVE_CTYPE_H: u32 = 1;
pub const HAVE_MATH_H: u32 = 1;
pub const HAVE_MALLOC: u32 = 1;
pub const HAVE_CALLOC: u32 = 1;
pub const HAVE_REALLOC: u32 = 1;
pub const HAVE_FREE: u32 = 1;
pub const HAVE_GETENV: u32 = 1;
pub const HAVE_QSORT: u32 = 1;
pub const HAVE_ABS: u32 = 1;
pub const HAVE_MEMSET: u32 = 1;
pub const HAVE_MEMCPY: u32 = 1;
pub const HAVE_MEMMOVE: u32 = 1;
pub const HAVE_MEMCMP: u32 = 1;
pub const HAVE_STRLEN: u32 = 1;
pub const HAVE_STRCHR: u32 = 1;
pub const HAVE_STRRCHR: u32 = 1;
pub const HAVE_STRSTR: u32 = 1;
pub const HAVE_STRTOL: u32 = 1;
pub const HAVE_STRTOUL: u32 = 1;
pub const HAVE_STRTOLL: u32 = 1;
pub const HAVE_STRTOULL: u32 = 1;

pub const SDL_HINT_MAC_BACKGROUND_APP: &[u8; 23] = b"SDL_MAC_BACKGROUND_APP\0";
pub const SDL_HINT_ANDROID_APK_EXPANSION_MAIN_FILE_VERSION: &[u8; 44] =
    b"SDL_ANDROID_APK_EXPANSION_MAIN_FILE_VERSION\0";
pub const SDL_HINT_ANDROID_APK_EXPANSION_PATCH_FILE_VERSION: &[u8; 45] =
    b"SDL_ANDROID_APK_EXPANSION_PATCH_FILE_VERSION\0";
pub const SDL_HINT_IME_INTERNAL_EDITING: &[u8; 25] = b"SDL_IME_INTERNAL_EDITING\0";
pub const SDL_HINT_ANDROID_TRAP_BACK_BUTTON: &[u8; 29] = b"SDL_ANDROID_TRAP_BACK_BUTTON\0";
pub const SDL_HINT_ANDROID_BLOCK_ON_PAUSE: &[u8; 27] = b"SDL_ANDROID_BLOCK_ON_PAUSE\0";
pub const SDL_HINT_RETURN_KEY_HIDES_IME: &[u8; 25] = b"SDL_RETURN_KEY_HIDES_IME\0";
pub const SDL_HINT_EMSCRIPTEN_KEYBOARD_ELEMENT: &[u8; 32] = b"SDL_EMSCRIPTEN_KEYBOARD_ELEMENT\0";
pub const SDL_HINT_NO_SIGNAL_HANDLERS: &[u8; 23] = b"SDL_NO_SIGNAL_HANDLERS\0";
pub const SDL_HINT_WINDOWS_NO_CLOSE_ON_ALT_F4: &[u8; 31] = b"SDL_WINDOWS_NO_CLOSE_ON_ALT_F4\0";
pub const SDL_HINT_BMP_SAVE_LEGACY_FORMAT: &[u8; 27] = b"SDL_BMP_SAVE_LEGACY_FORMAT\0";
pub const SDL_HINT_WINDOWS_DISABLE_THREAD_NAMING: &[u8; 34] =
    b"SDL_WINDOWS_DISABLE_THREAD_NAMING\0";
pub const SDL_HINT_RPI_VIDEO_LAYER: &[u8; 20] = b"SDL_RPI_VIDEO_LAYER\0";
pub const SDL_HINT_VIDEO_DOUBLE_BUFFER: &[u8; 24] = b"SDL_VIDEO_DOUBLE_BUFFER\0";
pub const SDL_HINT_OPENGL_ES_DRIVER: &[u8; 21] = b"SDL_OPENGL_ES_DRIVER\0";
pub const SDL_HINT_AUDIO_RESAMPLING_MODE: &[u8; 26] = b"SDL_AUDIO_RESAMPLING_MODE\0";
pub const SDL_HINT_AUDIO_CATEGORY: &[u8; 19] = b"SDL_AUDIO_CATEGORY\0";
pub const SDL_HINT_RENDER_BATCHING: &[u8; 20] = b"SDL_RENDER_BATCHING\0";
pub const SDL_HINT_EVENT_LOGGING: &[u8; 18] = b"SDL_EVENT_LOGGING\0";
pub const SDL_MAX_LOG_MESSAGE: u32 = 4096;
pub const SDL_STANDARD_GRAVITY: f64 = 9.80665;
pub const SDL_NONSHAPEABLE_WINDOW: i32 = -1;
pub const SDL_INVALID_SHAPE_ARGUMENT: i32 = -2;
pub const SDL_WINDOW_LACKS_SHAPE: i32 = -3;
pub const SDL_MAJOR_VERSION: u32 = 2;
pub const SDL_MINOR_VERSION: u32 = 0;
pub const SDL_PATCHLEVEL: u32 = 9;
pub const SDL_INIT_TIMER: u32 = 1;
pub const SDL_INIT_AUDIO: u32 = 16;
pub const SDL_INIT_VIDEO: u32 = 32;
pub const SDL_INIT_JOYSTICK: u32 = 512;
pub const SDL_INIT_HAPTIC: u32 = 4096;
pub const SDL_INIT_GAMECONTROLLER: u32 = 8192;
pub const SDL_INIT_EVENTS: u32 = 16384;
pub const SDL_INIT_SENSOR: u32 = 32768;
pub const SDL_INIT_NOPARACHUTE: u32 = 1048576;
pub const SDL_INIT_EVERYTHING: u32 = 62001;
extern "C" {
    #[doc = "  \\brief Gets the name of the platform."]
    pub fn SDL_GetPlatform() -> *const libc::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PDCLIB_div_t {
    pub quot: libc::c_int,
    pub rem: libc::c_int,
}
#[test]
fn bindgen_test_layout__PDCLIB_div_t() {
    const UNINIT: ::core::mem::MaybeUninit<_PDCLIB_div_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_PDCLIB_div_t>(),
        8usize,
        concat!("Size of: ", stringify!(_PDCLIB_div_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_PDCLIB_div_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_PDCLIB_div_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_div_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_div_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PDCLIB_ldiv_t {
    pub quot: libc::c_long,
    pub rem: libc::c_long,
}
#[test]
fn bindgen_test_layout__PDCLIB_ldiv_t() {
    const UNINIT: ::core::mem::MaybeUninit<_PDCLIB_ldiv_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_PDCLIB_ldiv_t>(),
        8usize,
        concat!("Size of: ", stringify!(_PDCLIB_ldiv_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_PDCLIB_ldiv_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_PDCLIB_ldiv_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_ldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_ldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PDCLIB_lldiv_t {
    pub quot: libc::c_longlong,
    pub rem: libc::c_longlong,
}
#[test]
fn bindgen_test_layout__PDCLIB_lldiv_t() {
    const UNINIT: ::core::mem::MaybeUninit<_PDCLIB_lldiv_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_PDCLIB_lldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(_PDCLIB_lldiv_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_PDCLIB_lldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_PDCLIB_lldiv_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PDCLIB_imaxdiv_t {
    pub quot: libc::c_longlong,
    pub rem: libc::c_longlong,
}
#[test]
fn bindgen_test_layout__PDCLIB_imaxdiv_t() {
    const UNINIT: ::core::mem::MaybeUninit<_PDCLIB_imaxdiv_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_PDCLIB_imaxdiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(_PDCLIB_imaxdiv_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_PDCLIB_imaxdiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_PDCLIB_imaxdiv_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_imaxdiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_imaxdiv_t),
            "::",
            stringify!(rem)
        )
    );
}
pub type _PDCLIB_va_list = __builtin_va_list;
pub type _PDCLIB_fd_t = *mut libc::c_void;
pub type _PDCLIB_thrd_t = *mut libc::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __PDCLIB_cnd_t {
    pub eventHandles: [*mut libc::c_void; 2usize],
    pub waitCount: u32,
}
#[test]
fn bindgen_test_layout___PDCLIB_cnd_t() {
    const UNINIT: ::core::mem::MaybeUninit<__PDCLIB_cnd_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<__PDCLIB_cnd_t>(),
        12usize,
        concat!("Size of: ", stringify!(__PDCLIB_cnd_t))
    );
    assert_eq!(
        ::core::mem::align_of::<__PDCLIB_cnd_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__PDCLIB_cnd_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).eventHandles) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__PDCLIB_cnd_t),
            "::",
            stringify!(eventHandles)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).waitCount) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__PDCLIB_cnd_t),
            "::",
            stringify!(waitCount)
        )
    );
}
pub type _PDCLIB_cnd_t = __PDCLIB_cnd_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __PDCLIB_mtx_t {
    pub handle: *mut libc::c_void,
}
#[test]
fn bindgen_test_layout___PDCLIB_mtx_t() {
    const UNINIT: ::core::mem::MaybeUninit<__PDCLIB_mtx_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<__PDCLIB_mtx_t>(),
        4usize,
        concat!("Size of: ", stringify!(__PDCLIB_mtx_t))
    );
    assert_eq!(
        ::core::mem::align_of::<__PDCLIB_mtx_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__PDCLIB_mtx_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).handle) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__PDCLIB_mtx_t),
            "::",
            stringify!(handle)
        )
    );
}
pub type _PDCLIB_mtx_t = __PDCLIB_mtx_t;
pub type _PDCLIB_tss_t = libc::c_uint;
pub type _PDCLIB_once_flag = libc::c_int;
pub type _PDCLIB_int8_t = libc::c_schar;
pub type _PDCLIB_uint8_t = libc::c_uchar;
pub type _PDCLIB_int16_t = libc::c_short;
pub type _PDCLIB_uint16_t = libc::c_ushort;
pub type _PDCLIB_int32_t = libc::c_int;
pub type _PDCLIB_uint32_t = libc::c_uint;
pub type _PDCLIB_int64_t = libc::c_longlong;
pub type _PDCLIB_uint64_t = libc::c_ulonglong;
pub type _PDCLIB_int_fast8_t = libc::c_int;
pub type _PDCLIB_uint_fast8_t = libc::c_uint;
pub type _PDCLIB_int_fast16_t = libc::c_int;
pub type _PDCLIB_uint_fast16_t = libc::c_uint;
pub type _PDCLIB_int_fast32_t = libc::c_int;
pub type _PDCLIB_uint_fast32_t = libc::c_uint;
pub type _PDCLIB_int_fast64_t = libc::c_long;
pub type _PDCLIB_uint_fast64_t = libc::c_ulong;
pub type _PDCLIB_ptrdiff_t = libc::c_int;
pub type _PDCLIB_size_t = libc::c_uint;
pub type _PDCLIB_wchar_t = libc::c_ushort;
pub type _PDCLIB_wint_t = libc::c_ushort;
pub type _PDCLIB_intptr_t = libc::c_long;
pub type _PDCLIB_uintptr_t = libc::c_ulong;
pub type _PDCLIB_intmax_t = libc::c_longlong;
pub type _PDCLIB_uintmax_t = libc::c_ulonglong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PDCLIB_fpos_t {
    pub offset: _PDCLIB_uint64_t,
    pub status: libc::c_int,
}
#[test]
fn bindgen_test_layout__PDCLIB_fpos_t() {
    const UNINIT: ::core::mem::MaybeUninit<_PDCLIB_fpos_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_PDCLIB_fpos_t>(),
        16usize,
        concat!("Size of: ", stringify!(_PDCLIB_fpos_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_PDCLIB_fpos_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_PDCLIB_fpos_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).offset) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_fpos_t),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_fpos_t),
            "::",
            stringify!(status)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PDCLIB_file_t {
    pub handle: _PDCLIB_fd_t,
    pub buffer: *mut libc::c_char,
    pub bufsize: _PDCLIB_size_t,
    pub bufidx: _PDCLIB_size_t,
    pub bufend: _PDCLIB_size_t,
    pub pos: _PDCLIB_fpos_t,
    pub ungetidx: _PDCLIB_size_t,
    pub ungetbuf: *mut libc::c_uchar,
    pub status: libc::c_uint,
    pub filename: *mut libc::c_char,
    pub next: *mut _PDCLIB_file_t,
}
#[test]
fn bindgen_test_layout__PDCLIB_file_t() {
    const UNINIT: ::core::mem::MaybeUninit<_PDCLIB_file_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_PDCLIB_file_t>(),
        64usize,
        concat!("Size of: ", stringify!(_PDCLIB_file_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_PDCLIB_file_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_PDCLIB_file_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).handle) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_file_t),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).buffer) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_file_t),
            "::",
            stringify!(buffer)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bufsize) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_file_t),
            "::",
            stringify!(bufsize)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bufidx) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_file_t),
            "::",
            stringify!(bufidx)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bufend) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_file_t),
            "::",
            stringify!(bufend)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pos) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_file_t),
            "::",
            stringify!(pos)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ungetidx) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_file_t),
            "::",
            stringify!(ungetidx)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ungetbuf) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_file_t),
            "::",
            stringify!(ungetbuf)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_file_t),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).filename) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_file_t),
            "::",
            stringify!(filename)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_file_t),
            "::",
            stringify!(next)
        )
    );
}
pub type _PDCLIB_time_t = libc::c_long;
pub type _PDCLIB_clock_t = libc::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PDCLIB_exitfunc_t {
    pub next: *mut _PDCLIB_exitfunc_t,
    pub func: ::core::option::Option<unsafe extern "C" fn()>,
}
#[test]
fn bindgen_test_layout__PDCLIB_exitfunc_t() {
    const UNINIT: ::core::mem::MaybeUninit<_PDCLIB_exitfunc_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_PDCLIB_exitfunc_t>(),
        8usize,
        concat!("Size of: ", stringify!(_PDCLIB_exitfunc_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_PDCLIB_exitfunc_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_PDCLIB_exitfunc_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_exitfunc_t),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).func) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_exitfunc_t),
            "::",
            stringify!(func)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PDCLIB_status_t {
    pub base: libc::c_int,
    pub flags: _PDCLIB_int_fast32_t,
    pub n: _PDCLIB_size_t,
    pub i: _PDCLIB_size_t,
    pub current: _PDCLIB_size_t,
    pub s: *mut libc::c_char,
    pub width: _PDCLIB_size_t,
    pub prec: libc::c_int,
    pub stream: *mut _PDCLIB_file_t,
    pub arg: _PDCLIB_va_list,
}
#[test]
fn bindgen_test_layout__PDCLIB_status_t() {
    const UNINIT: ::core::mem::MaybeUninit<_PDCLIB_status_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_PDCLIB_status_t>(),
        40usize,
        concat!("Size of: ", stringify!(_PDCLIB_status_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_PDCLIB_status_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_PDCLIB_status_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).base) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_status_t),
            "::",
            stringify!(base)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_status_t),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).n) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_status_t),
            "::",
            stringify!(n)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).i) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_status_t),
            "::",
            stringify!(i)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).current) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_status_t),
            "::",
            stringify!(current)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).s) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_status_t),
            "::",
            stringify!(s)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).width) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_status_t),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).prec) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_status_t),
            "::",
            stringify!(prec)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).stream) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_status_t),
            "::",
            stringify!(stream)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).arg) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_status_t),
            "::",
            stringify!(arg)
        )
    );
}
extern "C" {
    pub fn _PDCLIB_atomax(s: *const libc::c_char) -> _PDCLIB_intmax_t;
}
extern "C" {
    pub fn _PDCLIB_strtox_prelim(
        p: *const libc::c_char,
        sign: *mut libc::c_char,
        base: *mut libc::c_int,
    ) -> *const libc::c_char;
}
extern "C" {
    pub fn _PDCLIB_strtox_main(
        p: *mut *const libc::c_char,
        base: libc::c_uint,
        error: _PDCLIB_uintmax_t,
        limval: _PDCLIB_uintmax_t,
        limdigit: libc::c_int,
        sign: *mut libc::c_char,
    ) -> _PDCLIB_uintmax_t;
}
extern "C" {
    pub static _PDCLIB_digits: [libc::c_char; 0usize];
}
extern "C" {
    pub static _PDCLIB_Xdigits: [libc::c_char; 0usize];
}
extern "C" {
    pub fn _PDCLIB_print(
        spec: *const libc::c_char,
        status: *mut _PDCLIB_status_t,
    ) -> *const libc::c_char;
}
extern "C" {
    pub fn _PDCLIB_scan(
        spec: *const libc::c_char,
        status: *mut _PDCLIB_status_t,
    ) -> *const libc::c_char;
}
extern "C" {
    pub fn _PDCLIB_filemode(mode: *const libc::c_char) -> libc::c_uint;
}
extern "C" {
    pub fn _PDCLIB_prepread(stream: *mut _PDCLIB_file_t) -> libc::c_int;
}
extern "C" {
    pub fn _PDCLIB_prepwrite(stream: *mut _PDCLIB_file_t) -> libc::c_int;
}
extern "C" {
    pub fn _PDCLIB_closeall();
}
extern "C" {
    pub fn _PDCLIB_is_leap(year_offset: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn _PDCLIB_load_lines(
        stream: *mut _PDCLIB_file_t,
        lines: _PDCLIB_size_t,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn _PDCLIB_getstream(stream: *mut _PDCLIB_file_t) -> libc::c_int;
}
extern "C" {
    pub fn _PDCLIB_setstream(stream: *mut _PDCLIB_file_t);
}
extern "C" {
    pub fn _PDCLIB_strtok(
        s1: *mut libc::c_char,
        s1max: *mut _PDCLIB_size_t,
        s2: *const libc::c_char,
        ptr: *mut *mut libc::c_char,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn _PDCLIB_errno_func() -> *mut libc::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PDCLIB_lc_lconv_numeric_t {
    pub decimal_point: *mut libc::c_char,
    pub thousands_sep: *mut libc::c_char,
    pub grouping: *mut libc::c_char,
}
#[test]
fn bindgen_test_layout__PDCLIB_lc_lconv_numeric_t() {
    const UNINIT: ::core::mem::MaybeUninit<_PDCLIB_lc_lconv_numeric_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_PDCLIB_lc_lconv_numeric_t>(),
        12usize,
        concat!("Size of: ", stringify!(_PDCLIB_lc_lconv_numeric_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_PDCLIB_lc_lconv_numeric_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_PDCLIB_lc_lconv_numeric_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).decimal_point) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_lconv_numeric_t),
            "::",
            stringify!(decimal_point)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).thousands_sep) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_lconv_numeric_t),
            "::",
            stringify!(thousands_sep)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).grouping) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_lconv_numeric_t),
            "::",
            stringify!(grouping)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PDCLIB_lc_lconv_monetary_t {
    pub mon_decimal_point: *mut libc::c_char,
    pub mon_thousands_sep: *mut libc::c_char,
    pub mon_grouping: *mut libc::c_char,
    pub positive_sign: *mut libc::c_char,
    pub negative_sign: *mut libc::c_char,
    pub currency_symbol: *mut libc::c_char,
    pub int_curr_symbol: *mut libc::c_char,
    pub frac_digits: libc::c_char,
    pub p_cs_precedes: libc::c_char,
    pub n_cs_precedes: libc::c_char,
    pub p_sep_by_space: libc::c_char,
    pub n_sep_by_space: libc::c_char,
    pub p_sign_posn: libc::c_char,
    pub n_sign_posn: libc::c_char,
    pub int_frac_digits: libc::c_char,
    pub int_p_cs_precedes: libc::c_char,
    pub int_n_cs_precedes: libc::c_char,
    pub int_p_sep_by_space: libc::c_char,
    pub int_n_sep_by_space: libc::c_char,
    pub int_p_sign_posn: libc::c_char,
    pub int_n_sign_posn: libc::c_char,
}
#[test]
fn bindgen_test_layout__PDCLIB_lc_lconv_monetary_t() {
    const UNINIT: ::core::mem::MaybeUninit<_PDCLIB_lc_lconv_monetary_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_PDCLIB_lc_lconv_monetary_t>(),
        44usize,
        concat!("Size of: ", stringify!(_PDCLIB_lc_lconv_monetary_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_PDCLIB_lc_lconv_monetary_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_PDCLIB_lc_lconv_monetary_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mon_decimal_point) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_lconv_monetary_t),
            "::",
            stringify!(mon_decimal_point)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mon_thousands_sep) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_lconv_monetary_t),
            "::",
            stringify!(mon_thousands_sep)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mon_grouping) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_lconv_monetary_t),
            "::",
            stringify!(mon_grouping)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).positive_sign) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_lconv_monetary_t),
            "::",
            stringify!(positive_sign)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).negative_sign) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_lconv_monetary_t),
            "::",
            stringify!(negative_sign)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).currency_symbol) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_lconv_monetary_t),
            "::",
            stringify!(currency_symbol)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).int_curr_symbol) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_lconv_monetary_t),
            "::",
            stringify!(int_curr_symbol)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).frac_digits) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_lconv_monetary_t),
            "::",
            stringify!(frac_digits)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).p_cs_precedes) as usize - ptr as usize },
        29usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_lconv_monetary_t),
            "::",
            stringify!(p_cs_precedes)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).n_cs_precedes) as usize - ptr as usize },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_lconv_monetary_t),
            "::",
            stringify!(n_cs_precedes)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).p_sep_by_space) as usize - ptr as usize },
        31usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_lconv_monetary_t),
            "::",
            stringify!(p_sep_by_space)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).n_sep_by_space) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_lconv_monetary_t),
            "::",
            stringify!(n_sep_by_space)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).p_sign_posn) as usize - ptr as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_lconv_monetary_t),
            "::",
            stringify!(p_sign_posn)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).n_sign_posn) as usize - ptr as usize },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_lconv_monetary_t),
            "::",
            stringify!(n_sign_posn)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).int_frac_digits) as usize - ptr as usize },
        35usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_lconv_monetary_t),
            "::",
            stringify!(int_frac_digits)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).int_p_cs_precedes) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_lconv_monetary_t),
            "::",
            stringify!(int_p_cs_precedes)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).int_n_cs_precedes) as usize - ptr as usize },
        37usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_lconv_monetary_t),
            "::",
            stringify!(int_n_cs_precedes)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).int_p_sep_by_space) as usize - ptr as usize },
        38usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_lconv_monetary_t),
            "::",
            stringify!(int_p_sep_by_space)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).int_n_sep_by_space) as usize - ptr as usize },
        39usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_lconv_monetary_t),
            "::",
            stringify!(int_n_sep_by_space)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).int_p_sign_posn) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_lconv_monetary_t),
            "::",
            stringify!(int_p_sign_posn)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).int_n_sign_posn) as usize - ptr as usize },
        41usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_lconv_monetary_t),
            "::",
            stringify!(int_n_sign_posn)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PDCLIB_lc_numeric_monetary_t {
    pub lconv: *mut lconv,
    pub numeric_alloced: libc::c_int,
    pub monetary_alloced: libc::c_int,
}
#[test]
fn bindgen_test_layout__PDCLIB_lc_numeric_monetary_t() {
    const UNINIT: ::core::mem::MaybeUninit<_PDCLIB_lc_numeric_monetary_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_PDCLIB_lc_numeric_monetary_t>(),
        12usize,
        concat!("Size of: ", stringify!(_PDCLIB_lc_numeric_monetary_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_PDCLIB_lc_numeric_monetary_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_PDCLIB_lc_numeric_monetary_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lconv) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_numeric_monetary_t),
            "::",
            stringify!(lconv)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).numeric_alloced) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_numeric_monetary_t),
            "::",
            stringify!(numeric_alloced)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).monetary_alloced) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_numeric_monetary_t),
            "::",
            stringify!(monetary_alloced)
        )
    );
}
extern "C" {
    pub static mut _PDCLIB_lc_numeric_monetary: _PDCLIB_lc_numeric_monetary_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PDCLIB_lc_collate_t {
    pub alloced: libc::c_int,
}
#[test]
fn bindgen_test_layout__PDCLIB_lc_collate_t() {
    const UNINIT: ::core::mem::MaybeUninit<_PDCLIB_lc_collate_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_PDCLIB_lc_collate_t>(),
        4usize,
        concat!("Size of: ", stringify!(_PDCLIB_lc_collate_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_PDCLIB_lc_collate_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_PDCLIB_lc_collate_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).alloced) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_collate_t),
            "::",
            stringify!(alloced)
        )
    );
}
extern "C" {
    pub static mut _PDCLIB_lc_collate: _PDCLIB_lc_collate_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PDCLIB_lc_ctype_entry_t {
    pub flags: _PDCLIB_uint16_t,
    pub upper: libc::c_uchar,
    pub lower: libc::c_uchar,
}
#[test]
fn bindgen_test_layout__PDCLIB_lc_ctype_entry_t() {
    const UNINIT: ::core::mem::MaybeUninit<_PDCLIB_lc_ctype_entry_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_PDCLIB_lc_ctype_entry_t>(),
        4usize,
        concat!("Size of: ", stringify!(_PDCLIB_lc_ctype_entry_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_PDCLIB_lc_ctype_entry_t>(),
        2usize,
        concat!("Alignment of ", stringify!(_PDCLIB_lc_ctype_entry_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_ctype_entry_t),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).upper) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_ctype_entry_t),
            "::",
            stringify!(upper)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lower) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_ctype_entry_t),
            "::",
            stringify!(lower)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PDCLIB_lc_ctype_t {
    pub alloced: libc::c_int,
    pub digits_low: libc::c_int,
    pub digits_high: libc::c_int,
    pub Xdigits_low: libc::c_int,
    pub Xdigits_high: libc::c_int,
    pub xdigits_low: libc::c_int,
    pub xdigits_high: libc::c_int,
    pub entry: *mut _PDCLIB_lc_ctype_entry_t,
}
#[test]
fn bindgen_test_layout__PDCLIB_lc_ctype_t() {
    const UNINIT: ::core::mem::MaybeUninit<_PDCLIB_lc_ctype_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_PDCLIB_lc_ctype_t>(),
        32usize,
        concat!("Size of: ", stringify!(_PDCLIB_lc_ctype_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_PDCLIB_lc_ctype_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_PDCLIB_lc_ctype_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).alloced) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_ctype_t),
            "::",
            stringify!(alloced)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).digits_low) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_ctype_t),
            "::",
            stringify!(digits_low)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).digits_high) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_ctype_t),
            "::",
            stringify!(digits_high)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Xdigits_low) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_ctype_t),
            "::",
            stringify!(Xdigits_low)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Xdigits_high) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_ctype_t),
            "::",
            stringify!(Xdigits_high)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xdigits_low) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_ctype_t),
            "::",
            stringify!(xdigits_low)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xdigits_high) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_ctype_t),
            "::",
            stringify!(xdigits_high)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).entry) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_ctype_t),
            "::",
            stringify!(entry)
        )
    );
}
extern "C" {
    pub static mut _PDCLIB_lc_ctype: _PDCLIB_lc_ctype_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PDCLIB_lc_messages_t {
    pub alloced: libc::c_int,
    pub errno_texts: [*mut libc::c_char; 141usize],
}
#[test]
fn bindgen_test_layout__PDCLIB_lc_messages_t() {
    const UNINIT: ::core::mem::MaybeUninit<_PDCLIB_lc_messages_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_PDCLIB_lc_messages_t>(),
        568usize,
        concat!("Size of: ", stringify!(_PDCLIB_lc_messages_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_PDCLIB_lc_messages_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_PDCLIB_lc_messages_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).alloced) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_messages_t),
            "::",
            stringify!(alloced)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).errno_texts) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_messages_t),
            "::",
            stringify!(errno_texts)
        )
    );
}
extern "C" {
    pub static mut _PDCLIB_lc_messages: _PDCLIB_lc_messages_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PDCLIB_lc_time_t {
    pub alloced: libc::c_int,
    pub month_name_abbr: [*mut libc::c_char; 12usize],
    pub month_name_full: [*mut libc::c_char; 12usize],
    pub day_name_abbr: [*mut libc::c_char; 7usize],
    pub day_name_full: [*mut libc::c_char; 7usize],
    pub date_time_format: *mut libc::c_char,
    pub time_format_12h: *mut libc::c_char,
    pub date_format: *mut libc::c_char,
    pub time_format: *mut libc::c_char,
    pub am_pm: [*mut libc::c_char; 2usize],
}
#[test]
fn bindgen_test_layout__PDCLIB_lc_time_t() {
    const UNINIT: ::core::mem::MaybeUninit<_PDCLIB_lc_time_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_PDCLIB_lc_time_t>(),
        180usize,
        concat!("Size of: ", stringify!(_PDCLIB_lc_time_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_PDCLIB_lc_time_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_PDCLIB_lc_time_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).alloced) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_time_t),
            "::",
            stringify!(alloced)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).month_name_abbr) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_time_t),
            "::",
            stringify!(month_name_abbr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).month_name_full) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_time_t),
            "::",
            stringify!(month_name_full)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).day_name_abbr) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_time_t),
            "::",
            stringify!(day_name_abbr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).day_name_full) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_time_t),
            "::",
            stringify!(day_name_full)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).date_time_format) as usize - ptr as usize },
        156usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_time_t),
            "::",
            stringify!(date_time_format)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).time_format_12h) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_time_t),
            "::",
            stringify!(time_format_12h)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).date_format) as usize - ptr as usize },
        164usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_time_t),
            "::",
            stringify!(date_format)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).time_format) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_time_t),
            "::",
            stringify!(time_format)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).am_pm) as usize - ptr as usize },
        172usize,
        concat!(
            "Offset of field: ",
            stringify!(_PDCLIB_lc_time_t),
            "::",
            stringify!(am_pm)
        )
    );
}
extern "C" {
    pub static mut _PDCLIB_lc_time: _PDCLIB_lc_time_t;
}
extern "C" {
    pub fn _PDCLIB_load_lc_numeric(
        path: *const libc::c_char,
        locale: *const libc::c_char,
    ) -> *mut _PDCLIB_lc_lconv_numeric_t;
}
extern "C" {
    pub fn _PDCLIB_load_lc_monetary(
        path: *const libc::c_char,
        locale: *const libc::c_char,
    ) -> *mut _PDCLIB_lc_lconv_monetary_t;
}
extern "C" {
    pub fn _PDCLIB_load_lc_collate(
        path: *const libc::c_char,
        locale: *const libc::c_char,
    ) -> *mut _PDCLIB_lc_collate_t;
}
extern "C" {
    pub fn _PDCLIB_load_lc_ctype(
        path: *const libc::c_char,
        locale: *const libc::c_char,
    ) -> *mut _PDCLIB_lc_ctype_t;
}
extern "C" {
    pub fn _PDCLIB_load_lc_time(
        path: *const libc::c_char,
        locale: *const libc::c_char,
    ) -> *mut _PDCLIB_lc_time_t;
}
extern "C" {
    pub fn _PDCLIB_load_lc_messages(
        path: *const libc::c_char,
        locale: *const libc::c_char,
    ) -> *mut _PDCLIB_lc_messages_t;
}
pub const _PDCLIB_assert_568: _bindgen_ty_1 = 1;
pub type _bindgen_ty_1 = libc::c_int;
pub const _PDCLIB_assert_569: _bindgen_ty_2 = 1;
pub type _bindgen_ty_2 = libc::c_int;
pub const _PDCLIB_assert_570: _bindgen_ty_3 = 1;
pub type _bindgen_ty_3 = libc::c_int;
pub const _PDCLIB_assert_571: _bindgen_ty_4 = 1;
pub type _bindgen_ty_4 = libc::c_int;
pub const _PDCLIB_assert_574: _bindgen_ty_5 = 1;
pub type _bindgen_ty_5 = libc::c_int;
pub const _PDCLIB_assert_577: _bindgen_ty_6 = 1;
pub type _bindgen_ty_6 = libc::c_int;
pub const _PDCLIB_assert_580: _bindgen_ty_7 = 1;
pub type _bindgen_ty_7 = libc::c_int;
pub const _PDCLIB_assert_586: _bindgen_ty_8 = 1;
pub type _bindgen_ty_8 = libc::c_int;
pub const _PDCLIB_assert_589: _bindgen_ty_9 = 1;
pub type _bindgen_ty_9 = libc::c_int;
pub type fpos_t = _PDCLIB_fpos_t;
pub type FILE = _PDCLIB_file_t;
extern "C" {
    pub static mut stdin: *mut FILE;
}
extern "C" {
    pub static mut stdout: *mut FILE;
}
extern "C" {
    pub static mut stderr: *mut FILE;
}
extern "C" {
    pub fn remove(filename: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn rename(oldpath: *const libc::c_char, newpath: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
extern "C" {
    pub fn tmpnam(s: *mut libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn fclose(stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn fflush(stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn fopen(filename: *const libc::c_char, mode: *const libc::c_char) -> *mut FILE;
}
extern "C" {
    pub fn freopen(
        filename: *const libc::c_char,
        mode: *const libc::c_char,
        stream: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn setbuf(stream: *mut FILE, buf: *mut libc::c_char);
}
extern "C" {
    pub fn setvbuf(
        stream: *mut FILE,
        buf: *mut libc::c_char,
        mode: libc::c_int,
        size: usize,
    ) -> libc::c_int;
}
extern "C" {
    pub fn fprintf(stream: *mut FILE, format: *const libc::c_char, ...) -> libc::c_int;
}
extern "C" {
    pub fn fscanf(stream: *mut FILE, format: *const libc::c_char, ...) -> libc::c_int;
}
extern "C" {
    pub fn printf(format: *const libc::c_char, ...) -> libc::c_int;
}
extern "C" {
    pub fn scanf(format: *const libc::c_char, ...) -> libc::c_int;
}
extern "C" {
    pub fn snprintf(
        s: *mut libc::c_char,
        n: libc::c_uint,
        format: *const libc::c_char,
        ...
    ) -> libc::c_int;
}
extern "C" {
    pub fn sprintf(s: *mut libc::c_char, format: *const libc::c_char, ...) -> libc::c_int;
}
extern "C" {
    pub fn sscanf(s: *const libc::c_char, format: *const libc::c_char, ...) -> libc::c_int;
}
extern "C" {
    pub fn vfprintf(
        stream: *mut FILE,
        format: *const libc::c_char,
        arg: __builtin_va_list,
    ) -> libc::c_int;
}
extern "C" {
    pub fn vfscanf(
        stream: *mut FILE,
        format: *const libc::c_char,
        arg: __builtin_va_list,
    ) -> libc::c_int;
}
extern "C" {
    pub fn vprintf(format: *const libc::c_char, arg: __builtin_va_list) -> libc::c_int;
}
extern "C" {
    pub fn vscanf(format: *const libc::c_char, arg: __builtin_va_list) -> libc::c_int;
}
extern "C" {
    pub fn vsnprintf(
        s: *mut libc::c_char,
        n: libc::c_uint,
        format: *const libc::c_char,
        arg: __builtin_va_list,
    ) -> libc::c_int;
}
extern "C" {
    pub fn vsprintf(
        s: *mut libc::c_char,
        format: *const libc::c_char,
        arg: __builtin_va_list,
    ) -> libc::c_int;
}
extern "C" {
    pub fn vsscanf(
        s: *const libc::c_char,
        format: *const libc::c_char,
        arg: __builtin_va_list,
    ) -> libc::c_int;
}
extern "C" {
    pub fn fgetc(stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn fgets(s: *mut libc::c_char, n: libc::c_int, stream: *mut FILE) -> *mut libc::c_char;
}
extern "C" {
    pub fn fputc(c: libc::c_int, stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn fputs(s: *const libc::c_char, stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn getc(stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn getchar() -> libc::c_int;
}
extern "C" {
    pub fn putc(c: libc::c_int, stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn putchar(c: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn puts(s: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn ungetc(c: libc::c_int, stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn fread(
        ptr: *mut libc::c_void,
        size: libc::c_uint,
        nmemb: libc::c_uint,
        stream: *mut FILE,
    ) -> libc::c_uint;
}
extern "C" {
    pub fn fwrite(
        ptr: *const libc::c_void,
        size: libc::c_uint,
        nmemb: libc::c_uint,
        stream: *mut FILE,
    ) -> libc::c_uint;
}
extern "C" {
    pub fn fgetpos(stream: *mut FILE, pos: *mut fpos_t) -> libc::c_int;
}
extern "C" {
    pub fn fseek(stream: *mut FILE, offset: libc::c_long, whence: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn fsetpos(stream: *mut FILE, pos: *const fpos_t) -> libc::c_int;
}
extern "C" {
    pub fn ftell(stream: *mut FILE) -> libc::c_long;
}
extern "C" {
    pub fn rewind(stream: *mut FILE);
}
extern "C" {
    pub fn clearerr(stream: *mut FILE);
}
extern "C" {
    pub fn feof(stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn ferror(stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn perror(s: *const libc::c_char);
}
extern "C" {
    pub fn atof(nptr: *const libc::c_char) -> f64;
}
extern "C" {
    pub fn strtod(nptr: *const libc::c_char, endptr: *mut *mut libc::c_char) -> f64;
}
extern "C" {
    pub fn strtof(nptr: *const libc::c_char, endptr: *mut *mut libc::c_char) -> f32;
}
extern "C" {
    pub fn strtold(nptr: *const libc::c_char, endptr: *mut *mut libc::c_char) -> f64;
}
extern "C" {
    pub fn strtol(
        nptr: *const libc::c_char,
        endptr: *mut *mut libc::c_char,
        base: libc::c_int,
    ) -> libc::c_long;
}
extern "C" {
    pub fn strtoll(
        nptr: *const libc::c_char,
        endptr: *mut *mut libc::c_char,
        base: libc::c_int,
    ) -> libc::c_longlong;
}
extern "C" {
    pub fn strtoul(
        nptr: *const libc::c_char,
        endptr: *mut *mut libc::c_char,
        base: libc::c_int,
    ) -> libc::c_ulong;
}
extern "C" {
    pub fn strtoull(
        nptr: *const libc::c_char,
        endptr: *mut *mut libc::c_char,
        base: libc::c_int,
    ) -> libc::c_ulonglong;
}
extern "C" {
    pub fn atoi(nptr: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn atol(nptr: *const libc::c_char) -> libc::c_long;
}
extern "C" {
    pub fn atoll(nptr: *const libc::c_char) -> libc::c_longlong;
}
extern "C" {
    pub static mut _PDCLIB_seed: libc::c_ulong;
}
extern "C" {
    pub fn rand() -> libc::c_int;
}
extern "C" {
    pub fn srand(seed: libc::c_uint);
}
extern "C" {
    pub fn malloc(size: libc::c_uint) -> *mut libc::c_void;
}
extern "C" {
    pub fn calloc(nmemb: libc::c_uint, size: libc::c_uint) -> *mut libc::c_void;
}
extern "C" {
    pub fn aligned_alloc(alignment: libc::c_uint, size: libc::c_uint) -> *mut libc::c_void;
}
extern "C" {
    pub fn free(ptr: *mut libc::c_void);
}
extern "C" {
    pub fn realloc(ptr: *mut libc::c_void, size: libc::c_uint) -> *mut libc::c_void;
}
extern "C" {
    pub fn abort() -> !;
}
extern "C" {
    pub fn at_quick_exit(func: ::core::option::Option<unsafe extern "C" fn()>) -> libc::c_int;
}
extern "C" {
    pub fn atexit(func: ::core::option::Option<unsafe extern "C" fn()>) -> libc::c_int;
}
extern "C" {
    pub fn exit(status: libc::c_int) -> !;
}
extern "C" {
    pub fn quick_exit(status: libc::c_int);
}
extern "C" {
    pub fn _Exit(status: libc::c_int) -> !;
}
extern "C" {
    pub fn getenv(name: *const libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn system(string: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn bsearch(
        key: *const libc::c_void,
        base: *const libc::c_void,
        nmemb: usize,
        size: usize,
        compar: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *const libc::c_void,
                arg2: *const libc::c_void,
            ) -> libc::c_int,
        >,
    ) -> *mut libc::c_void;
}
extern "C" {
    pub fn qsort(
        base: *mut libc::c_void,
        nmemb: usize,
        size: usize,
        compar: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *const libc::c_void,
                arg2: *const libc::c_void,
            ) -> libc::c_int,
        >,
    );
}
extern "C" {
    pub fn abs(j: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn labs(j: libc::c_long) -> libc::c_long;
}
extern "C" {
    pub fn llabs(j: libc::c_longlong) -> libc::c_longlong;
}
pub type div_t = _PDCLIB_div_t;
pub type ldiv_t = _PDCLIB_ldiv_t;
pub type lldiv_t = _PDCLIB_lldiv_t;
extern "C" {
    pub fn div(numer: libc::c_int, denom: libc::c_int) -> div_t;
}
extern "C" {
    pub fn ldiv(numer: libc::c_long, denom: libc::c_long) -> ldiv_t;
}
extern "C" {
    pub fn lldiv(numer: libc::c_longlong, denom: libc::c_longlong) -> lldiv_t;
}
extern "C" {
    pub fn _byteswap_ushort(val: libc::c_ushort) -> libc::c_ushort;
}
extern "C" {
    pub fn _byteswap_ulong(val: libc::c_ulong) -> libc::c_ulong;
}
extern "C" {
    pub fn _byteswap_uint64(val: libc::c_ulonglong) -> libc::c_ulonglong;
}
pub type _purecall_handler = ::core::option::Option<unsafe extern "C" fn()>;
extern "C" {
    pub fn _get_purecall_handler() -> _purecall_handler;
}
extern "C" {
    pub fn _set_purecall_handler(function: _purecall_handler) -> _purecall_handler;
}
pub type int_least8_t = i8;
pub type int_least16_t = i16;
pub type int_least32_t = i32;
pub type int_least64_t = i64;
pub type uint_least8_t = u8;
pub type uint_least16_t = u16;
pub type uint_least32_t = u32;
pub type uint_least64_t = u64;
pub type int_fast8_t = _PDCLIB_int_fast8_t;
pub type int_fast16_t = _PDCLIB_int_fast16_t;
pub type int_fast32_t = _PDCLIB_int_fast32_t;
pub type int_fast64_t = _PDCLIB_int_fast64_t;
pub type uint_fast8_t = _PDCLIB_uint_fast8_t;
pub type uint_fast16_t = _PDCLIB_uint_fast16_t;
pub type uint_fast32_t = _PDCLIB_uint_fast32_t;
pub type uint_fast64_t = _PDCLIB_uint_fast64_t;
pub type intmax_t = _PDCLIB_intmax_t;
pub type uintmax_t = _PDCLIB_uintmax_t;
pub type wchar_t = _PDCLIB_wchar_t;
pub type wint_t = _PDCLIB_wint_t;
pub type wctrans_t = libc::c_int;
pub type wctype_t = libc::c_int;
extern "C" {
    pub fn iswalnum(wc: wint_t) -> libc::c_int;
}
extern "C" {
    pub fn iswalpha(wc: wint_t) -> libc::c_int;
}
extern "C" {
    pub fn iswblank(wc: wint_t) -> libc::c_int;
}
extern "C" {
    pub fn iswcntrl(wc: wint_t) -> libc::c_int;
}
extern "C" {
    pub fn iswdigit(wc: wint_t) -> libc::c_int;
}
extern "C" {
    pub fn iswgraph(wc: wint_t) -> libc::c_int;
}
extern "C" {
    pub fn iswlower(wc: wint_t) -> libc::c_int;
}
extern "C" {
    pub fn iswprint(wc: wint_t) -> libc::c_int;
}
extern "C" {
    pub fn iswpunct(wc: wint_t) -> libc::c_int;
}
extern "C" {
    pub fn iswspace(wc: wint_t) -> libc::c_int;
}
extern "C" {
    pub fn iswupper(wc: wint_t) -> libc::c_int;
}
extern "C" {
    pub fn iswxdigit(wc: wint_t) -> libc::c_int;
}
extern "C" {
    pub fn iswctype(wc: wint_t, desc: wctype_t) -> libc::c_int;
}
extern "C" {
    pub fn wctype(property: *const libc::c_char) -> wctype_t;
}
extern "C" {
    pub fn towlower(wc: wint_t) -> wint_t;
}
extern "C" {
    pub fn towupper(wc: wint_t) -> wint_t;
}
extern "C" {
    pub fn towctrans(wc: wint_t, desc: wctrans_t) -> wint_t;
}
extern "C" {
    pub fn wctrans(property: *const libc::c_char) -> wctrans_t;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct XBOXRT_mbstate {
    pub __bindgen_anon_1: XBOXRT_mbstate__bindgen_ty_1,
    pub _Surrogate: u16,
    pub _PendState: libc::c_uchar,
    pub _PendChar: libc::c_char,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union XBOXRT_mbstate__bindgen_ty_1 {
    pub _St64: [u64; 15usize],
    pub _St32: [u32; 31usize],
    pub _St16: [u16; 62usize],
    pub _StUC: [libc::c_uchar; 124usize],
    pub _StSC: [libc::c_schar; 124usize],
    pub _StC: [libc::c_char; 124usize],
}
#[test]
fn bindgen_test_layout_XBOXRT_mbstate__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<XBOXRT_mbstate__bindgen_ty_1> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<XBOXRT_mbstate__bindgen_ty_1>(),
        128usize,
        concat!("Size of: ", stringify!(XBOXRT_mbstate__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<XBOXRT_mbstate__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(XBOXRT_mbstate__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._St64) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XBOXRT_mbstate__bindgen_ty_1),
            "::",
            stringify!(_St64)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._St32) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XBOXRT_mbstate__bindgen_ty_1),
            "::",
            stringify!(_St32)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._St16) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XBOXRT_mbstate__bindgen_ty_1),
            "::",
            stringify!(_St16)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._StUC) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XBOXRT_mbstate__bindgen_ty_1),
            "::",
            stringify!(_StUC)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._StSC) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XBOXRT_mbstate__bindgen_ty_1),
            "::",
            stringify!(_StSC)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._StC) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XBOXRT_mbstate__bindgen_ty_1),
            "::",
            stringify!(_StC)
        )
    );
}
#[test]
fn bindgen_test_layout_XBOXRT_mbstate() {
    const UNINIT: ::core::mem::MaybeUninit<XBOXRT_mbstate> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<XBOXRT_mbstate>(),
        136usize,
        concat!("Size of: ", stringify!(XBOXRT_mbstate))
    );
    assert_eq!(
        ::core::mem::align_of::<XBOXRT_mbstate>(),
        8usize,
        concat!("Alignment of ", stringify!(XBOXRT_mbstate))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._Surrogate) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(XBOXRT_mbstate),
            "::",
            stringify!(_Surrogate)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._PendState) as usize - ptr as usize },
        130usize,
        concat!(
            "Offset of field: ",
            stringify!(XBOXRT_mbstate),
            "::",
            stringify!(_PendState)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._PendChar) as usize - ptr as usize },
        131usize,
        concat!(
            "Offset of field: ",
            stringify!(XBOXRT_mbstate),
            "::",
            stringify!(_PendChar)
        )
    );
}
pub type XBOXRT_mbstate_t = XBOXRT_mbstate;
pub type mbstate_t = XBOXRT_mbstate_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm {
    _unused: [u8; 0],
}
extern "C" {
    pub fn wcscpy(s1: *mut wchar_t, s2: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsncpy(s1: *mut wchar_t, s2: *const wchar_t, n: usize) -> *mut wchar_t;
}
extern "C" {
    pub fn wmemcpy(
        s1: *mut libc::c_ushort,
        s2: *const libc::c_ushort,
        n: libc::c_uint,
    ) -> *mut libc::c_ushort;
}
extern "C" {
    pub fn wmemmove(
        s1: *mut libc::c_ushort,
        s2: *const libc::c_ushort,
        n: libc::c_uint,
    ) -> *mut libc::c_ushort;
}
extern "C" {
    pub fn wcscat(s1: *mut wchar_t, s2: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsncat(s1: *mut wchar_t, s2: *const wchar_t, n: usize) -> *mut wchar_t;
}
extern "C" {
    pub fn wcscmp(s1: *const libc::c_ushort, s2: *const libc::c_ushort) -> libc::c_int;
}
extern "C" {
    pub fn wcscoll(s1: *const wchar_t, s2: *const wchar_t) -> libc::c_int;
}
extern "C" {
    pub fn wcsncmp(
        s1: *const libc::c_ushort,
        s2: *const libc::c_ushort,
        n: libc::c_uint,
    ) -> libc::c_int;
}
extern "C" {
    pub fn wcsxfrm(s1: *mut wchar_t, s2: *const wchar_t, n: usize) -> usize;
}
extern "C" {
    pub fn wmemcmp(
        s1: *const libc::c_ushort,
        s2: *const libc::c_ushort,
        n: libc::c_uint,
    ) -> libc::c_int;
}
extern "C" {
    pub fn wcschr(s: *const libc::c_ushort, c: libc::c_ushort) -> *mut libc::c_ushort;
}
extern "C" {
    pub fn wcscspn(s1: *const wchar_t, s2: *const wchar_t) -> usize;
}
extern "C" {
    pub fn wcspbrk(s1: *const wchar_t, s2: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsrchr(s: *const wchar_t, c: wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsspn(s1: *const wchar_t, s2: *const wchar_t) -> usize;
}
extern "C" {
    pub fn wcsstr(s1: *const wchar_t, s2: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcstok(s1: *mut wchar_t, s2: *const wchar_t, ptr: *mut *mut wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wmemchr(
        s: *const libc::c_ushort,
        c: libc::c_ushort,
        n: libc::c_uint,
    ) -> *mut libc::c_ushort;
}
extern "C" {
    pub fn wcslen(s: *const libc::c_ushort) -> libc::c_uint;
}
extern "C" {
    pub fn mbsinit(ps: *const mbstate_t) -> libc::c_int;
}
extern "C" {
    pub fn mbrtowc(
        pwc: *mut wchar_t,
        s: *const libc::c_char,
        n: usize,
        ps: *mut mbstate_t,
    ) -> usize;
}
extern "C" {
    pub fn wcrtomb(s: *mut libc::c_char, wc: wchar_t, ps: *mut mbstate_t) -> usize;
}
extern "C" {
    pub fn wmemset(wcs: *mut wchar_t, wc: wchar_t, n: usize) -> *mut wchar_t;
}
extern "C" {
    pub fn wcstod(nptr: *const wchar_t, endptr: *mut *mut wchar_t) -> f64;
}
extern "C" {
    pub fn wcstof(nptr: *const wchar_t, endptr: *mut *mut wchar_t) -> f32;
}
extern "C" {
    pub fn wcstold(nptr: *const wchar_t, endptr: *mut *mut wchar_t) -> f64;
}
extern "C" {
    pub fn wcstol(
        nptr: *const wchar_t,
        endptr: *mut *mut wchar_t,
        base: libc::c_int,
    ) -> libc::c_long;
}
extern "C" {
    pub fn wcstoll(
        nptr: *const wchar_t,
        endptr: *mut *mut wchar_t,
        base: libc::c_int,
    ) -> libc::c_longlong;
}
extern "C" {
    pub fn wcstoul(
        nptr: *const wchar_t,
        endptr: *mut *mut wchar_t,
        base: libc::c_int,
    ) -> libc::c_ulong;
}
extern "C" {
    pub fn wcstoull(
        nptr: *const wchar_t,
        endptr: *mut *mut wchar_t,
        base: libc::c_int,
    ) -> libc::c_ulonglong;
}
extern "C" {
    pub fn mbrlen(s: *const libc::c_char, n: usize, ps: *mut mbstate_t) -> usize;
}
extern "C" {
    pub fn btowc(c: libc::c_int) -> wint_t;
}
extern "C" {
    pub fn mbsrtowcs(
        dest: *mut wchar_t,
        src: *mut *const libc::c_char,
        len: usize,
        ps: *mut mbstate_t,
    ) -> usize;
}
extern "C" {
    pub fn wctob(c: wint_t) -> libc::c_int;
}
extern "C" {
    pub fn wcrtomb_s(
        retval: *mut usize,
        s: *mut libc::c_char,
        ssz: usize,
        wc: wchar_t,
        ps: *mut mbstate_t,
    ) -> libc::c_int;
}
extern "C" {
    pub fn _snwprintf(
        buffer: *mut wchar_t,
        count: usize,
        format: *const wchar_t,
        ...
    ) -> libc::c_int;
}
extern "C" {
    pub fn mbtowc(pwc: *mut wchar_t, string: *const libc::c_char, n: usize) -> libc::c_int;
}
pub type va_list = _PDCLIB_va_list;
extern "C" {
    pub fn memcpy(
        s1: *mut libc::c_void,
        s2: *const libc::c_void,
        n: libc::c_uint,
    ) -> *mut libc::c_void;
}
extern "C" {
    pub fn memmove(
        s1: *mut libc::c_void,
        s2: *const libc::c_void,
        n: libc::c_uint,
    ) -> *mut libc::c_void;
}
extern "C" {
    pub fn strcpy(s1: *mut libc::c_char, s2: *const libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn strncpy(
        s1: *mut libc::c_char,
        s2: *const libc::c_char,
        n: libc::c_uint,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn strcat(s1: *mut libc::c_char, s2: *const libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn strncat(
        s1: *mut libc::c_char,
        s2: *const libc::c_char,
        n: libc::c_uint,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn memcmp(s1: *const libc::c_void, s2: *const libc::c_void, n: libc::c_uint)
        -> libc::c_int;
}
extern "C" {
    pub fn strcmp(s1: *const libc::c_char, s2: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn strcoll(s1: *const libc::c_char, s2: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn strncmp(
        s1: *const libc::c_char,
        s2: *const libc::c_char,
        n: libc::c_uint,
    ) -> libc::c_int;
}
extern "C" {
    pub fn strxfrm(s1: *mut libc::c_char, s2: *const libc::c_char, n: libc::c_uint)
        -> libc::c_uint;
}
extern "C" {
    pub fn memchr(s: *const libc::c_void, c: libc::c_int, n: libc::c_uint) -> *mut libc::c_void;
}
extern "C" {
    pub fn strchr(s: *const libc::c_char, c: libc::c_int) -> *mut libc::c_char;
}
extern "C" {
    pub fn strcspn(s1: *const libc::c_char, s2: *const libc::c_char) -> libc::c_uint;
}
extern "C" {
    pub fn strpbrk(s1: *const libc::c_char, s2: *const libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn strrchr(s: *const libc::c_char, c: libc::c_int) -> *mut libc::c_char;
}
extern "C" {
    pub fn strspn(s1: *const libc::c_char, s2: *const libc::c_char) -> libc::c_uint;
}
extern "C" {
    pub fn strstr(s1: *const libc::c_char, s2: *const libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn strtok(s1: *mut libc::c_char, s2: *const libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn memset(s: *mut libc::c_void, c: libc::c_int, n: libc::c_uint) -> *mut libc::c_void;
}
extern "C" {
    pub fn strerror(errnum: libc::c_int) -> *mut libc::c_char;
}
extern "C" {
    pub fn strlen(s: *const libc::c_char) -> libc::c_uint;
}
extern "C" {
    pub fn strdup(s: *const libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn _strnicmp(s1: *const libc::c_char, s2: *const libc::c_char, n: usize) -> libc::c_int;
}
extern "C" {
    pub fn _stricmp(s1: *const libc::c_char, s2: *const libc::c_char) -> libc::c_int;
}
pub type imaxdiv_t = _PDCLIB_imaxdiv_t;
extern "C" {
    pub fn imaxabs(j: intmax_t) -> intmax_t;
}
extern "C" {
    pub fn imaxdiv(numer: intmax_t, denom: intmax_t) -> imaxdiv_t;
}
extern "C" {
    pub fn strtoimax(
        nptr: *const libc::c_char,
        endptr: *mut *mut libc::c_char,
        base: libc::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn strtoumax(
        nptr: *const libc::c_char,
        endptr: *mut *mut libc::c_char,
        base: libc::c_int,
    ) -> uintmax_t;
}
extern "C" {
    pub fn isalnum(c: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn isalpha(c: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn isblank(c: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn iscntrl(c: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn isdigit(c: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn isgraph(c: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn islower(c: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn isprint(c: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn ispunct(c: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn isspace(c: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn isupper(c: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn isxdigit(c: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn tolower(c: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn toupper(c: libc::c_int) -> libc::c_int;
}
pub type float_t = f32;
pub type double_t = f64;
extern "C" {
    pub fn __fpclassifyf(x: f32) -> libc::c_int;
}
extern "C" {
    pub fn __fpclassify(x: f64) -> libc::c_int;
}
extern "C" {
    pub fn __fpclassifyl(x: f64) -> libc::c_int;
}
extern "C" {
    pub fn __signbitf(x: f32) -> libc::c_int;
}
extern "C" {
    pub fn __signbit(x: f64) -> libc::c_int;
}
extern "C" {
    pub fn __signbitl(x: f64) -> libc::c_int;
}
extern "C" {
    pub fn acos(x: f64) -> f64;
}
extern "C" {
    pub fn acosf(x: f32) -> f32;
}
extern "C" {
    pub fn acosl(x: f64) -> f64;
}
extern "C" {
    pub fn asin(x: f64) -> f64;
}
extern "C" {
    pub fn asinf(x: f32) -> f32;
}
extern "C" {
    pub fn asinl(x: f64) -> f64;
}
extern "C" {
    pub fn atan(x: f64) -> f64;
}
extern "C" {
    pub fn atanf(x: f32) -> f32;
}
extern "C" {
    pub fn atanl(x: f64) -> f64;
}
extern "C" {
    pub fn atan2(y: f64, x: f64) -> f64;
}
extern "C" {
    pub fn atan2f(y: f32, x: f32) -> f32;
}
extern "C" {
    pub fn atan2l(y: f64, x: f64) -> f64;
}
extern "C" {
    pub fn cos(x: f64) -> f64;
}
extern "C" {
    pub fn cosf(x: f32) -> f32;
}
extern "C" {
    pub fn cosl(x: f64) -> f64;
}
extern "C" {
    pub fn sin(x: f64) -> f64;
}
extern "C" {
    pub fn sinf(x: f32) -> f32;
}
extern "C" {
    pub fn sinl(x: f64) -> f64;
}
extern "C" {
    pub fn tan(x: f64) -> f64;
}
extern "C" {
    pub fn tanf(x: f32) -> f32;
}
extern "C" {
    pub fn tanl(x: f64) -> f64;
}
extern "C" {
    pub fn acosh(x: f64) -> f64;
}
extern "C" {
    pub fn acoshf(x: f32) -> f32;
}
extern "C" {
    pub fn acoshl(x: f64) -> f64;
}
extern "C" {
    pub fn asinh(x: f64) -> f64;
}
extern "C" {
    pub fn asinhf(x: f32) -> f32;
}
extern "C" {
    pub fn asinhl(x: f64) -> f64;
}
extern "C" {
    pub fn atanh(x: f64) -> f64;
}
extern "C" {
    pub fn atanhf(x: f32) -> f32;
}
extern "C" {
    pub fn atanhl(x: f64) -> f64;
}
extern "C" {
    pub fn cosh(x: f64) -> f64;
}
extern "C" {
    pub fn coshf(x: f32) -> f32;
}
extern "C" {
    pub fn coshl(x: f64) -> f64;
}
extern "C" {
    pub fn sinh(x: f64) -> f64;
}
extern "C" {
    pub fn sinhf(x: f32) -> f32;
}
extern "C" {
    pub fn sinhl(x: f64) -> f64;
}
extern "C" {
    pub fn tanh(x: f64) -> f64;
}
extern "C" {
    pub fn tanhf(x: f32) -> f32;
}
extern "C" {
    pub fn tanhl(x: f64) -> f64;
}
extern "C" {
    pub fn exp(x: f64) -> f64;
}
extern "C" {
    pub fn expf(x: f32) -> f32;
}
extern "C" {
    pub fn expl(x: f64) -> f64;
}
extern "C" {
    pub fn exp2(x: f64) -> f64;
}
extern "C" {
    pub fn exp2f(x: f32) -> f32;
}
extern "C" {
    pub fn exp2l(x: f64) -> f64;
}
extern "C" {
    pub fn expm1(x: f64) -> f64;
}
extern "C" {
    pub fn expm1f(x: f32) -> f32;
}
extern "C" {
    pub fn expm1l(x: f64) -> f64;
}
extern "C" {
    pub fn frexp(value: f64, exp: *mut libc::c_int) -> f64;
}
extern "C" {
    pub fn frexpf(value: f32, exp: *mut libc::c_int) -> f32;
}
extern "C" {
    pub fn frexpl(value: f64, exp: *mut libc::c_int) -> f64;
}
extern "C" {
    pub fn ilogb(x: f64) -> libc::c_int;
}
extern "C" {
    pub fn ilogbf(x: f32) -> libc::c_int;
}
extern "C" {
    pub fn ilogbl(x: f64) -> libc::c_int;
}
extern "C" {
    pub fn ldexp(x: f64, exp: libc::c_int) -> f64;
}
extern "C" {
    pub fn ldexpf(x: f32, exp: libc::c_int) -> f32;
}
extern "C" {
    pub fn ldexpl(x: f64, exp: libc::c_int) -> f64;
}
extern "C" {
    pub fn log(x: f64) -> f64;
}
extern "C" {
    pub fn logf(x: f32) -> f32;
}
extern "C" {
    pub fn logl(x: f64) -> f64;
}
extern "C" {
    pub fn log10(x: f64) -> f64;
}
extern "C" {
    pub fn log10f(x: f32) -> f32;
}
extern "C" {
    pub fn log10l(x: f64) -> f64;
}
extern "C" {
    pub fn log1p(x: f64) -> f64;
}
extern "C" {
    pub fn log1pf(x: f32) -> f32;
}
extern "C" {
    pub fn log1pl(x: f64) -> f64;
}
extern "C" {
    pub fn log2(x: f64) -> f64;
}
extern "C" {
    pub fn log2f(x: f32) -> f32;
}
extern "C" {
    pub fn log2l(x: f64) -> f64;
}
extern "C" {
    pub fn logb(x: f64) -> f64;
}
extern "C" {
    pub fn logbf(x: f32) -> f32;
}
extern "C" {
    pub fn logbl(x: f64) -> f64;
}
extern "C" {
    pub fn modf(value: f64, iptr: *mut f64) -> f64;
}
extern "C" {
    pub fn modff(value: f32, iptr: *mut f32) -> f32;
}
extern "C" {
    pub fn modfl(value: f64, iptr: *mut f64) -> f64;
}
extern "C" {
    pub fn scalbn(x: f64, n: libc::c_int) -> f64;
}
extern "C" {
    pub fn scalbnf(x: f32, n: libc::c_int) -> f32;
}
extern "C" {
    pub fn scalbnl(x: f64, n: libc::c_int) -> f64;
}
extern "C" {
    pub fn scalbln(x: f64, n: libc::c_long) -> f64;
}
extern "C" {
    pub fn scalblnf(x: f32, n: libc::c_long) -> f32;
}
extern "C" {
    pub fn scalblnl(x: f64, n: libc::c_long) -> f64;
}
extern "C" {
    pub fn cbrt(x: f64) -> f64;
}
extern "C" {
    pub fn cbrtf(x: f32) -> f32;
}
extern "C" {
    pub fn cbrtl(x: f64) -> f64;
}
extern "C" {
    pub fn fabs(x: f64) -> f64;
}
extern "C" {
    pub fn fabsf(x: f32) -> f32;
}
extern "C" {
    pub fn fabsl(x: f64) -> f64;
}
extern "C" {
    pub fn hypot(x: f64, y: f64) -> f64;
}
extern "C" {
    pub fn hypotf(x: f32, y: f32) -> f32;
}
extern "C" {
    pub fn hypotl(x: f64, y: f64) -> f64;
}
extern "C" {
    pub fn pow(x: f64, y: f64) -> f64;
}
extern "C" {
    pub fn powf(x: f32, y: f32) -> f32;
}
extern "C" {
    pub fn powl(x: f64, y: f64) -> f64;
}
extern "C" {
    pub fn sqrt(x: f64) -> f64;
}
extern "C" {
    pub fn sqrtf(x: f32) -> f32;
}
extern "C" {
    pub fn sqrtl(x: f64) -> f64;
}
extern "C" {
    pub fn erf(x: f64) -> f64;
}
extern "C" {
    pub fn erff(x: f32) -> f32;
}
extern "C" {
    pub fn erfl(x: f64) -> f64;
}
extern "C" {
    pub fn erfc(x: f64) -> f64;
}
extern "C" {
    pub fn erfcf(x: f32) -> f32;
}
extern "C" {
    pub fn erfcl(x: f64) -> f64;
}
extern "C" {
    pub fn lgamma(x: f64) -> f64;
}
extern "C" {
    pub fn lgammaf(x: f32) -> f32;
}
extern "C" {
    pub fn lgammal(x: f64) -> f64;
}
extern "C" {
    pub fn tgamma(x: f64) -> f64;
}
extern "C" {
    pub fn tgammaf(x: f32) -> f32;
}
extern "C" {
    pub fn tgammal(x: f64) -> f64;
}
extern "C" {
    pub fn ceil(x: f64) -> f64;
}
extern "C" {
    pub fn ceilf(x: f32) -> f32;
}
extern "C" {
    pub fn ceill(x: f64) -> f64;
}
extern "C" {
    pub fn floor(x: f64) -> f64;
}
extern "C" {
    pub fn floorf(x: f32) -> f32;
}
extern "C" {
    pub fn floorl(x: f64) -> f64;
}
extern "C" {
    pub fn nearbyint(x: f64) -> f64;
}
extern "C" {
    pub fn nearbyintf(x: f32) -> f32;
}
extern "C" {
    pub fn nearbyintl(x: f64) -> f64;
}
extern "C" {
    pub fn rint(x: f64) -> f64;
}
extern "C" {
    pub fn rintf(x: f32) -> f32;
}
extern "C" {
    pub fn rintl(x: f64) -> f64;
}
extern "C" {
    pub fn lrint(x: f64) -> libc::c_long;
}
extern "C" {
    pub fn lrintf(x: f32) -> libc::c_long;
}
extern "C" {
    pub fn lrintl(x: f64) -> libc::c_long;
}
extern "C" {
    pub fn llrint(x: f64) -> libc::c_longlong;
}
extern "C" {
    pub fn llrintf(x: f32) -> libc::c_longlong;
}
extern "C" {
    pub fn llrintl(x: f64) -> libc::c_longlong;
}
extern "C" {
    pub fn round(x: f64) -> f64;
}
extern "C" {
    pub fn roundf(x: f32) -> f32;
}
extern "C" {
    pub fn roundl(x: f64) -> f64;
}
extern "C" {
    pub fn lround(x: f64) -> libc::c_long;
}
extern "C" {
    pub fn lroundf(x: f32) -> libc::c_long;
}
extern "C" {
    pub fn lroundl(x: f64) -> libc::c_long;
}
extern "C" {
    pub fn llround(x: f64) -> libc::c_longlong;
}
extern "C" {
    pub fn llroundf(x: f32) -> libc::c_longlong;
}
extern "C" {
    pub fn llroundl(x: f64) -> libc::c_longlong;
}
extern "C" {
    pub fn trunc(x: f64) -> f64;
}
extern "C" {
    pub fn truncf(x: f32) -> f32;
}
extern "C" {
    pub fn truncl(x: f64) -> f64;
}
extern "C" {
    pub fn fmod(x: f64, y: f64) -> f64;
}
extern "C" {
    pub fn fmodf(x: f32, y: f32) -> f32;
}
extern "C" {
    pub fn fmodl(x: f64, y: f64) -> f64;
}
extern "C" {
    pub fn remainder(x: f64, y: f64) -> f64;
}
extern "C" {
    pub fn remainderf(x: f32, y: f32) -> f32;
}
extern "C" {
    pub fn remainderl(x: f64, y: f64) -> f64;
}
extern "C" {
    pub fn remquo(x: f64, y: f64, quo: *mut libc::c_int) -> f64;
}
extern "C" {
    pub fn remquof(x: f32, y: f32, quo: *mut libc::c_int) -> f32;
}
extern "C" {
    pub fn remquol(x: f64, y: f64, quo: *mut libc::c_int) -> f64;
}
extern "C" {
    pub fn copysign(x: f64, y: f64) -> f64;
}
extern "C" {
    pub fn copysignf(x: f32, y: f32) -> f32;
}
extern "C" {
    pub fn copysignl(x: f64, y: f64) -> f64;
}
extern "C" {
    pub fn nan(tagp: *const libc::c_char) -> f64;
}
extern "C" {
    pub fn nanf(tagp: *const libc::c_char) -> f32;
}
extern "C" {
    pub fn nanl(tagp: *const libc::c_char) -> f64;
}
extern "C" {
    pub fn nextafter(x: f64, y: f64) -> f64;
}
extern "C" {
    pub fn nextafterf(x: f32, y: f32) -> f32;
}
extern "C" {
    pub fn nextafterl(x: f64, y: f64) -> f64;
}
extern "C" {
    pub fn nexttoward(x: f64, y: f64) -> f64;
}
extern "C" {
    pub fn nexttowardf(x: f32, y: f64) -> f32;
}
extern "C" {
    pub fn nexttowardl(x: f64, y: f64) -> f64;
}
extern "C" {
    pub fn fdim(x: f64, y: f64) -> f64;
}
extern "C" {
    pub fn fdimf(x: f32, y: f32) -> f32;
}
extern "C" {
    pub fn fdiml(x: f64, y: f64) -> f64;
}
extern "C" {
    pub fn fmax(x: f64, y: f64) -> f64;
}
extern "C" {
    pub fn fmaxf(x: f32, y: f32) -> f32;
}
extern "C" {
    pub fn fmaxl(x: f64, y: f64) -> f64;
}
extern "C" {
    pub fn fmin(x: f64, y: f64) -> f64;
}
extern "C" {
    pub fn fminf(x: f32, y: f32) -> f32;
}
extern "C" {
    pub fn fminl(x: f64, y: f64) -> f64;
}
extern "C" {
    pub fn fma(x: f64, y: f64, z: f64) -> f64;
}
extern "C" {
    pub fn fmaf(x: f32, y: f32, z: f32) -> f32;
}
extern "C" {
    pub fn fmal(x: f64, y: f64, z: f64) -> f64;
}
pub const SDL_bool_SDL_FALSE: SDL_bool = 0;
pub const SDL_bool_SDL_TRUE: SDL_bool = 1;
pub type SDL_bool = libc::c_int;
pub type Sint8 = i8;
pub type Uint8 = u8;
pub type Sint16 = i16;
pub type Uint16 = u16;
pub type Sint32 = i32;
pub type Uint32 = u32;
pub type Sint64 = i64;
pub type Uint64 = u64;
pub type SDL_compile_time_assert_uint8 = [libc::c_int; 1usize];
pub type SDL_compile_time_assert_sint8 = [libc::c_int; 1usize];
pub type SDL_compile_time_assert_uint16 = [libc::c_int; 1usize];
pub type SDL_compile_time_assert_sint16 = [libc::c_int; 1usize];
pub type SDL_compile_time_assert_uint32 = [libc::c_int; 1usize];
pub type SDL_compile_time_assert_sint32 = [libc::c_int; 1usize];
pub type SDL_compile_time_assert_uint64 = [libc::c_int; 1usize];
pub type SDL_compile_time_assert_sint64 = [libc::c_int; 1usize];
pub const SDL_DUMMY_ENUM_DUMMY_ENUM_VALUE: SDL_DUMMY_ENUM = 0;
pub type SDL_DUMMY_ENUM = libc::c_int;
pub type SDL_compile_time_assert_enum = [libc::c_int; 1usize];
extern "C" {
    pub fn SDL_malloc(size: usize) -> *mut libc::c_void;
}
extern "C" {
    pub fn SDL_calloc(nmemb: usize, size: usize) -> *mut libc::c_void;
}
extern "C" {
    pub fn SDL_realloc(mem: *mut libc::c_void, size: usize) -> *mut libc::c_void;
}
extern "C" {
    pub fn SDL_free(mem: *mut libc::c_void);
}
pub type SDL_malloc_func =
    ::core::option::Option<unsafe extern "C" fn(size: usize) -> *mut libc::c_void>;
pub type SDL_calloc_func =
    ::core::option::Option<unsafe extern "C" fn(nmemb: usize, size: usize) -> *mut libc::c_void>;
pub type SDL_realloc_func = ::core::option::Option<
    unsafe extern "C" fn(mem: *mut libc::c_void, size: usize) -> *mut libc::c_void,
>;
pub type SDL_free_func = ::core::option::Option<unsafe extern "C" fn(mem: *mut libc::c_void)>;
extern "C" {
    #[doc = "  \\brief Get the current set of SDL memory functions"]
    pub fn SDL_GetMemoryFunctions(
        malloc_func: *mut SDL_malloc_func,
        calloc_func: *mut SDL_calloc_func,
        realloc_func: *mut SDL_realloc_func,
        free_func: *mut SDL_free_func,
    );
}
extern "C" {
    #[doc = "  \\brief Replace SDL's memory allocation functions with a custom set\n\n  \\note If you are replacing SDL's memory functions, you should call\n        SDL_GetNumAllocations() and be very careful if it returns non-zero.\n        That means that your free function will be called with memory\n        allocated by the previous memory allocation functions."]
    pub fn SDL_SetMemoryFunctions(
        malloc_func: SDL_malloc_func,
        calloc_func: SDL_calloc_func,
        realloc_func: SDL_realloc_func,
        free_func: SDL_free_func,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Get the number of outstanding (unfreed) allocations"]
    pub fn SDL_GetNumAllocations() -> libc::c_int;
}
extern "C" {
    pub fn SDL_getenv(name: *const libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn SDL_setenv(
        name: *const libc::c_char,
        value: *const libc::c_char,
        overwrite: libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    pub fn SDL_qsort(
        base: *mut libc::c_void,
        nmemb: usize,
        size: usize,
        compare: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *const libc::c_void,
                arg2: *const libc::c_void,
            ) -> libc::c_int,
        >,
    );
}
extern "C" {
    pub fn SDL_abs(x: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn SDL_isdigit(x: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn SDL_isspace(x: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn SDL_toupper(x: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn SDL_tolower(x: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn SDL_memset(dst: *mut libc::c_void, c: libc::c_int, len: usize) -> *mut libc::c_void;
}
extern "C" {
    pub fn SDL_memcpy(
        dst: *mut libc::c_void,
        src: *const libc::c_void,
        len: usize,
    ) -> *mut libc::c_void;
}
extern "C" {
    pub fn SDL_memmove(
        dst: *mut libc::c_void,
        src: *const libc::c_void,
        len: usize,
    ) -> *mut libc::c_void;
}
extern "C" {
    pub fn SDL_memcmp(s1: *const libc::c_void, s2: *const libc::c_void, len: usize) -> libc::c_int;
}
extern "C" {
    pub fn SDL_wcsdup(wstr: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn SDL_wcslen(wstr: *const wchar_t) -> usize;
}
extern "C" {
    pub fn SDL_wcslcpy(dst: *mut wchar_t, src: *const wchar_t, maxlen: usize) -> usize;
}
extern "C" {
    pub fn SDL_wcslcat(dst: *mut wchar_t, src: *const wchar_t, maxlen: usize) -> usize;
}
extern "C" {
    pub fn SDL_wcscmp(str1: *const wchar_t, str2: *const wchar_t) -> libc::c_int;
}
extern "C" {
    pub fn SDL_strlen(str_: *const libc::c_char) -> usize;
}
extern "C" {
    pub fn SDL_strlcpy(dst: *mut libc::c_char, src: *const libc::c_char, maxlen: usize) -> usize;
}
extern "C" {
    pub fn SDL_utf8strlcpy(
        dst: *mut libc::c_char,
        src: *const libc::c_char,
        dst_bytes: usize,
    ) -> usize;
}
extern "C" {
    pub fn SDL_strlcat(dst: *mut libc::c_char, src: *const libc::c_char, maxlen: usize) -> usize;
}
extern "C" {
    pub fn SDL_strdup(str_: *const libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn SDL_strrev(str_: *mut libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn SDL_strupr(str_: *mut libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn SDL_strlwr(str_: *mut libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn SDL_strchr(str_: *const libc::c_char, c: libc::c_int) -> *mut libc::c_char;
}
extern "C" {
    pub fn SDL_strrchr(str_: *const libc::c_char, c: libc::c_int) -> *mut libc::c_char;
}
extern "C" {
    pub fn SDL_strstr(
        haystack: *const libc::c_char,
        needle: *const libc::c_char,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn SDL_utf8strlen(str_: *const libc::c_char) -> usize;
}
extern "C" {
    pub fn SDL_itoa(
        value: libc::c_int,
        str_: *mut libc::c_char,
        radix: libc::c_int,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn SDL_uitoa(
        value: libc::c_uint,
        str_: *mut libc::c_char,
        radix: libc::c_int,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn SDL_ltoa(
        value: libc::c_long,
        str_: *mut libc::c_char,
        radix: libc::c_int,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn SDL_ultoa(
        value: libc::c_ulong,
        str_: *mut libc::c_char,
        radix: libc::c_int,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn SDL_lltoa(
        value: Sint64,
        str_: *mut libc::c_char,
        radix: libc::c_int,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn SDL_ulltoa(
        value: Uint64,
        str_: *mut libc::c_char,
        radix: libc::c_int,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn SDL_atoi(str_: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn SDL_atof(str_: *const libc::c_char) -> f64;
}
extern "C" {
    pub fn SDL_strtol(
        str_: *const libc::c_char,
        endp: *mut *mut libc::c_char,
        base: libc::c_int,
    ) -> libc::c_long;
}
extern "C" {
    pub fn SDL_strtoul(
        str_: *const libc::c_char,
        endp: *mut *mut libc::c_char,
        base: libc::c_int,
    ) -> libc::c_ulong;
}
extern "C" {
    pub fn SDL_strtoll(
        str_: *const libc::c_char,
        endp: *mut *mut libc::c_char,
        base: libc::c_int,
    ) -> Sint64;
}
extern "C" {
    pub fn SDL_strtoull(
        str_: *const libc::c_char,
        endp: *mut *mut libc::c_char,
        base: libc::c_int,
    ) -> Uint64;
}
extern "C" {
    pub fn SDL_strtod(str_: *const libc::c_char, endp: *mut *mut libc::c_char) -> f64;
}
extern "C" {
    pub fn SDL_strcmp(str1: *const libc::c_char, str2: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn SDL_strncmp(
        str1: *const libc::c_char,
        str2: *const libc::c_char,
        maxlen: usize,
    ) -> libc::c_int;
}
extern "C" {
    pub fn SDL_strcasecmp(str1: *const libc::c_char, str2: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn SDL_strncasecmp(
        str1: *const libc::c_char,
        str2: *const libc::c_char,
        len: usize,
    ) -> libc::c_int;
}
extern "C" {
    pub fn SDL_sscanf(text: *const libc::c_char, fmt: *const libc::c_char, ...) -> libc::c_int;
}
extern "C" {
    pub fn SDL_vsscanf(
        text: *const libc::c_char,
        fmt: *const libc::c_char,
        ap: va_list,
    ) -> libc::c_int;
}
extern "C" {
    pub fn SDL_snprintf(
        text: *mut libc::c_char,
        maxlen: usize,
        fmt: *const libc::c_char,
        ...
    ) -> libc::c_int;
}
extern "C" {
    pub fn SDL_vsnprintf(
        text: *mut libc::c_char,
        maxlen: usize,
        fmt: *const libc::c_char,
        ap: va_list,
    ) -> libc::c_int;
}
extern "C" {
    pub fn SDL_acos(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_acosf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_asin(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_asinf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_atan(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_atanf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_atan2(x: f64, y: f64) -> f64;
}
extern "C" {
    pub fn SDL_atan2f(x: f32, y: f32) -> f32;
}
extern "C" {
    pub fn SDL_ceil(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_ceilf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_copysign(x: f64, y: f64) -> f64;
}
extern "C" {
    pub fn SDL_copysignf(x: f32, y: f32) -> f32;
}
extern "C" {
    pub fn SDL_cos(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_cosf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_exp(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_expf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_fabs(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_fabsf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_floor(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_floorf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_fmod(x: f64, y: f64) -> f64;
}
extern "C" {
    pub fn SDL_fmodf(x: f32, y: f32) -> f32;
}
extern "C" {
    pub fn SDL_log(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_logf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_log10(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_log10f(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_pow(x: f64, y: f64) -> f64;
}
extern "C" {
    pub fn SDL_powf(x: f32, y: f32) -> f32;
}
extern "C" {
    pub fn SDL_scalbn(x: f64, n: libc::c_int) -> f64;
}
extern "C" {
    pub fn SDL_scalbnf(x: f32, n: libc::c_int) -> f32;
}
extern "C" {
    pub fn SDL_sin(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_sinf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_sqrt(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_sqrtf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_tan(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_tanf(x: f32) -> f32;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SDL_iconv_t {
    _unused: [u8; 0],
}
pub type SDL_iconv_t = *mut _SDL_iconv_t;
extern "C" {
    pub fn SDL_iconv_open(
        tocode: *const libc::c_char,
        fromcode: *const libc::c_char,
    ) -> SDL_iconv_t;
}
extern "C" {
    pub fn SDL_iconv_close(cd: SDL_iconv_t) -> libc::c_int;
}
extern "C" {
    pub fn SDL_iconv(
        cd: SDL_iconv_t,
        inbuf: *mut *const libc::c_char,
        inbytesleft: *mut usize,
        outbuf: *mut *mut libc::c_char,
        outbytesleft: *mut usize,
    ) -> usize;
}
extern "C" {
    #[doc = "  This function converts a string between encodings in one pass, returning a\n  string that must be freed with SDL_free() or NULL on error."]
    pub fn SDL_iconv_string(
        tocode: *const libc::c_char,
        fromcode: *const libc::c_char,
        inbuf: *const libc::c_char,
        inbytesleft: usize,
    ) -> *mut libc::c_char;
}
#[doc = "  The prototype for the application's main() function"]
pub type SDL_main_func = ::core::option::Option<
    unsafe extern "C" fn(argc: libc::c_int, argv: *mut *mut libc::c_char) -> libc::c_int,
>;
extern "C" {
    pub fn SDL_main(argc: libc::c_int, argv: *mut *mut libc::c_char) -> libc::c_int;
}
extern "C" {
    #[doc = "  This is called by the real SDL main function to let the rest of the\n  library know that initialization was done properly.\n\n  Calling this yourself without knowing what you're doing can cause\n  crashes and hard to diagnose problems with your application."]
    pub fn SDL_SetMainReady();
}
extern "C" {
    #[doc = "  This can be called to set the application class at startup"]
    pub fn SDL_RegisterApp(
        name: *mut libc::c_char,
        style: Uint32,
        hInst: *mut libc::c_void,
    ) -> libc::c_int;
}
extern "C" {
    pub fn SDL_UnregisterApp();
}
extern "C" {
    pub fn __debugbreak();
}
#[doc = "< Retry the assert immediately."]
pub const SDL_AssertState_SDL_ASSERTION_RETRY: SDL_AssertState = 0;
#[doc = "< Make the debugger trigger a breakpoint."]
pub const SDL_AssertState_SDL_ASSERTION_BREAK: SDL_AssertState = 1;
#[doc = "< Terminate the program."]
pub const SDL_AssertState_SDL_ASSERTION_ABORT: SDL_AssertState = 2;
#[doc = "< Ignore the assert."]
pub const SDL_AssertState_SDL_ASSERTION_IGNORE: SDL_AssertState = 3;
#[doc = "< Ignore the assert from now on."]
pub const SDL_AssertState_SDL_ASSERTION_ALWAYS_IGNORE: SDL_AssertState = 4;
pub type SDL_AssertState = libc::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_AssertData {
    pub always_ignore: libc::c_int,
    pub trigger_count: libc::c_uint,
    pub condition: *const libc::c_char,
    pub filename: *const libc::c_char,
    pub linenum: libc::c_int,
    pub function: *const libc::c_char,
    pub next: *const SDL_AssertData,
}
#[test]
fn bindgen_test_layout_SDL_AssertData() {
    const UNINIT: ::core::mem::MaybeUninit<SDL_AssertData> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<SDL_AssertData>(),
        28usize,
        concat!("Size of: ", stringify!(SDL_AssertData))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_AssertData>(),
        4usize,
        concat!("Alignment of ", stringify!(SDL_AssertData))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).always_ignore) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AssertData),
            "::",
            stringify!(always_ignore)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).trigger_count) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AssertData),
            "::",
            stringify!(trigger_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).condition) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AssertData),
            "::",
            stringify!(condition)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).filename) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AssertData),
            "::",
            stringify!(filename)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).linenum) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AssertData),
            "::",
            stringify!(linenum)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).function) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AssertData),
            "::",
            stringify!(function)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AssertData),
            "::",
            stringify!(next)
        )
    );
}
extern "C" {
    pub fn SDL_ReportAssertion(
        arg1: *mut SDL_AssertData,
        arg2: *const libc::c_char,
        arg3: *const libc::c_char,
        arg4: libc::c_int,
    ) -> SDL_AssertState;
}
pub type SDL_AssertionHandler = ::core::option::Option<
    unsafe extern "C" fn(
        data: *const SDL_AssertData,
        userdata: *mut libc::c_void,
    ) -> SDL_AssertState,
>;
extern "C" {
    #[doc = "  \\brief Set an application-defined assertion handler.\n\n  This allows an app to show its own assertion UI and/or force the\n  response to an assertion failure. If the app doesn't provide this, SDL\n  will try to do the right thing, popping up a system-specific GUI dialog,\n  and probably minimizing any fullscreen windows.\n\n  This callback may fire from any thread, but it runs wrapped in a mutex, so\n  it will only fire from one thread at a time.\n\n  Setting the callback to NULL restores SDL's original internal handler.\n\n  This callback is NOT reset to SDL's internal handler upon SDL_Quit()!\n\n  Return SDL_AssertState value of how to handle the assertion failure.\n\n  \\param handler Callback function, called when an assertion fails.\n  \\param userdata A pointer passed to the callback as-is."]
    pub fn SDL_SetAssertionHandler(handler: SDL_AssertionHandler, userdata: *mut libc::c_void);
}
extern "C" {
    #[doc = "  \\brief Get the default assertion handler.\n\n  This returns the function pointer that is called by default when an\n   assertion is triggered. This is an internal function provided by SDL,\n   that is used for assertions when SDL_SetAssertionHandler() hasn't been\n   used to provide a different function.\n\n  \\return The default SDL_AssertionHandler that is called when an assert triggers."]
    pub fn SDL_GetDefaultAssertionHandler() -> SDL_AssertionHandler;
}
extern "C" {
    #[doc = "  \\brief Get the current assertion handler.\n\n  This returns the function pointer that is called when an assertion is\n   triggered. This is either the value last passed to\n   SDL_SetAssertionHandler(), or if no application-specified function is\n   set, is equivalent to calling SDL_GetDefaultAssertionHandler().\n\n   \\param puserdata Pointer to a void*, which will store the \"userdata\"\n                    pointer that was passed to SDL_SetAssertionHandler().\n                    This value will always be NULL for the default handler.\n                    If you don't care about this data, it is safe to pass\n                    a NULL pointer to this function to ignore it.\n  \\return The SDL_AssertionHandler that is called when an assert triggers."]
    pub fn SDL_GetAssertionHandler(puserdata: *mut *mut libc::c_void) -> SDL_AssertionHandler;
}
extern "C" {
    #[doc = "  \\brief Get a list of all assertion failures.\n\n  Get all assertions triggered since last call to SDL_ResetAssertionReport(),\n  or the start of the program.\n\n  The proper way to examine this data looks something like this:\n\n  <code>\n  const SDL_AssertData *item = SDL_GetAssertionReport();\n  while (item) {\n      printf(\"'%s', %s (%s:%d), triggered %u times, always ignore: %s.\\\\n\",\n             item->condition, item->function, item->filename,\n             item->linenum, item->trigger_count,\n             item->always_ignore ? \"yes\" : \"no\");\n      item = item->next;\n  }\n  </code>\n\n  \\return List of all assertions.\n  \\sa SDL_ResetAssertionReport"]
    pub fn SDL_GetAssertionReport() -> *const SDL_AssertData;
}
extern "C" {
    #[doc = "  \\brief Reset the list of all assertion failures.\n\n  Reset list of all assertions triggered.\n\n  \\sa SDL_GetAssertionReport"]
    pub fn SDL_ResetAssertionReport();
}
pub type SDL_SpinLock = libc::c_int;
extern "C" {
    #[doc = " \\brief Try to lock a spin lock by setting it to a non-zero value.\n\n \\param lock Points to the lock.\n\n \\return SDL_TRUE if the lock succeeded, SDL_FALSE if the lock is already held."]
    pub fn SDL_AtomicTryLock(lock: *mut SDL_SpinLock) -> SDL_bool;
}
extern "C" {
    #[doc = " \\brief Lock a spin lock by setting it to a non-zero value.\n\n \\param lock Points to the lock."]
    pub fn SDL_AtomicLock(lock: *mut SDL_SpinLock);
}
extern "C" {
    #[doc = " \\brief Unlock a spin lock by setting it to 0. Always returns immediately\n\n \\param lock Points to the lock."]
    pub fn SDL_AtomicUnlock(lock: *mut SDL_SpinLock);
}
extern "C" {
    #[doc = " Memory barriers are designed to prevent reads and writes from being\n reordered by the compiler and being seen out of order on multi-core CPUs.\n\n A typical pattern would be for thread A to write some data and a flag,\n and for thread B to read the flag and get the data. In this case you\n would insert a release barrier between writing the data and the flag,\n guaranteeing that the data write completes no later than the flag is\n written, and you would insert an acquire barrier between reading the\n flag and reading the data, to ensure that all the reads associated\n with the flag have completed.\n\n In this pattern you should always see a release barrier paired with\n an acquire barrier and you should gate the data reads/writes with a\n single flag variable.\n\n For more information on these semantics, take a look at the blog post:\n http://preshing.com/20120913/acquire-and-release-semantics"]
    pub fn SDL_MemoryBarrierReleaseFunction();
}
extern "C" {
    pub fn SDL_MemoryBarrierAcquireFunction();
}
#[doc = " \\brief A type representing an atomic integer value.  It is a struct\n        so people don't accidentally use numeric operations on it."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_atomic_t {
    pub value: libc::c_int,
}
#[test]
fn bindgen_test_layout_SDL_atomic_t() {
    const UNINIT: ::core::mem::MaybeUninit<SDL_atomic_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<SDL_atomic_t>(),
        4usize,
        concat!("Size of: ", stringify!(SDL_atomic_t))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_atomic_t>(),
        4usize,
        concat!("Alignment of ", stringify!(SDL_atomic_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_atomic_t),
            "::",
            stringify!(value)
        )
    );
}
extern "C" {
    #[doc = " \\brief Set an atomic variable to a new value if it is currently an old value.\n\n \\return SDL_TRUE if the atomic variable was set, SDL_FALSE otherwise.\n\n \\note If you don't know what this function is for, you shouldn't use it!"]
    pub fn SDL_AtomicCAS(
        a: *mut SDL_atomic_t,
        oldval: libc::c_int,
        newval: libc::c_int,
    ) -> SDL_bool;
}
extern "C" {
    #[doc = " \\brief Set an atomic variable to a value.\n\n \\return The previous value of the atomic variable."]
    pub fn SDL_AtomicSet(a: *mut SDL_atomic_t, v: libc::c_int) -> libc::c_int;
}
extern "C" {
    #[doc = " \\brief Get the value of an atomic variable"]
    pub fn SDL_AtomicGet(a: *mut SDL_atomic_t) -> libc::c_int;
}
extern "C" {
    #[doc = " \\brief Add to an atomic variable.\n\n \\return The previous value of the atomic variable.\n\n \\note This same style can be used for any number operation"]
    pub fn SDL_AtomicAdd(a: *mut SDL_atomic_t, v: libc::c_int) -> libc::c_int;
}
extern "C" {
    #[doc = " \\brief Set a pointer to a new value if it is currently an old value.\n\n \\return SDL_TRUE if the pointer was set, SDL_FALSE otherwise.\n\n \\note If you don't know what this function is for, you shouldn't use it!"]
    pub fn SDL_AtomicCASPtr(
        a: *mut *mut libc::c_void,
        oldval: *mut libc::c_void,
        newval: *mut libc::c_void,
    ) -> SDL_bool;
}
extern "C" {
    #[doc = " \\brief Set a pointer to a value atomically.\n\n \\return The previous value of the pointer."]
    pub fn SDL_AtomicSetPtr(a: *mut *mut libc::c_void, v: *mut libc::c_void) -> *mut libc::c_void;
}
extern "C" {
    #[doc = " \\brief Get the value of a pointer atomically."]
    pub fn SDL_AtomicGetPtr(a: *mut *mut libc::c_void) -> *mut libc::c_void;
}
extern "C" {
    pub fn SDL_SetError(fmt: *const libc::c_char, ...) -> libc::c_int;
}
extern "C" {
    pub fn SDL_GetError() -> *const libc::c_char;
}
extern "C" {
    pub fn SDL_ClearError();
}
pub const SDL_errorcode_SDL_ENOMEM: SDL_errorcode = 0;
pub const SDL_errorcode_SDL_EFREAD: SDL_errorcode = 1;
pub const SDL_errorcode_SDL_EFWRITE: SDL_errorcode = 2;
pub const SDL_errorcode_SDL_EFSEEK: SDL_errorcode = 3;
pub const SDL_errorcode_SDL_UNSUPPORTED: SDL_errorcode = 4;
pub const SDL_errorcode_SDL_LASTERROR: SDL_errorcode = 5;
pub type SDL_errorcode = libc::c_int;
extern "C" {
    pub fn SDL_Error(code: SDL_errorcode) -> libc::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_mutex {
    _unused: [u8; 0],
}
extern "C" {
    #[doc = "  Create a mutex, initialized unlocked."]
    pub fn SDL_CreateMutex() -> *mut SDL_mutex;
}
extern "C" {
    pub fn SDL_LockMutex(mutex: *mut SDL_mutex) -> libc::c_int;
}
extern "C" {
    #[doc = "  Try to lock the mutex\n\n  \\return 0, SDL_MUTEX_TIMEDOUT, or -1 on error"]
    pub fn SDL_TryLockMutex(mutex: *mut SDL_mutex) -> libc::c_int;
}
extern "C" {
    pub fn SDL_UnlockMutex(mutex: *mut SDL_mutex) -> libc::c_int;
}
extern "C" {
    #[doc = "  Destroy a mutex."]
    pub fn SDL_DestroyMutex(mutex: *mut SDL_mutex);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_semaphore {
    _unused: [u8; 0],
}
pub type SDL_sem = SDL_semaphore;
extern "C" {
    #[doc = "  Create a semaphore, initialized with value, returns NULL on failure."]
    pub fn SDL_CreateSemaphore(initial_value: Uint32) -> *mut SDL_sem;
}
extern "C" {
    #[doc = "  Destroy a semaphore."]
    pub fn SDL_DestroySemaphore(sem: *mut SDL_sem);
}
extern "C" {
    #[doc = "  This function suspends the calling thread until the semaphore pointed\n  to by \\c sem has a positive count. It then atomically decreases the\n  semaphore count."]
    pub fn SDL_SemWait(sem: *mut SDL_sem) -> libc::c_int;
}
extern "C" {
    #[doc = "  Non-blocking variant of SDL_SemWait().\n\n  \\return 0 if the wait succeeds, ::SDL_MUTEX_TIMEDOUT if the wait would\n          block, and -1 on error."]
    pub fn SDL_SemTryWait(sem: *mut SDL_sem) -> libc::c_int;
}
extern "C" {
    #[doc = "  Variant of SDL_SemWait() with a timeout in milliseconds.\n\n  \\return 0 if the wait succeeds, ::SDL_MUTEX_TIMEDOUT if the wait does not\n          succeed in the allotted time, and -1 on error.\n\n  \\warning On some platforms this function is implemented by looping with a\n           delay of 1 ms, and so should be avoided if possible."]
    pub fn SDL_SemWaitTimeout(sem: *mut SDL_sem, ms: Uint32) -> libc::c_int;
}
extern "C" {
    #[doc = "  Atomically increases the semaphore's count (not blocking).\n\n  \\return 0, or -1 on error."]
    pub fn SDL_SemPost(sem: *mut SDL_sem) -> libc::c_int;
}
extern "C" {
    #[doc = "  Returns the current count of the semaphore."]
    pub fn SDL_SemValue(sem: *mut SDL_sem) -> Uint32;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_cond {
    _unused: [u8; 0],
}
extern "C" {
    #[doc = "  Create a condition variable.\n\n  Typical use of condition variables:\n\n  Thread A:\n    SDL_LockMutex(lock);\n    while ( ! condition ) {\n        SDL_CondWait(cond, lock);\n    }\n    SDL_UnlockMutex(lock);\n\n  Thread B:\n    SDL_LockMutex(lock);\n    ...\n    condition = true;\n    ...\n    SDL_CondSignal(cond);\n    SDL_UnlockMutex(lock);\n\n  There is some discussion whether to signal the condition variable\n  with the mutex locked or not.  There is some potential performance\n  benefit to unlocking first on some platforms, but there are some\n  potential race conditions depending on how your code is structured.\n\n  In general it's safer to signal the condition variable while the\n  mutex is locked."]
    pub fn SDL_CreateCond() -> *mut SDL_cond;
}
extern "C" {
    #[doc = "  Destroy a condition variable."]
    pub fn SDL_DestroyCond(cond: *mut SDL_cond);
}
extern "C" {
    #[doc = "  Restart one of the threads that are waiting on the condition variable.\n\n  \\return 0 or -1 on error."]
    pub fn SDL_CondSignal(cond: *mut SDL_cond) -> libc::c_int;
}
extern "C" {
    #[doc = "  Restart all threads that are waiting on the condition variable.\n\n  \\return 0 or -1 on error."]
    pub fn SDL_CondBroadcast(cond: *mut SDL_cond) -> libc::c_int;
}
extern "C" {
    #[doc = "  Wait on the condition variable, unlocking the provided mutex.\n\n  \\warning The mutex must be locked before entering this function!\n\n  The mutex is re-locked once the condition variable is signaled.\n\n  \\return 0 when it is signaled, or -1 on error."]
    pub fn SDL_CondWait(cond: *mut SDL_cond, mutex: *mut SDL_mutex) -> libc::c_int;
}
extern "C" {
    #[doc = "  Waits for at most \\c ms milliseconds, and returns 0 if the condition\n  variable is signaled, ::SDL_MUTEX_TIMEDOUT if the condition is not\n  signaled in the allotted time, and -1 on error.\n\n  \\warning On some platforms this function is implemented by looping with a\n           delay of 1 ms, and so should be avoided if possible."]
    pub fn SDL_CondWaitTimeout(
        cond: *mut SDL_cond,
        mutex: *mut SDL_mutex,
        ms: Uint32,
    ) -> libc::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_Thread {
    _unused: [u8; 0],
}
pub type SDL_threadID = libc::c_ulong;
pub type SDL_TLSID = libc::c_uint;
pub const SDL_ThreadPriority_SDL_THREAD_PRIORITY_LOW: SDL_ThreadPriority = 0;
pub const SDL_ThreadPriority_SDL_THREAD_PRIORITY_NORMAL: SDL_ThreadPriority = 1;
pub const SDL_ThreadPriority_SDL_THREAD_PRIORITY_HIGH: SDL_ThreadPriority = 2;
pub const SDL_ThreadPriority_SDL_THREAD_PRIORITY_TIME_CRITICAL: SDL_ThreadPriority = 3;
#[doc = "  The SDL thread priority.\n\n  \\note On many systems you require special privileges to set high or time critical priority."]
pub type SDL_ThreadPriority = libc::c_int;
#[doc = "  The function passed to SDL_CreateThread().\n  It is passed a void* user context parameter and returns an int."]
pub type SDL_ThreadFunction =
    ::core::option::Option<unsafe extern "C" fn(data: *mut libc::c_void) -> libc::c_int>;
extern "C" {
    #[doc = "  Create a thread with a default stack size.\n\n  This is equivalent to calling:\n  SDL_CreateThreadWithStackSize(fn, name, 0, data);"]
    pub fn SDL_CreateThread(
        fn_: SDL_ThreadFunction,
        name: *const libc::c_char,
        data: *mut libc::c_void,
    ) -> *mut SDL_Thread;
}
extern "C" {
    #[doc = "  Create a thread.\n\n   Thread naming is a little complicated: Most systems have very small\n    limits for the string length (Haiku has 32 bytes, Linux currently has 16,\n    Visual C++ 6.0 has nine!), and possibly other arbitrary rules. You'll\n    have to see what happens with your system's debugger. The name should be\n    UTF-8 (but using the naming limits of C identifiers is a better bet).\n   There are no requirements for thread naming conventions, so long as the\n    string is null-terminated UTF-8, but these guidelines are helpful in\n    choosing a name:\n\n    http://stackoverflow.com/questions/149932/naming-conventions-for-threads\n\n   If a system imposes requirements, SDL will try to munge the string for\n    it (truncate, etc), but the original string contents will be available\n    from SDL_GetThreadName().\n\n   The size (in bytes) of the new stack can be specified. Zero means \"use\n    the system default\" which might be wildly different between platforms\n    (x86 Linux generally defaults to eight megabytes, an embedded device\n    might be a few kilobytes instead).\n\n   In SDL 2.1, stacksize will be folded into the original SDL_CreateThread\n    function."]
    pub fn SDL_CreateThreadWithStackSize(
        fn_: SDL_ThreadFunction,
        name: *const libc::c_char,
        stacksize: usize,
        data: *mut libc::c_void,
    ) -> *mut SDL_Thread;
}
extern "C" {
    #[doc = " Get the thread name, as it was specified in SDL_CreateThread().\n  This function returns a pointer to a UTF-8 string that names the\n  specified thread, or NULL if it doesn't have a name. This is internal\n  memory, not to be free()'d by the caller, and remains valid until the\n  specified thread is cleaned up by SDL_WaitThread()."]
    pub fn SDL_GetThreadName(thread: *mut SDL_Thread) -> *const libc::c_char;
}
extern "C" {
    #[doc = "  Get the thread identifier for the current thread."]
    pub fn SDL_ThreadID() -> SDL_threadID;
}
extern "C" {
    #[doc = "  Get the thread identifier for the specified thread.\n\n  Equivalent to SDL_ThreadID() if the specified thread is NULL."]
    pub fn SDL_GetThreadID(thread: *mut SDL_Thread) -> SDL_threadID;
}
extern "C" {
    #[doc = "  Set the priority for the current thread"]
    pub fn SDL_SetThreadPriority(priority: SDL_ThreadPriority) -> libc::c_int;
}
extern "C" {
    #[doc = "  Wait for a thread to finish. Threads that haven't been detached will\n  remain (as a \"zombie\") until this function cleans them up. Not doing so\n  is a resource leak.\n\n  Once a thread has been cleaned up through this function, the SDL_Thread\n  that references it becomes invalid and should not be referenced again.\n  As such, only one thread may call SDL_WaitThread() on another.\n\n  The return code for the thread function is placed in the area\n  pointed to by \\c status, if \\c status is not NULL.\n\n  You may not wait on a thread that has been used in a call to\n  SDL_DetachThread(). Use either that function or this one, but not\n  both, or behavior is undefined.\n\n  It is safe to pass NULL to this function; it is a no-op."]
    pub fn SDL_WaitThread(thread: *mut SDL_Thread, status: *mut libc::c_int);
}
extern "C" {
    #[doc = "  A thread may be \"detached\" to signify that it should not remain until\n  another thread has called SDL_WaitThread() on it. Detaching a thread\n  is useful for long-running threads that nothing needs to synchronize\n  with or further manage. When a detached thread is done, it simply\n  goes away.\n\n  There is no way to recover the return code of a detached thread. If you\n  need this, don't detach the thread and instead use SDL_WaitThread().\n\n  Once a thread is detached, you should usually assume the SDL_Thread isn't\n  safe to reference again, as it will become invalid immediately upon\n  the detached thread's exit, instead of remaining until someone has called\n  SDL_WaitThread() to finally clean it up. As such, don't detach the same\n  thread more than once.\n\n  If a thread has already exited when passed to SDL_DetachThread(), it will\n  stop waiting for a call to SDL_WaitThread() and clean up immediately.\n  It is not safe to detach a thread that might be used with SDL_WaitThread().\n\n  You may not call SDL_WaitThread() on a thread that has been detached.\n  Use either that function or this one, but not both, or behavior is\n  undefined.\n\n  It is safe to pass NULL to this function; it is a no-op."]
    pub fn SDL_DetachThread(thread: *mut SDL_Thread);
}
extern "C" {
    #[doc = "  \\brief Create an identifier that is globally visible to all threads but refers to data that is thread-specific.\n\n  \\return The newly created thread local storage identifier, or 0 on error\n\n  \\code\n  static SDL_SpinLock tls_lock;\n  static SDL_TLSID thread_local_storage;\n\n  void SetMyThreadData(void *value)\n  {\n      if (!thread_local_storage) {\n          SDL_AtomicLock(&tls_lock);\n          if (!thread_local_storage) {\n              thread_local_storage = SDL_TLSCreate();\n          }\n          SDL_AtomicUnlock(&tls_lock);\n      }\n      SDL_TLSSet(thread_local_storage, value, 0);\n  }\n\n  void *GetMyThreadData(void)\n  {\n      return SDL_TLSGet(thread_local_storage);\n  }\n  \\endcode\n\n  \\sa SDL_TLSGet()\n  \\sa SDL_TLSSet()"]
    pub fn SDL_TLSCreate() -> SDL_TLSID;
}
extern "C" {
    #[doc = "  \\brief Get the value associated with a thread local storage ID for the current thread.\n\n  \\param id The thread local storage ID\n\n  \\return The value associated with the ID for the current thread, or NULL if no value has been set.\n\n  \\sa SDL_TLSCreate()\n  \\sa SDL_TLSSet()"]
    pub fn SDL_TLSGet(id: SDL_TLSID) -> *mut libc::c_void;
}
extern "C" {
    #[doc = "  \\brief Set the value associated with a thread local storage ID for the current thread.\n\n  \\param id The thread local storage ID\n  \\param value The value to associate with the ID for the current thread\n  \\param destructor A function called when the thread exits, to free the value.\n\n  \\return 0 on success, -1 on error\n\n  \\sa SDL_TLSCreate()\n  \\sa SDL_TLSGet()"]
    pub fn SDL_TLSSet(
        id: SDL_TLSID,
        value: *const libc::c_void,
        destructor: ::core::option::Option<unsafe extern "C" fn(arg1: *mut libc::c_void)>,
    ) -> libc::c_int;
}
#[doc = " This is the read/write operation structure -- very basic."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_RWops {
    #[doc = "  Return the size of the file in this rwops, or -1 if unknown"]
    pub size: ::core::option::Option<unsafe extern "C" fn(context: *mut SDL_RWops) -> Sint64>,
    #[doc = "  Seek to \\c offset relative to \\c whence, one of stdio's whence values:\n  RW_SEEK_SET, RW_SEEK_CUR, RW_SEEK_END\n\n  \\return the final offset in the data stream, or -1 on error."]
    pub seek: ::core::option::Option<
        unsafe extern "C" fn(
            context: *mut SDL_RWops,
            offset: Sint64,
            whence: libc::c_int,
        ) -> Sint64,
    >,
    #[doc = "  Read up to \\c maxnum objects each of size \\c size from the data\n  stream to the area pointed at by \\c ptr.\n\n  \\return the number of objects read, or 0 at error or end of file."]
    pub read: ::core::option::Option<
        unsafe extern "C" fn(
            context: *mut SDL_RWops,
            ptr: *mut libc::c_void,
            size: usize,
            maxnum: usize,
        ) -> usize,
    >,
    #[doc = "  Write exactly \\c num objects each of size \\c size from the area\n  pointed at by \\c ptr to data stream.\n\n  \\return the number of objects written, or 0 at error or end of file."]
    pub write: ::core::option::Option<
        unsafe extern "C" fn(
            context: *mut SDL_RWops,
            ptr: *const libc::c_void,
            size: usize,
            num: usize,
        ) -> usize,
    >,
    #[doc = "  Close and free an allocated SDL_RWops structure.\n\n  \\return 0 if successful or -1 on write error when flushing data."]
    pub close: ::core::option::Option<unsafe extern "C" fn(context: *mut SDL_RWops) -> libc::c_int>,
    pub type_: Uint32,
    pub hidden: SDL_RWops__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union SDL_RWops__bindgen_ty_1 {
    pub windowsio: SDL_RWops__bindgen_ty_1__bindgen_ty_1,
    pub stdio: SDL_RWops__bindgen_ty_1__bindgen_ty_2,
    pub mem: SDL_RWops__bindgen_ty_1__bindgen_ty_3,
    pub unknown: SDL_RWops__bindgen_ty_1__bindgen_ty_4,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_RWops__bindgen_ty_1__bindgen_ty_1 {
    pub append: SDL_bool,
    pub h: *mut libc::c_void,
    pub buffer: SDL_RWops__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_RWops__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1 {
    pub data: *mut libc::c_void,
    pub size: usize,
    pub left: usize,
}
#[test]
fn bindgen_test_layout_SDL_RWops__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<SDL_RWops__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<SDL_RWops__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1>(),
        12usize,
        concat!(
            "Size of: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_RWops__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).left) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(left)
        )
    );
}
#[test]
fn bindgen_test_layout_SDL_RWops__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<SDL_RWops__bindgen_ty_1__bindgen_ty_1> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<SDL_RWops__bindgen_ty_1__bindgen_ty_1>(),
        20usize,
        concat!(
            "Size of: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_RWops__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).append) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(append)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).h) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(h)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).buffer) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(buffer)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_RWops__bindgen_ty_1__bindgen_ty_2 {
    pub autoclose: SDL_bool,
    pub fp: *mut FILE,
}
#[test]
fn bindgen_test_layout_SDL_RWops__bindgen_ty_1__bindgen_ty_2() {
    const UNINIT: ::core::mem::MaybeUninit<SDL_RWops__bindgen_ty_1__bindgen_ty_2> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<SDL_RWops__bindgen_ty_1__bindgen_ty_2>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_RWops__bindgen_ty_1__bindgen_ty_2>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).autoclose) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(autoclose)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).fp) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(fp)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_RWops__bindgen_ty_1__bindgen_ty_3 {
    pub base: *mut Uint8,
    pub here: *mut Uint8,
    pub stop: *mut Uint8,
}
#[test]
fn bindgen_test_layout_SDL_RWops__bindgen_ty_1__bindgen_ty_3() {
    const UNINIT: ::core::mem::MaybeUninit<SDL_RWops__bindgen_ty_1__bindgen_ty_3> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<SDL_RWops__bindgen_ty_1__bindgen_ty_3>(),
        12usize,
        concat!(
            "Size of: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_3)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_RWops__bindgen_ty_1__bindgen_ty_3>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_3)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).base) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(base)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).here) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(here)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).stop) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(stop)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_RWops__bindgen_ty_1__bindgen_ty_4 {
    pub data1: *mut libc::c_void,
    pub data2: *mut libc::c_void,
}
#[test]
fn bindgen_test_layout_SDL_RWops__bindgen_ty_1__bindgen_ty_4() {
    const UNINIT: ::core::mem::MaybeUninit<SDL_RWops__bindgen_ty_1__bindgen_ty_4> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<SDL_RWops__bindgen_ty_1__bindgen_ty_4>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_4)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_RWops__bindgen_ty_1__bindgen_ty_4>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_4)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(data1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data2) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(data2)
        )
    );
}
#[test]
fn bindgen_test_layout_SDL_RWops__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<SDL_RWops__bindgen_ty_1> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<SDL_RWops__bindgen_ty_1>(),
        20usize,
        concat!("Size of: ", stringify!(SDL_RWops__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_RWops__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(SDL_RWops__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).windowsio) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1),
            "::",
            stringify!(windowsio)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).stdio) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1),
            "::",
            stringify!(stdio)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mem) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1),
            "::",
            stringify!(mem)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).unknown) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1),
            "::",
            stringify!(unknown)
        )
    );
}
#[test]
fn bindgen_test_layout_SDL_RWops() {
    const UNINIT: ::core::mem::MaybeUninit<SDL_RWops> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<SDL_RWops>(),
        44usize,
        concat!("Size of: ", stringify!(SDL_RWops))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_RWops>(),
        4usize,
        concat!("Alignment of ", stringify!(SDL_RWops))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).seek) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops),
            "::",
            stringify!(seek)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).read) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops),
            "::",
            stringify!(read)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).write) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops),
            "::",
            stringify!(write)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).close) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops),
            "::",
            stringify!(close)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hidden) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops),
            "::",
            stringify!(hidden)
        )
    );
}
extern "C" {
    pub fn SDL_RWFromFile(file: *const libc::c_char, mode: *const libc::c_char) -> *mut SDL_RWops;
}
extern "C" {
    pub fn SDL_RWFromFP(fp: *mut FILE, autoclose: SDL_bool) -> *mut SDL_RWops;
}
extern "C" {
    pub fn SDL_RWFromMem(mem: *mut libc::c_void, size: libc::c_int) -> *mut SDL_RWops;
}
extern "C" {
    pub fn SDL_RWFromConstMem(mem: *const libc::c_void, size: libc::c_int) -> *mut SDL_RWops;
}
extern "C" {
    pub fn SDL_AllocRW() -> *mut SDL_RWops;
}
extern "C" {
    pub fn SDL_FreeRW(area: *mut SDL_RWops);
}
extern "C" {
    #[doc = "  Load all the data from an SDL data stream.\n\n  The data is allocated with a zero byte at the end (null terminated)\n\n  If \\c datasize is not NULL, it is filled with the size of the data read.\n\n  If \\c freesrc is non-zero, the stream will be closed after being read.\n\n  The data should be freed with SDL_free().\n\n  \\return the data, or NULL if there was an error."]
    pub fn SDL_LoadFile_RW(
        src: *mut SDL_RWops,
        datasize: *mut usize,
        freesrc: libc::c_int,
    ) -> *mut libc::c_void;
}
extern "C" {
    pub fn SDL_ReadU8(src: *mut SDL_RWops) -> Uint8;
}
extern "C" {
    pub fn SDL_ReadLE16(src: *mut SDL_RWops) -> Uint16;
}
extern "C" {
    pub fn SDL_ReadBE16(src: *mut SDL_RWops) -> Uint16;
}
extern "C" {
    pub fn SDL_ReadLE32(src: *mut SDL_RWops) -> Uint32;
}
extern "C" {
    pub fn SDL_ReadBE32(src: *mut SDL_RWops) -> Uint32;
}
extern "C" {
    pub fn SDL_ReadLE64(src: *mut SDL_RWops) -> Uint64;
}
extern "C" {
    pub fn SDL_ReadBE64(src: *mut SDL_RWops) -> Uint64;
}
extern "C" {
    pub fn SDL_WriteU8(dst: *mut SDL_RWops, value: Uint8) -> usize;
}
extern "C" {
    pub fn SDL_WriteLE16(dst: *mut SDL_RWops, value: Uint16) -> usize;
}
extern "C" {
    pub fn SDL_WriteBE16(dst: *mut SDL_RWops, value: Uint16) -> usize;
}
extern "C" {
    pub fn SDL_WriteLE32(dst: *mut SDL_RWops, value: Uint32) -> usize;
}
extern "C" {
    pub fn SDL_WriteBE32(dst: *mut SDL_RWops, value: Uint32) -> usize;
}
extern "C" {
    pub fn SDL_WriteLE64(dst: *mut SDL_RWops, value: Uint64) -> usize;
}
extern "C" {
    pub fn SDL_WriteBE64(dst: *mut SDL_RWops, value: Uint64) -> usize;
}
#[doc = "  \\brief Audio format flags.\n\n  These are what the 16 bits in SDL_AudioFormat currently mean...\n  (Unspecified bits are always zero).\n\n  \\verbatim\n++-----------------------sample is signed if set\n||\n||       ++-----------sample is bigendian if set\n||       ||\n||       ||          ++---sample is float if set\n||       ||          ||\n||       ||          || +---sample bit size---+\n||       ||          || |                     |\n15 14 13 12 11 10 09 08 07 06 05 04 03 02 01 00\n\\endverbatim\n\n  There are macros in SDL 2.0 and later to query these bits."]
pub type SDL_AudioFormat = Uint16;
#[doc = "  This function is called when the audio device needs more data.\n\n  \\param userdata An application-specific parameter saved in\n                  the SDL_AudioSpec structure\n  \\param stream A pointer to the audio data buffer.\n  \\param len    The length of that buffer in bytes.\n\n  Once the callback returns, the buffer will no longer be valid.\n  Stereo samples are stored in a LRLRLR ordering.\n\n  You can choose to avoid callbacks and use SDL_QueueAudio() instead, if\n  you like. Just open your audio device with a NULL callback."]
pub type SDL_AudioCallback = ::core::option::Option<
    unsafe extern "C" fn(userdata: *mut libc::c_void, stream: *mut Uint8, len: libc::c_int),
>;
#[doc = "  The calculated values in this structure are calculated by SDL_OpenAudio().\n\n  For multi-channel audio, the default SDL channel mapping is:\n  2:  FL FR                       (stereo)\n  3:  FL FR LFE                   (2.1 surround)\n  4:  FL FR BL BR                 (quad)\n  5:  FL FR FC BL BR              (quad + center)\n  6:  FL FR FC LFE SL SR          (5.1 surround - last two can also be BL BR)\n  7:  FL FR FC LFE BC SL SR       (6.1 surround)\n  8:  FL FR FC LFE BL BR SL SR    (7.1 surround)"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_AudioSpec {
    #[doc = "< DSP frequency -- samples per second"]
    pub freq: libc::c_int,
    #[doc = "< Audio data format"]
    pub format: SDL_AudioFormat,
    #[doc = "< Number of channels: 1 mono, 2 stereo"]
    pub channels: Uint8,
    #[doc = "< Audio buffer silence value (calculated)"]
    pub silence: Uint8,
    #[doc = "< Audio buffer size in sample FRAMES (total samples divided by channel count)"]
    pub samples: Uint16,
    #[doc = "< Necessary for some compile environments"]
    pub padding: Uint16,
    #[doc = "< Audio buffer size in bytes (calculated)"]
    pub size: Uint32,
    #[doc = "< Callback that feeds the audio device (NULL to use SDL_QueueAudio())."]
    pub callback: SDL_AudioCallback,
    #[doc = "< Userdata passed to callback (ignored for NULL callbacks)."]
    pub userdata: *mut libc::c_void,
}
#[test]
fn bindgen_test_layout_SDL_AudioSpec() {
    const UNINIT: ::core::mem::MaybeUninit<SDL_AudioSpec> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<SDL_AudioSpec>(),
        24usize,
        concat!("Size of: ", stringify!(SDL_AudioSpec))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_AudioSpec>(),
        4usize,
        concat!("Alignment of ", stringify!(SDL_AudioSpec))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).freq) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioSpec),
            "::",
            stringify!(freq)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioSpec),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).channels) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioSpec),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).silence) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioSpec),
            "::",
            stringify!(silence)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).samples) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioSpec),
            "::",
            stringify!(samples)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).padding) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioSpec),
            "::",
            stringify!(padding)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioSpec),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).callback) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioSpec),
            "::",
            stringify!(callback)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).userdata) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioSpec),
            "::",
            stringify!(userdata)
        )
    );
}
pub type SDL_AudioFilter =
    ::core::option::Option<unsafe extern "C" fn(cvt: *mut SDL_AudioCVT, format: SDL_AudioFormat)>;
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct SDL_AudioCVT {
    #[doc = "< Set to 1 if conversion possible"]
    pub needed: libc::c_int,
    #[doc = "< Source audio format"]
    pub src_format: SDL_AudioFormat,
    #[doc = "< Target audio format"]
    pub dst_format: SDL_AudioFormat,
    #[doc = "< Rate conversion increment"]
    pub rate_incr: f64,
    #[doc = "< Buffer to hold entire audio data"]
    pub buf: *mut Uint8,
    #[doc = "< Length of original audio buffer"]
    pub len: libc::c_int,
    #[doc = "< Length of converted audio buffer"]
    pub len_cvt: libc::c_int,
    #[doc = "< buffer must be len*len_mult big"]
    pub len_mult: libc::c_int,
    #[doc = "< Given len, final size is len*len_ratio"]
    pub len_ratio: f64,
    #[doc = "< NULL-terminated list of filter functions"]
    pub filters: [SDL_AudioFilter; 10usize],
    #[doc = "< Current audio conversion function"]
    pub filter_index: libc::c_int,
}
#[test]
fn bindgen_test_layout_SDL_AudioCVT() {
    const UNINIT: ::core::mem::MaybeUninit<SDL_AudioCVT> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<SDL_AudioCVT>(),
        84usize,
        concat!("Size of: ", stringify!(SDL_AudioCVT))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_AudioCVT>(),
        4usize,
        concat!("Alignment of ", stringify!(SDL_AudioCVT))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).needed) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(needed)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).src_format) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(src_format)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dst_format) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(dst_format)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rate_incr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(rate_incr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).buf) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(buf)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).len) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).len_cvt) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(len_cvt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).len_mult) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(len_mult)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).len_ratio) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(len_ratio)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).filters) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(filters)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).filter_index) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(filter_index)
        )
    );
}
extern "C" {
    pub fn SDL_GetNumAudioDrivers() -> libc::c_int;
}
extern "C" {
    pub fn SDL_GetAudioDriver(index: libc::c_int) -> *const libc::c_char;
}
extern "C" {
    pub fn SDL_AudioInit(driver_name: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn SDL_AudioQuit();
}
extern "C" {
    #[doc = "  This function returns the name of the current audio driver, or NULL\n  if no driver has been initialized."]
    pub fn SDL_GetCurrentAudioDriver() -> *const libc::c_char;
}
extern "C" {
    #[doc = "  This function opens the audio device with the desired parameters, and\n  returns 0 if successful, placing the actual hardware parameters in the\n  structure pointed to by \\c obtained.  If \\c obtained is NULL, the audio\n  data passed to the callback function will be guaranteed to be in the\n  requested format, and will be automatically converted to the hardware\n  audio format if necessary.  This function returns -1 if it failed\n  to open the audio device, or couldn't set up the audio thread.\n\n  When filling in the desired audio spec structure,\n    - \\c desired->freq should be the desired audio frequency in samples-per-\n      second.\n    - \\c desired->format should be the desired audio format.\n    - \\c desired->samples is the desired size of the audio buffer, in\n      samples.  This number should be a power of two, and may be adjusted by\n      the audio driver to a value more suitable for the hardware.  Good values\n      seem to range between 512 and 8096 inclusive, depending on the\n      application and CPU speed.  Smaller values yield faster response time,\n      but can lead to underflow if the application is doing heavy processing\n      and cannot fill the audio buffer in time.  A stereo sample consists of\n      both right and left channels in LR ordering.\n      Note that the number of samples is directly related to time by the\n      following formula:  \\code ms = (samples*1000)/freq \\endcode\n    - \\c desired->size is the size in bytes of the audio buffer, and is\n      calculated by SDL_OpenAudio().\n    - \\c desired->silence is the value used to set the buffer to silence,\n      and is calculated by SDL_OpenAudio().\n    - \\c desired->callback should be set to a function that will be called\n      when the audio device is ready for more data.  It is passed a pointer\n      to the audio buffer, and the length in bytes of the audio buffer.\n      This function usually runs in a separate thread, and so you should\n      protect data structures that it accesses by calling SDL_LockAudio()\n      and SDL_UnlockAudio() in your code. Alternately, you may pass a NULL\n      pointer here, and call SDL_QueueAudio() with some frequency, to queue\n      more audio samples to be played (or for capture devices, call\n      SDL_DequeueAudio() with some frequency, to obtain audio samples).\n    - \\c desired->userdata is passed as the first parameter to your callback\n      function. If you passed a NULL callback, this value is ignored.\n\n  The audio device starts out playing silence when it's opened, and should\n  be enabled for playing by calling \\c SDL_PauseAudio(0) when you are ready\n  for your audio callback function to be called.  Since the audio driver\n  may modify the requested size of the audio buffer, you should allocate\n  any local mixing buffers after you open the audio device."]
    pub fn SDL_OpenAudio(desired: *mut SDL_AudioSpec, obtained: *mut SDL_AudioSpec) -> libc::c_int;
}
#[doc = "  SDL Audio Device IDs.\n\n  A successful call to SDL_OpenAudio() is always device id 1, and legacy\n  SDL audio APIs assume you want this device ID. SDL_OpenAudioDevice() calls\n  always returns devices >= 2 on success. The legacy calls are good both\n  for backwards compatibility and when you don't care about multiple,\n  specific, or capture devices."]
pub type SDL_AudioDeviceID = Uint32;
extern "C" {
    #[doc = "  Get the number of available devices exposed by the current driver.\n  Only valid after a successfully initializing the audio subsystem.\n  Returns -1 if an explicit list of devices can't be determined; this is\n  not an error. For example, if SDL is set up to talk to a remote audio\n  server, it can't list every one available on the Internet, but it will\n  still allow a specific host to be specified to SDL_OpenAudioDevice().\n\n  In many common cases, when this function returns a value <= 0, it can still\n  successfully open the default device (NULL for first argument of\n  SDL_OpenAudioDevice())."]
    pub fn SDL_GetNumAudioDevices(iscapture: libc::c_int) -> libc::c_int;
}
extern "C" {
    #[doc = "  Get the human-readable name of a specific audio device.\n  Must be a value between 0 and (number of audio devices-1).\n  Only valid after a successfully initializing the audio subsystem.\n  The values returned by this function reflect the latest call to\n  SDL_GetNumAudioDevices(); recall that function to redetect available\n  hardware.\n\n  The string returned by this function is UTF-8 encoded, read-only, and\n  managed internally. You are not to free it. If you need to keep the\n  string for any length of time, you should make your own copy of it, as it\n  will be invalid next time any of several other SDL functions is called."]
    pub fn SDL_GetAudioDeviceName(
        index: libc::c_int,
        iscapture: libc::c_int,
    ) -> *const libc::c_char;
}
extern "C" {
    #[doc = "  Open a specific audio device. Passing in a device name of NULL requests\n  the most reasonable default (and is equivalent to calling SDL_OpenAudio()).\n\n  The device name is a UTF-8 string reported by SDL_GetAudioDeviceName(), but\n  some drivers allow arbitrary and driver-specific strings, such as a\n  hostname/IP address for a remote audio server, or a filename in the\n  diskaudio driver.\n\n  \\return 0 on error, a valid device ID that is >= 2 on success.\n\n  SDL_OpenAudio(), unlike this function, always acts on device ID 1."]
    pub fn SDL_OpenAudioDevice(
        device: *const libc::c_char,
        iscapture: libc::c_int,
        desired: *const SDL_AudioSpec,
        obtained: *mut SDL_AudioSpec,
        allowed_changes: libc::c_int,
    ) -> SDL_AudioDeviceID;
}
pub const SDL_AudioStatus_SDL_AUDIO_STOPPED: SDL_AudioStatus = 0;
pub const SDL_AudioStatus_SDL_AUDIO_PLAYING: SDL_AudioStatus = 1;
pub const SDL_AudioStatus_SDL_AUDIO_PAUSED: SDL_AudioStatus = 2;
pub type SDL_AudioStatus = libc::c_int;
extern "C" {
    pub fn SDL_GetAudioStatus() -> SDL_AudioStatus;
}
extern "C" {
    pub fn SDL_GetAudioDeviceStatus(dev: SDL_AudioDeviceID) -> SDL_AudioStatus;
}
extern "C" {
    pub fn SDL_PauseAudio(pause_on: libc::c_int);
}
extern "C" {
    pub fn SDL_PauseAudioDevice(dev: SDL_AudioDeviceID, pause_on: libc::c_int);
}
extern "C" {
    #[doc = "  This function loads a WAVE from the data source, automatically freeing\n  that source if \\c freesrc is non-zero.  For example, to load a WAVE file,\n  you could do:\n  \\code\n      SDL_LoadWAV_RW(SDL_RWFromFile(\"sample.wav\", \"rb\"), 1, ...);\n  \\endcode\n\n  If this function succeeds, it returns the given SDL_AudioSpec,\n  filled with the audio data format of the wave data, and sets\n  \\c *audio_buf to a malloc()'d buffer containing the audio data,\n  and sets \\c *audio_len to the length of that audio buffer, in bytes.\n  You need to free the audio buffer with SDL_FreeWAV() when you are\n  done with it.\n\n  This function returns NULL and sets the SDL error message if the\n  wave file cannot be opened, uses an unknown data format, or is\n  corrupt.  Currently raw and MS-ADPCM WAVE files are supported."]
    pub fn SDL_LoadWAV_RW(
        src: *mut SDL_RWops,
        freesrc: libc::c_int,
        spec: *mut SDL_AudioSpec,
        audio_buf: *mut *mut Uint8,
        audio_len: *mut Uint32,
    ) -> *mut SDL_AudioSpec;
}
extern "C" {
    #[doc = "  This function frees data previously allocated with SDL_LoadWAV_RW()"]
    pub fn SDL_FreeWAV(audio_buf: *mut Uint8);
}
extern "C" {
    #[doc = "  This function takes a source format and rate and a destination format\n  and rate, and initializes the \\c cvt structure with information needed\n  by SDL_ConvertAudio() to convert a buffer of audio data from one format\n  to the other. An unsupported format causes an error and -1 will be returned.\n\n  \\return 0 if no conversion is needed, 1 if the audio filter is set up,\n  or -1 on error."]
    pub fn SDL_BuildAudioCVT(
        cvt: *mut SDL_AudioCVT,
        src_format: SDL_AudioFormat,
        src_channels: Uint8,
        src_rate: libc::c_int,
        dst_format: SDL_AudioFormat,
        dst_channels: Uint8,
        dst_rate: libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  Once you have initialized the \\c cvt structure using SDL_BuildAudioCVT(),\n  created an audio buffer \\c cvt->buf, and filled it with \\c cvt->len bytes of\n  audio data in the source format, this function will convert it in-place\n  to the desired format.\n\n  The data conversion may expand the size of the audio data, so the buffer\n  \\c cvt->buf should be allocated after the \\c cvt structure is initialized by\n  SDL_BuildAudioCVT(), and should be \\c cvt->len*cvt->len_mult bytes long.\n\n  \\return 0 on success or -1 if \\c cvt->buf is NULL."]
    pub fn SDL_ConvertAudio(cvt: *mut SDL_AudioCVT) -> libc::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SDL_AudioStream {
    _unused: [u8; 0],
}
pub type SDL_AudioStream = _SDL_AudioStream;
extern "C" {
    #[doc = "  Create a new audio stream\n\n  \\param src_format The format of the source audio\n  \\param src_channels The number of channels of the source audio\n  \\param src_rate The sampling rate of the source audio\n  \\param dst_format The format of the desired audio output\n  \\param dst_channels The number of channels of the desired audio output\n  \\param dst_rate The sampling rate of the desired audio output\n  \\return 0 on success, or -1 on error.\n\n  \\sa SDL_AudioStreamPut\n  \\sa SDL_AudioStreamGet\n  \\sa SDL_AudioStreamAvailable\n  \\sa SDL_AudioStreamFlush\n  \\sa SDL_AudioStreamClear\n  \\sa SDL_FreeAudioStream"]
    pub fn SDL_NewAudioStream(
        src_format: SDL_AudioFormat,
        src_channels: Uint8,
        src_rate: libc::c_int,
        dst_format: SDL_AudioFormat,
        dst_channels: Uint8,
        dst_rate: libc::c_int,
    ) -> *mut SDL_AudioStream;
}
extern "C" {
    #[doc = "  Add data to be converted/resampled to the stream\n\n  \\param stream The stream the audio data is being added to\n  \\param buf A pointer to the audio data to add\n  \\param len The number of bytes to write to the stream\n  \\return 0 on success, or -1 on error.\n\n  \\sa SDL_NewAudioStream\n  \\sa SDL_AudioStreamGet\n  \\sa SDL_AudioStreamAvailable\n  \\sa SDL_AudioStreamFlush\n  \\sa SDL_AudioStreamClear\n  \\sa SDL_FreeAudioStream"]
    pub fn SDL_AudioStreamPut(
        stream: *mut SDL_AudioStream,
        buf: *const libc::c_void,
        len: libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  Get converted/resampled data from the stream\n\n  \\param stream The stream the audio is being requested from\n  \\param buf A buffer to fill with audio data\n  \\param len The maximum number of bytes to fill\n  \\return The number of bytes read from the stream, or -1 on error\n\n  \\sa SDL_NewAudioStream\n  \\sa SDL_AudioStreamPut\n  \\sa SDL_AudioStreamAvailable\n  \\sa SDL_AudioStreamFlush\n  \\sa SDL_AudioStreamClear\n  \\sa SDL_FreeAudioStream"]
    pub fn SDL_AudioStreamGet(
        stream: *mut SDL_AudioStream,
        buf: *mut libc::c_void,
        len: libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = " Get the number of converted/resampled bytes available. The stream may be\n  buffering data behind the scenes until it has enough to resample\n  correctly, so this number might be lower than what you expect, or even\n  be zero. Add more data or flush the stream if you need the data now.\n\n  \\sa SDL_NewAudioStream\n  \\sa SDL_AudioStreamPut\n  \\sa SDL_AudioStreamGet\n  \\sa SDL_AudioStreamFlush\n  \\sa SDL_AudioStreamClear\n  \\sa SDL_FreeAudioStream"]
    pub fn SDL_AudioStreamAvailable(stream: *mut SDL_AudioStream) -> libc::c_int;
}
extern "C" {
    #[doc = " Tell the stream that you're done sending data, and anything being buffered\n  should be converted/resampled and made available immediately.\n\n It is legal to add more data to a stream after flushing, but there will\n  be audio gaps in the output. Generally this is intended to signal the\n  end of input, so the complete output becomes available.\n\n  \\sa SDL_NewAudioStream\n  \\sa SDL_AudioStreamPut\n  \\sa SDL_AudioStreamGet\n  \\sa SDL_AudioStreamAvailable\n  \\sa SDL_AudioStreamClear\n  \\sa SDL_FreeAudioStream"]
    pub fn SDL_AudioStreamFlush(stream: *mut SDL_AudioStream) -> libc::c_int;
}
extern "C" {
    #[doc = "  Clear any pending data in the stream without converting it\n\n  \\sa SDL_NewAudioStream\n  \\sa SDL_AudioStreamPut\n  \\sa SDL_AudioStreamGet\n  \\sa SDL_AudioStreamAvailable\n  \\sa SDL_AudioStreamFlush\n  \\sa SDL_FreeAudioStream"]
    pub fn SDL_AudioStreamClear(stream: *mut SDL_AudioStream);
}
extern "C" {
    #[doc = " Free an audio stream\n\n  \\sa SDL_NewAudioStream\n  \\sa SDL_AudioStreamPut\n  \\sa SDL_AudioStreamGet\n  \\sa SDL_AudioStreamAvailable\n  \\sa SDL_AudioStreamFlush\n  \\sa SDL_AudioStreamClear"]
    pub fn SDL_FreeAudioStream(stream: *mut SDL_AudioStream);
}
extern "C" {
    #[doc = "  This takes two audio buffers of the playing audio format and mixes\n  them, performing addition, volume adjustment, and overflow clipping.\n  The volume ranges from 0 - 128, and should be set to ::SDL_MIX_MAXVOLUME\n  for full audio volume.  Note this does not change hardware volume.\n  This is provided for convenience -- you can mix your own audio data."]
    pub fn SDL_MixAudio(dst: *mut Uint8, src: *const Uint8, len: Uint32, volume: libc::c_int);
}
extern "C" {
    #[doc = "  This works like SDL_MixAudio(), but you specify the audio format instead of\n  using the format of audio device 1. Thus it can be used when no audio\n  device is open at all."]
    pub fn SDL_MixAudioFormat(
        dst: *mut Uint8,
        src: *const Uint8,
        format: SDL_AudioFormat,
        len: Uint32,
        volume: libc::c_int,
    );
}
extern "C" {
    #[doc = "  Queue more audio on non-callback devices.\n\n  (If you are looking to retrieve queued audio from a non-callback capture\n  device, you want SDL_DequeueAudio() instead. This will return -1 to\n  signify an error if you use it with capture devices.)\n\n  SDL offers two ways to feed audio to the device: you can either supply a\n  callback that SDL triggers with some frequency to obtain more audio\n  (pull method), or you can supply no callback, and then SDL will expect\n  you to supply data at regular intervals (push method) with this function.\n\n  There are no limits on the amount of data you can queue, short of\n  exhaustion of address space. Queued data will drain to the device as\n  necessary without further intervention from you. If the device needs\n  audio but there is not enough queued, it will play silence to make up\n  the difference. This means you will have skips in your audio playback\n  if you aren't routinely queueing sufficient data.\n\n  This function copies the supplied data, so you are safe to free it when\n  the function returns. This function is thread-safe, but queueing to the\n  same device from two threads at once does not promise which buffer will\n  be queued first.\n\n  You may not queue audio on a device that is using an application-supplied\n  callback; doing so returns an error. You have to use the audio callback\n  or queue audio with this function, but not both.\n\n  You should not call SDL_LockAudio() on the device before queueing; SDL\n  handles locking internally for this function.\n\n  \\param dev The device ID to which we will queue audio.\n  \\param data The data to queue to the device for later playback.\n  \\param len The number of bytes (not samples!) to which (data) points.\n  \\return 0 on success, or -1 on error.\n\n  \\sa SDL_GetQueuedAudioSize\n  \\sa SDL_ClearQueuedAudio"]
    pub fn SDL_QueueAudio(
        dev: SDL_AudioDeviceID,
        data: *const libc::c_void,
        len: Uint32,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  Dequeue more audio on non-callback devices.\n\n  (If you are looking to queue audio for output on a non-callback playback\n  device, you want SDL_QueueAudio() instead. This will always return 0\n  if you use it with playback devices.)\n\n  SDL offers two ways to retrieve audio from a capture device: you can\n  either supply a callback that SDL triggers with some frequency as the\n  device records more audio data, (push method), or you can supply no\n  callback, and then SDL will expect you to retrieve data at regular\n  intervals (pull method) with this function.\n\n  There are no limits on the amount of data you can queue, short of\n  exhaustion of address space. Data from the device will keep queuing as\n  necessary without further intervention from you. This means you will\n  eventually run out of memory if you aren't routinely dequeueing data.\n\n  Capture devices will not queue data when paused; if you are expecting\n  to not need captured audio for some length of time, use\n  SDL_PauseAudioDevice() to stop the capture device from queueing more\n  data. This can be useful during, say, level loading times. When\n  unpaused, capture devices will start queueing data from that point,\n  having flushed any capturable data available while paused.\n\n  This function is thread-safe, but dequeueing from the same device from\n  two threads at once does not promise which thread will dequeued data\n  first.\n\n  You may not dequeue audio from a device that is using an\n  application-supplied callback; doing so returns an error. You have to use\n  the audio callback, or dequeue audio with this function, but not both.\n\n  You should not call SDL_LockAudio() on the device before queueing; SDL\n  handles locking internally for this function.\n\n  \\param dev The device ID from which we will dequeue audio.\n  \\param data A pointer into where audio data should be copied.\n  \\param len The number of bytes (not samples!) to which (data) points.\n  \\return number of bytes dequeued, which could be less than requested.\n\n  \\sa SDL_GetQueuedAudioSize\n  \\sa SDL_ClearQueuedAudio"]
    pub fn SDL_DequeueAudio(dev: SDL_AudioDeviceID, data: *mut libc::c_void, len: Uint32)
        -> Uint32;
}
extern "C" {
    #[doc = "  Get the number of bytes of still-queued audio.\n\n  For playback device:\n\n    This is the number of bytes that have been queued for playback with\n    SDL_QueueAudio(), but have not yet been sent to the hardware. This\n    number may shrink at any time, so this only informs of pending data.\n\n    Once we've sent it to the hardware, this function can not decide the\n    exact byte boundary of what has been played. It's possible that we just\n    gave the hardware several kilobytes right before you called this\n    function, but it hasn't played any of it yet, or maybe half of it, etc.\n\n  For capture devices:\n\n    This is the number of bytes that have been captured by the device and\n    are waiting for you to dequeue. This number may grow at any time, so\n    this only informs of the lower-bound of available data.\n\n  You may not queue audio on a device that is using an application-supplied\n  callback; calling this function on such a device always returns 0.\n  You have to queue audio with SDL_QueueAudio()/SDL_DequeueAudio(), or use\n  the audio callback, but not both.\n\n  You should not call SDL_LockAudio() on the device before querying; SDL\n  handles locking internally for this function.\n\n  \\param dev The device ID of which we will query queued audio size.\n  \\return Number of bytes (not samples!) of queued audio.\n\n  \\sa SDL_QueueAudio\n  \\sa SDL_ClearQueuedAudio"]
    pub fn SDL_GetQueuedAudioSize(dev: SDL_AudioDeviceID) -> Uint32;
}
extern "C" {
    #[doc = "  Drop any queued audio data. For playback devices, this is any queued data\n  still waiting to be submitted to the hardware. For capture devices, this\n  is any data that was queued by the device that hasn't yet been dequeued by\n  the application.\n\n  Immediately after this call, SDL_GetQueuedAudioSize() will return 0. For\n  playback devices, the hardware will start playing silence if more audio\n  isn't queued. Unpaused capture devices will start filling the queue again\n  as soon as they have more data available (which, depending on the state\n  of the hardware and the thread, could be before this function call\n  returns!).\n\n  This will not prevent playback of queued audio that's already been sent\n  to the hardware, as we can not undo that, so expect there to be some\n  fraction of a second of audio that might still be heard. This can be\n  useful if you want to, say, drop any pending music during a level change\n  in your game.\n\n  You may not queue audio on a device that is using an application-supplied\n  callback; calling this function on such a device is always a no-op.\n  You have to queue audio with SDL_QueueAudio()/SDL_DequeueAudio(), or use\n  the audio callback, but not both.\n\n  You should not call SDL_LockAudio() on the device before clearing the\n  queue; SDL handles locking internally for this function.\n\n  This function always succeeds and thus returns void.\n\n  \\param dev The device ID of which to clear the audio queue.\n\n  \\sa SDL_QueueAudio\n  \\sa SDL_GetQueuedAudioSize"]
    pub fn SDL_ClearQueuedAudio(dev: SDL_AudioDeviceID);
}
extern "C" {
    pub fn SDL_LockAudio();
}
extern "C" {
    pub fn SDL_LockAudioDevice(dev: SDL_AudioDeviceID);
}
extern "C" {
    pub fn SDL_UnlockAudio();
}
extern "C" {
    pub fn SDL_UnlockAudioDevice(dev: SDL_AudioDeviceID);
}
extern "C" {
    #[doc = "  This function shuts down audio processing and closes the audio device."]
    pub fn SDL_CloseAudio();
}
extern "C" {
    pub fn SDL_CloseAudioDevice(dev: SDL_AudioDeviceID);
}
extern "C" {
    #[doc = " \\brief Put UTF-8 text into the clipboard\n\n \\sa SDL_GetClipboardText()"]
    pub fn SDL_SetClipboardText(text: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    #[doc = " \\brief Get UTF-8 text from the clipboard, which must be freed with SDL_free()\n\n \\sa SDL_SetClipboardText()"]
    pub fn SDL_GetClipboardText() -> *mut libc::c_char;
}
extern "C" {
    #[doc = " \\brief Returns a flag indicating whether the clipboard exists and contains a text string that is non-empty\n\n \\sa SDL_GetClipboardText()"]
    pub fn SDL_HasClipboardText() -> SDL_bool;
}
extern "C" {
    #[doc = "  This function returns the number of CPU cores available."]
    pub fn SDL_GetCPUCount() -> libc::c_int;
}
extern "C" {
    #[doc = "  This function returns the L1 cache line size of the CPU\n\n  This is useful for determining multi-threaded structure padding\n  or SIMD prefetch sizes."]
    pub fn SDL_GetCPUCacheLineSize() -> libc::c_int;
}
extern "C" {
    #[doc = "  This function returns true if the CPU has the RDTSC instruction."]
    pub fn SDL_HasRDTSC() -> SDL_bool;
}
extern "C" {
    #[doc = "  This function returns true if the CPU has AltiVec features."]
    pub fn SDL_HasAltiVec() -> SDL_bool;
}
extern "C" {
    #[doc = "  This function returns true if the CPU has MMX features."]
    pub fn SDL_HasMMX() -> SDL_bool;
}
extern "C" {
    #[doc = "  This function returns true if the CPU has 3DNow! features."]
    pub fn SDL_Has3DNow() -> SDL_bool;
}
extern "C" {
    #[doc = "  This function returns true if the CPU has SSE features."]
    pub fn SDL_HasSSE() -> SDL_bool;
}
extern "C" {
    #[doc = "  This function returns true if the CPU has SSE2 features."]
    pub fn SDL_HasSSE2() -> SDL_bool;
}
extern "C" {
    #[doc = "  This function returns true if the CPU has SSE3 features."]
    pub fn SDL_HasSSE3() -> SDL_bool;
}
extern "C" {
    #[doc = "  This function returns true if the CPU has SSE4.1 features."]
    pub fn SDL_HasSSE41() -> SDL_bool;
}
extern "C" {
    #[doc = "  This function returns true if the CPU has SSE4.2 features."]
    pub fn SDL_HasSSE42() -> SDL_bool;
}
extern "C" {
    #[doc = "  This function returns true if the CPU has AVX features."]
    pub fn SDL_HasAVX() -> SDL_bool;
}
extern "C" {
    #[doc = "  This function returns true if the CPU has AVX2 features."]
    pub fn SDL_HasAVX2() -> SDL_bool;
}
extern "C" {
    #[doc = "  This function returns true if the CPU has AVX-512F (foundation) features."]
    pub fn SDL_HasAVX512F() -> SDL_bool;
}
extern "C" {
    #[doc = "  This function returns true if the CPU has NEON (ARM SIMD) features."]
    pub fn SDL_HasNEON() -> SDL_bool;
}
extern "C" {
    #[doc = "  This function returns the amount of RAM configured in the system, in MB."]
    pub fn SDL_GetSystemRAM() -> libc::c_int;
}
pub const SDL_PIXELTYPE_UNKNOWN: _bindgen_ty_10 = 0;
pub const SDL_PIXELTYPE_INDEX1: _bindgen_ty_10 = 1;
pub const SDL_PIXELTYPE_INDEX4: _bindgen_ty_10 = 2;
pub const SDL_PIXELTYPE_INDEX8: _bindgen_ty_10 = 3;
pub const SDL_PIXELTYPE_PACKED8: _bindgen_ty_10 = 4;
pub const SDL_PIXELTYPE_PACKED16: _bindgen_ty_10 = 5;
pub const SDL_PIXELTYPE_PACKED32: _bindgen_ty_10 = 6;
pub const SDL_PIXELTYPE_ARRAYU8: _bindgen_ty_10 = 7;
pub const SDL_PIXELTYPE_ARRAYU16: _bindgen_ty_10 = 8;
pub const SDL_PIXELTYPE_ARRAYU32: _bindgen_ty_10 = 9;
pub const SDL_PIXELTYPE_ARRAYF16: _bindgen_ty_10 = 10;
pub const SDL_PIXELTYPE_ARRAYF32: _bindgen_ty_10 = 11;
#[doc = " Pixel type."]
pub type _bindgen_ty_10 = libc::c_int;
pub const SDL_BITMAPORDER_NONE: _bindgen_ty_11 = 0;
pub const SDL_BITMAPORDER_4321: _bindgen_ty_11 = 1;
pub const SDL_BITMAPORDER_1234: _bindgen_ty_11 = 2;
#[doc = " Bitmap pixel order, high bit -> low bit."]
pub type _bindgen_ty_11 = libc::c_int;
pub const SDL_PACKEDORDER_NONE: _bindgen_ty_12 = 0;
pub const SDL_PACKEDORDER_XRGB: _bindgen_ty_12 = 1;
pub const SDL_PACKEDORDER_RGBX: _bindgen_ty_12 = 2;
pub const SDL_PACKEDORDER_ARGB: _bindgen_ty_12 = 3;
pub const SDL_PACKEDORDER_RGBA: _bindgen_ty_12 = 4;
pub const SDL_PACKEDORDER_XBGR: _bindgen_ty_12 = 5;
pub const SDL_PACKEDORDER_BGRX: _bindgen_ty_12 = 6;
pub const SDL_PACKEDORDER_ABGR: _bindgen_ty_12 = 7;
pub const SDL_PACKEDORDER_BGRA: _bindgen_ty_12 = 8;
#[doc = " Packed component order, high bit -> low bit."]
pub type _bindgen_ty_12 = libc::c_int;
pub const SDL_ARRAYORDER_NONE: _bindgen_ty_13 = 0;
pub const SDL_ARRAYORDER_RGB: _bindgen_ty_13 = 1;
pub const SDL_ARRAYORDER_RGBA: _bindgen_ty_13 = 2;
pub const SDL_ARRAYORDER_ARGB: _bindgen_ty_13 = 3;
pub const SDL_ARRAYORDER_BGR: _bindgen_ty_13 = 4;
pub const SDL_ARRAYORDER_BGRA: _bindgen_ty_13 = 5;
pub const SDL_ARRAYORDER_ABGR: _bindgen_ty_13 = 6;
#[doc = " Array component order, low byte -> high byte."]
pub type _bindgen_ty_13 = libc::c_int;
pub const SDL_PACKEDLAYOUT_NONE: _bindgen_ty_14 = 0;
pub const SDL_PACKEDLAYOUT_332: _bindgen_ty_14 = 1;
pub const SDL_PACKEDLAYOUT_4444: _bindgen_ty_14 = 2;
pub const SDL_PACKEDLAYOUT_1555: _bindgen_ty_14 = 3;
pub const SDL_PACKEDLAYOUT_5551: _bindgen_ty_14 = 4;
pub const SDL_PACKEDLAYOUT_565: _bindgen_ty_14 = 5;
pub const SDL_PACKEDLAYOUT_8888: _bindgen_ty_14 = 6;
pub const SDL_PACKEDLAYOUT_2101010: _bindgen_ty_14 = 7;
pub const SDL_PACKEDLAYOUT_1010102: _bindgen_ty_14 = 8;
#[doc = " Packed component layout."]
pub type _bindgen_ty_14 = libc::c_int;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_UNKNOWN: SDL_PixelFormatEnum = 0;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_INDEX1LSB: SDL_PixelFormatEnum = 286261504;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_INDEX1MSB: SDL_PixelFormatEnum = 287310080;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_INDEX4LSB: SDL_PixelFormatEnum = 303039488;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_INDEX4MSB: SDL_PixelFormatEnum = 304088064;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_INDEX8: SDL_PixelFormatEnum = 318769153;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_RGB332: SDL_PixelFormatEnum = 336660481;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_RGB444: SDL_PixelFormatEnum = 353504258;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_RGB555: SDL_PixelFormatEnum = 353570562;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_BGR555: SDL_PixelFormatEnum = 357764866;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_ARGB4444: SDL_PixelFormatEnum = 355602434;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_RGBA4444: SDL_PixelFormatEnum = 356651010;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_ABGR4444: SDL_PixelFormatEnum = 359796738;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_BGRA4444: SDL_PixelFormatEnum = 360845314;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_ARGB1555: SDL_PixelFormatEnum = 355667970;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_RGBA5551: SDL_PixelFormatEnum = 356782082;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_ABGR1555: SDL_PixelFormatEnum = 359862274;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_BGRA5551: SDL_PixelFormatEnum = 360976386;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_RGB565: SDL_PixelFormatEnum = 353701890;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_BGR565: SDL_PixelFormatEnum = 357896194;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_RGB24: SDL_PixelFormatEnum = 386930691;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_BGR24: SDL_PixelFormatEnum = 390076419;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_RGB888: SDL_PixelFormatEnum = 370546692;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_RGBX8888: SDL_PixelFormatEnum = 371595268;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_BGR888: SDL_PixelFormatEnum = 374740996;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_BGRX8888: SDL_PixelFormatEnum = 375789572;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_ARGB8888: SDL_PixelFormatEnum = 372645892;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_RGBA8888: SDL_PixelFormatEnum = 373694468;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_ABGR8888: SDL_PixelFormatEnum = 376840196;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_BGRA8888: SDL_PixelFormatEnum = 377888772;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_ARGB2101010: SDL_PixelFormatEnum = 372711428;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_RGBA32: SDL_PixelFormatEnum = 376840196;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_ARGB32: SDL_PixelFormatEnum = 377888772;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_BGRA32: SDL_PixelFormatEnum = 372645892;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_ABGR32: SDL_PixelFormatEnum = 373694468;
#[doc = "< Planar mode: Y + V + U  (3 planes)"]
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_YV12: SDL_PixelFormatEnum = 842094169;
#[doc = "< Planar mode: Y + U + V  (3 planes)"]
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_IYUV: SDL_PixelFormatEnum = 1448433993;
#[doc = "< Packed mode: Y0+U0+Y1+V0 (1 plane)"]
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_YUY2: SDL_PixelFormatEnum = 844715353;
#[doc = "< Packed mode: U0+Y0+V0+Y1 (1 plane)"]
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_UYVY: SDL_PixelFormatEnum = 1498831189;
#[doc = "< Packed mode: Y0+V0+Y1+U0 (1 plane)"]
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_YVYU: SDL_PixelFormatEnum = 1431918169;
#[doc = "< Planar mode: Y + U/V interleaved  (2 planes)"]
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_NV12: SDL_PixelFormatEnum = 842094158;
#[doc = "< Planar mode: Y + V/U interleaved  (2 planes)"]
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_NV21: SDL_PixelFormatEnum = 825382478;
#[doc = "< Android video texture format"]
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_EXTERNAL_OES: SDL_PixelFormatEnum = 542328143;
pub type SDL_PixelFormatEnum = libc::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_Color {
    pub r: Uint8,
    pub g: Uint8,
    pub b: Uint8,
    pub a: Uint8,
}
#[test]
fn bindgen_test_layout_SDL_Color() {
    const UNINIT: ::core::mem::MaybeUninit<SDL_Color> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<SDL_Color>(),
        4usize,
        concat!("Size of: ", stringify!(SDL_Color))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_Color>(),
        1usize,
        concat!("Alignment of ", stringify!(SDL_Color))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).r) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Color),
            "::",
            stringify!(r)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).g) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Color),
            "::",
            stringify!(g)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).b) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Color),
            "::",
            stringify!(b)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).a) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Color),
            "::",
            stringify!(a)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_Palette {
    pub ncolors: libc::c_int,
    pub colors: *mut SDL_Color,
    pub version: Uint32,
    pub refcount: libc::c_int,
}
#[test]
fn bindgen_test_layout_SDL_Palette() {
    const UNINIT: ::core::mem::MaybeUninit<SDL_Palette> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<SDL_Palette>(),
        16usize,
        concat!("Size of: ", stringify!(SDL_Palette))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_Palette>(),
        4usize,
        concat!("Alignment of ", stringify!(SDL_Palette))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ncolors) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Palette),
            "::",
            stringify!(ncolors)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).colors) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Palette),
            "::",
            stringify!(colors)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Palette),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).refcount) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Palette),
            "::",
            stringify!(refcount)
        )
    );
}
#[doc = "  \\note Everything in the pixel format structure is read-only."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_PixelFormat {
    pub format: Uint32,
    pub palette: *mut SDL_Palette,
    pub BitsPerPixel: Uint8,
    pub BytesPerPixel: Uint8,
    pub padding: [Uint8; 2usize],
    pub Rmask: Uint32,
    pub Gmask: Uint32,
    pub Bmask: Uint32,
    pub Amask: Uint32,
    pub Rloss: Uint8,
    pub Gloss: Uint8,
    pub Bloss: Uint8,
    pub Aloss: Uint8,
    pub Rshift: Uint8,
    pub Gshift: Uint8,
    pub Bshift: Uint8,
    pub Ashift: Uint8,
    pub refcount: libc::c_int,
    pub next: *mut SDL_PixelFormat,
}
#[test]
fn bindgen_test_layout_SDL_PixelFormat() {
    const UNINIT: ::core::mem::MaybeUninit<SDL_PixelFormat> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<SDL_PixelFormat>(),
        44usize,
        concat!("Size of: ", stringify!(SDL_PixelFormat))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_PixelFormat>(),
        4usize,
        concat!("Alignment of ", stringify!(SDL_PixelFormat))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).palette) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(palette)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BitsPerPixel) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(BitsPerPixel)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BytesPerPixel) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(BytesPerPixel)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).padding) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(padding)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Rmask) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Rmask)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Gmask) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Gmask)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Bmask) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Bmask)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Amask) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Amask)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Rloss) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Rloss)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Gloss) as usize - ptr as usize },
        29usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Gloss)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Bloss) as usize - ptr as usize },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Bloss)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Aloss) as usize - ptr as usize },
        31usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Aloss)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Rshift) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Rshift)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Gshift) as usize - ptr as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Gshift)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Bshift) as usize - ptr as usize },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Bshift)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Ashift) as usize - ptr as usize },
        35usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Ashift)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).refcount) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(refcount)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(next)
        )
    );
}
extern "C" {
    #[doc = " \\brief Get the human readable name of a pixel format"]
    pub fn SDL_GetPixelFormatName(format: Uint32) -> *const libc::c_char;
}
extern "C" {
    #[doc = "  \\brief Convert one of the enumerated pixel formats to a bpp and RGBA masks.\n\n  \\return SDL_TRUE, or SDL_FALSE if the conversion wasn't possible.\n\n  \\sa SDL_MasksToPixelFormatEnum()"]
    pub fn SDL_PixelFormatEnumToMasks(
        format: Uint32,
        bpp: *mut libc::c_int,
        Rmask: *mut Uint32,
        Gmask: *mut Uint32,
        Bmask: *mut Uint32,
        Amask: *mut Uint32,
    ) -> SDL_bool;
}
extern "C" {
    #[doc = "  \\brief Convert a bpp and RGBA masks to an enumerated pixel format.\n\n  \\return The pixel format, or ::SDL_PIXELFORMAT_UNKNOWN if the conversion\n          wasn't possible.\n\n  \\sa SDL_PixelFormatEnumToMasks()"]
    pub fn SDL_MasksToPixelFormatEnum(
        bpp: libc::c_int,
        Rmask: Uint32,
        Gmask: Uint32,
        Bmask: Uint32,
        Amask: Uint32,
    ) -> Uint32;
}
extern "C" {
    #[doc = "  \\brief Create an SDL_PixelFormat structure from a pixel format enum."]
    pub fn SDL_AllocFormat(pixel_format: Uint32) -> *mut SDL_PixelFormat;
}
extern "C" {
    #[doc = "  \\brief Free an SDL_PixelFormat structure."]
    pub fn SDL_FreeFormat(format: *mut SDL_PixelFormat);
}
extern "C" {
    #[doc = "  \\brief Create a palette structure with the specified number of color\n         entries.\n\n  \\return A new palette, or NULL if there wasn't enough memory.\n\n  \\note The palette entries are initialized to white.\n\n  \\sa SDL_FreePalette()"]
    pub fn SDL_AllocPalette(ncolors: libc::c_int) -> *mut SDL_Palette;
}
extern "C" {
    #[doc = "  \\brief Set the palette for a pixel format structure."]
    pub fn SDL_SetPixelFormatPalette(
        format: *mut SDL_PixelFormat,
        palette: *mut SDL_Palette,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Set a range of colors in a palette.\n\n  \\param palette    The palette to modify.\n  \\param colors     An array of colors to copy into the palette.\n  \\param firstcolor The index of the first palette entry to modify.\n  \\param ncolors    The number of entries to modify.\n\n  \\return 0 on success, or -1 if not all of the colors could be set."]
    pub fn SDL_SetPaletteColors(
        palette: *mut SDL_Palette,
        colors: *const SDL_Color,
        firstcolor: libc::c_int,
        ncolors: libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Free a palette created with SDL_AllocPalette().\n\n  \\sa SDL_AllocPalette()"]
    pub fn SDL_FreePalette(palette: *mut SDL_Palette);
}
extern "C" {
    #[doc = "  \\brief Maps an RGB triple to an opaque pixel value for a given pixel format.\n\n  \\sa SDL_MapRGBA"]
    pub fn SDL_MapRGB(format: *const SDL_PixelFormat, r: Uint8, g: Uint8, b: Uint8) -> Uint32;
}
extern "C" {
    #[doc = "  \\brief Maps an RGBA quadruple to a pixel value for a given pixel format.\n\n  \\sa SDL_MapRGB"]
    pub fn SDL_MapRGBA(
        format: *const SDL_PixelFormat,
        r: Uint8,
        g: Uint8,
        b: Uint8,
        a: Uint8,
    ) -> Uint32;
}
extern "C" {
    #[doc = "  \\brief Get the RGB components from a pixel of the specified format.\n\n  \\sa SDL_GetRGBA"]
    pub fn SDL_GetRGB(
        pixel: Uint32,
        format: *const SDL_PixelFormat,
        r: *mut Uint8,
        g: *mut Uint8,
        b: *mut Uint8,
    );
}
extern "C" {
    #[doc = "  \\brief Get the RGBA components from a pixel of the specified format.\n\n  \\sa SDL_GetRGB"]
    pub fn SDL_GetRGBA(
        pixel: Uint32,
        format: *const SDL_PixelFormat,
        r: *mut Uint8,
        g: *mut Uint8,
        b: *mut Uint8,
        a: *mut Uint8,
    );
}
extern "C" {
    #[doc = "  \\brief Calculate a 256 entry gamma ramp for a gamma value."]
    pub fn SDL_CalculateGammaRamp(gamma: f32, ramp: *mut Uint16);
}
#[doc = "  \\brief  The structure that defines a point (integer)\n\n  \\sa SDL_EnclosePoints\n  \\sa SDL_PointInRect"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_Point {
    pub x: libc::c_int,
    pub y: libc::c_int,
}
#[test]
fn bindgen_test_layout_SDL_Point() {
    const UNINIT: ::core::mem::MaybeUninit<SDL_Point> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<SDL_Point>(),
        8usize,
        concat!("Size of: ", stringify!(SDL_Point))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_Point>(),
        4usize,
        concat!("Alignment of ", stringify!(SDL_Point))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Point),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Point),
            "::",
            stringify!(y)
        )
    );
}
#[doc = "  \\brief  The structure that defines a point (floating point)\n\n  \\sa SDL_EnclosePoints\n  \\sa SDL_PointInRect"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_FPoint {
    pub x: f32,
    pub y: f32,
}
#[test]
fn bindgen_test_layout_SDL_FPoint() {
    const UNINIT: ::core::mem::MaybeUninit<SDL_FPoint> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<SDL_FPoint>(),
        8usize,
        concat!("Size of: ", stringify!(SDL_FPoint))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_FPoint>(),
        4usize,
        concat!("Alignment of ", stringify!(SDL_FPoint))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_FPoint),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_FPoint),
            "::",
            stringify!(y)
        )
    );
}
#[doc = "  \\brief A rectangle, with the origin at the upper left (integer).\n\n  \\sa SDL_RectEmpty\n  \\sa SDL_RectEquals\n  \\sa SDL_HasIntersection\n  \\sa SDL_IntersectRect\n  \\sa SDL_UnionRect\n  \\sa SDL_EnclosePoints"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_Rect {
    pub x: libc::c_int,
    pub y: libc::c_int,
    pub w: libc::c_int,
    pub h: libc::c_int,
}
#[test]
fn bindgen_test_layout_SDL_Rect() {
    const UNINIT: ::core::mem::MaybeUninit<SDL_Rect> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<SDL_Rect>(),
        16usize,
        concat!("Size of: ", stringify!(SDL_Rect))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_Rect>(),
        4usize,
        concat!("Alignment of ", stringify!(SDL_Rect))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Rect),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Rect),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).w) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Rect),
            "::",
            stringify!(w)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).h) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Rect),
            "::",
            stringify!(h)
        )
    );
}
#[doc = "  \\brief A rectangle, with the origin at the upper left (floating point)."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_FRect {
    pub x: f32,
    pub y: f32,
    pub w: f32,
    pub h: f32,
}
#[test]
fn bindgen_test_layout_SDL_FRect() {
    const UNINIT: ::core::mem::MaybeUninit<SDL_FRect> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<SDL_FRect>(),
        16usize,
        concat!("Size of: ", stringify!(SDL_FRect))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_FRect>(),
        4usize,
        concat!("Alignment of ", stringify!(SDL_FRect))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_FRect),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_FRect),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).w) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_FRect),
            "::",
            stringify!(w)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).h) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_FRect),
            "::",
            stringify!(h)
        )
    );
}
extern "C" {
    #[doc = "  \\brief Determine whether two rectangles intersect.\n\n  \\return SDL_TRUE if there is an intersection, SDL_FALSE otherwise."]
    pub fn SDL_HasIntersection(A: *const SDL_Rect, B: *const SDL_Rect) -> SDL_bool;
}
extern "C" {
    #[doc = "  \\brief Calculate the intersection of two rectangles.\n\n  \\return SDL_TRUE if there is an intersection, SDL_FALSE otherwise."]
    pub fn SDL_IntersectRect(
        A: *const SDL_Rect,
        B: *const SDL_Rect,
        result: *mut SDL_Rect,
    ) -> SDL_bool;
}
extern "C" {
    #[doc = "  \\brief Calculate the union of two rectangles."]
    pub fn SDL_UnionRect(A: *const SDL_Rect, B: *const SDL_Rect, result: *mut SDL_Rect);
}
extern "C" {
    #[doc = "  \\brief Calculate a minimal rectangle enclosing a set of points\n\n  \\return SDL_TRUE if any points were within the clipping rect"]
    pub fn SDL_EnclosePoints(
        points: *const SDL_Point,
        count: libc::c_int,
        clip: *const SDL_Rect,
        result: *mut SDL_Rect,
    ) -> SDL_bool;
}
extern "C" {
    #[doc = "  \\brief Calculate the intersection of a rectangle and line segment.\n\n  \\return SDL_TRUE if there is an intersection, SDL_FALSE otherwise."]
    pub fn SDL_IntersectRectAndLine(
        rect: *const SDL_Rect,
        X1: *mut libc::c_int,
        Y1: *mut libc::c_int,
        X2: *mut libc::c_int,
        Y2: *mut libc::c_int,
    ) -> SDL_bool;
}
#[doc = "< no blending\ndstRGBA = srcRGBA"]
pub const SDL_BlendMode_SDL_BLENDMODE_NONE: SDL_BlendMode = 0;
#[doc = "< alpha blending\ndstRGB = (srcRGB * srcA) + (dstRGB * (1-srcA))\ndstA = srcA + (dstA * (1-srcA))"]
pub const SDL_BlendMode_SDL_BLENDMODE_BLEND: SDL_BlendMode = 1;
#[doc = "< additive blending\ndstRGB = (srcRGB * srcA) + dstRGB\ndstA = dstA"]
pub const SDL_BlendMode_SDL_BLENDMODE_ADD: SDL_BlendMode = 2;
#[doc = "< color modulate\ndstRGB = srcRGB * dstRGB\ndstA = dstA"]
pub const SDL_BlendMode_SDL_BLENDMODE_MOD: SDL_BlendMode = 4;
pub const SDL_BlendMode_SDL_BLENDMODE_INVALID: SDL_BlendMode = 2147483647;
#[doc = "  \\brief The blend mode used in SDL_RenderCopy() and drawing operations."]
pub type SDL_BlendMode = libc::c_int;
#[doc = "< dst + src: supported by all renderers"]
pub const SDL_BlendOperation_SDL_BLENDOPERATION_ADD: SDL_BlendOperation = 1;
#[doc = "< dst - src : supported by D3D9, D3D11, OpenGL, OpenGLES"]
pub const SDL_BlendOperation_SDL_BLENDOPERATION_SUBTRACT: SDL_BlendOperation = 2;
#[doc = "< src - dst : supported by D3D9, D3D11, OpenGL, OpenGLES"]
pub const SDL_BlendOperation_SDL_BLENDOPERATION_REV_SUBTRACT: SDL_BlendOperation = 3;
#[doc = "< min(dst, src) : supported by D3D11"]
pub const SDL_BlendOperation_SDL_BLENDOPERATION_MINIMUM: SDL_BlendOperation = 4;
#[doc = "< max(dst, src) : supported by D3D11"]
pub const SDL_BlendOperation_SDL_BLENDOPERATION_MAXIMUM: SDL_BlendOperation = 5;
#[doc = "  \\brief The blend operation used when combining source and destination pixel components"]
pub type SDL_BlendOperation = libc::c_int;
#[doc = "< 0, 0, 0, 0"]
pub const SDL_BlendFactor_SDL_BLENDFACTOR_ZERO: SDL_BlendFactor = 1;
#[doc = "< 1, 1, 1, 1"]
pub const SDL_BlendFactor_SDL_BLENDFACTOR_ONE: SDL_BlendFactor = 2;
#[doc = "< srcR, srcG, srcB, srcA"]
pub const SDL_BlendFactor_SDL_BLENDFACTOR_SRC_COLOR: SDL_BlendFactor = 3;
#[doc = "< 1-srcR, 1-srcG, 1-srcB, 1-srcA"]
pub const SDL_BlendFactor_SDL_BLENDFACTOR_ONE_MINUS_SRC_COLOR: SDL_BlendFactor = 4;
#[doc = "< srcA, srcA, srcA, srcA"]
pub const SDL_BlendFactor_SDL_BLENDFACTOR_SRC_ALPHA: SDL_BlendFactor = 5;
#[doc = "< 1-srcA, 1-srcA, 1-srcA, 1-srcA"]
pub const SDL_BlendFactor_SDL_BLENDFACTOR_ONE_MINUS_SRC_ALPHA: SDL_BlendFactor = 6;
#[doc = "< dstR, dstG, dstB, dstA"]
pub const SDL_BlendFactor_SDL_BLENDFACTOR_DST_COLOR: SDL_BlendFactor = 7;
#[doc = "< 1-dstR, 1-dstG, 1-dstB, 1-dstA"]
pub const SDL_BlendFactor_SDL_BLENDFACTOR_ONE_MINUS_DST_COLOR: SDL_BlendFactor = 8;
#[doc = "< dstA, dstA, dstA, dstA"]
pub const SDL_BlendFactor_SDL_BLENDFACTOR_DST_ALPHA: SDL_BlendFactor = 9;
#[doc = "< 1-dstA, 1-dstA, 1-dstA, 1-dstA"]
pub const SDL_BlendFactor_SDL_BLENDFACTOR_ONE_MINUS_DST_ALPHA: SDL_BlendFactor = 10;
#[doc = "  \\brief The normalized factor used to multiply pixel components"]
pub type SDL_BlendFactor = libc::c_int;
extern "C" {
    #[doc = "  \\brief Create a custom blend mode, which may or may not be supported by a given renderer\n\n  \\param srcColorFactor source color factor\n  \\param dstColorFactor destination color factor\n  \\param colorOperation color operation\n  \\param srcAlphaFactor source alpha factor\n  \\param dstAlphaFactor destination alpha factor\n  \\param alphaOperation alpha operation\n\n  The result of the blend mode operation will be:\n      dstRGB = dstRGB * dstColorFactor colorOperation srcRGB * srcColorFactor\n  and\n      dstA = dstA * dstAlphaFactor alphaOperation srcA * srcAlphaFactor"]
    pub fn SDL_ComposeCustomBlendMode(
        srcColorFactor: SDL_BlendFactor,
        dstColorFactor: SDL_BlendFactor,
        colorOperation: SDL_BlendOperation,
        srcAlphaFactor: SDL_BlendFactor,
        dstAlphaFactor: SDL_BlendFactor,
        alphaOperation: SDL_BlendOperation,
    ) -> SDL_BlendMode;
}
#[doc = " \\brief A collection of pixels used in software blitting.\n\n \\note  This structure should be treated as read-only, except for \\c pixels,\n        which, if not NULL, contains the raw pixel data for the surface."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_Surface {
    #[doc = "< Read-only"]
    pub flags: Uint32,
    #[doc = "< Read-only"]
    pub format: *mut SDL_PixelFormat,
    #[doc = "< Read-only"]
    pub w: libc::c_int,
    #[doc = "< Read-only"]
    pub h: libc::c_int,
    #[doc = "< Read-only"]
    pub pitch: libc::c_int,
    #[doc = "< Read-write"]
    pub pixels: *mut libc::c_void,
    #[doc = "< Read-write"]
    pub userdata: *mut libc::c_void,
    #[doc = "< Read-only"]
    pub locked: libc::c_int,
    #[doc = "< Read-only"]
    pub lock_data: *mut libc::c_void,
    #[doc = "< Read-only"]
    pub clip_rect: SDL_Rect,
    #[doc = "< Private"]
    pub map: *mut SDL_BlitMap,
    #[doc = "< Read-mostly"]
    pub refcount: libc::c_int,
}
#[test]
fn bindgen_test_layout_SDL_Surface() {
    const UNINIT: ::core::mem::MaybeUninit<SDL_Surface> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<SDL_Surface>(),
        60usize,
        concat!("Size of: ", stringify!(SDL_Surface))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_Surface>(),
        4usize,
        concat!("Alignment of ", stringify!(SDL_Surface))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).w) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(w)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).h) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(h)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pitch) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(pitch)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pixels) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(pixels)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).userdata) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(userdata)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).locked) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(locked)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lock_data) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(lock_data)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).clip_rect) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(clip_rect)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).map) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(map)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).refcount) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(refcount)
        )
    );
}
#[doc = " \\brief The type of function used for surface blitting functions."]
pub type SDL_blit = ::core::option::Option<
    unsafe extern "C" fn(
        src: *mut SDL_Surface,
        srcrect: *mut SDL_Rect,
        dst: *mut SDL_Surface,
        dstrect: *mut SDL_Rect,
    ) -> libc::c_int,
>;
#[doc = "< Full range JPEG"]
pub const SDL_YUV_CONVERSION_MODE_SDL_YUV_CONVERSION_JPEG: SDL_YUV_CONVERSION_MODE = 0;
#[doc = "< BT.601 (the default)"]
pub const SDL_YUV_CONVERSION_MODE_SDL_YUV_CONVERSION_BT601: SDL_YUV_CONVERSION_MODE = 1;
#[doc = "< BT.709"]
pub const SDL_YUV_CONVERSION_MODE_SDL_YUV_CONVERSION_BT709: SDL_YUV_CONVERSION_MODE = 2;
#[doc = "< BT.601 for SD content, BT.709 for HD content"]
pub const SDL_YUV_CONVERSION_MODE_SDL_YUV_CONVERSION_AUTOMATIC: SDL_YUV_CONVERSION_MODE = 3;
#[doc = " \\brief The formula used for converting between YUV and RGB"]
pub type SDL_YUV_CONVERSION_MODE = libc::c_int;
extern "C" {
    #[doc = "  Allocate and free an RGB surface.\n\n  If the depth is 4 or 8 bits, an empty palette is allocated for the surface.\n  If the depth is greater than 8 bits, the pixel format is set using the\n  flags '[RGB]mask'.\n\n  If the function runs out of memory, it will return NULL.\n\n  \\param flags The \\c flags are obsolete and should be set to 0.\n  \\param width The width in pixels of the surface to create.\n  \\param height The height in pixels of the surface to create.\n  \\param depth The depth in bits of the surface to create.\n  \\param Rmask The red mask of the surface to create.\n  \\param Gmask The green mask of the surface to create.\n  \\param Bmask The blue mask of the surface to create.\n  \\param Amask The alpha mask of the surface to create."]
    pub fn SDL_CreateRGBSurface(
        flags: Uint32,
        width: libc::c_int,
        height: libc::c_int,
        depth: libc::c_int,
        Rmask: Uint32,
        Gmask: Uint32,
        Bmask: Uint32,
        Amask: Uint32,
    ) -> *mut SDL_Surface;
}
extern "C" {
    pub fn SDL_CreateRGBSurfaceWithFormat(
        flags: Uint32,
        width: libc::c_int,
        height: libc::c_int,
        depth: libc::c_int,
        format: Uint32,
    ) -> *mut SDL_Surface;
}
extern "C" {
    pub fn SDL_CreateRGBSurfaceFrom(
        pixels: *mut libc::c_void,
        width: libc::c_int,
        height: libc::c_int,
        depth: libc::c_int,
        pitch: libc::c_int,
        Rmask: Uint32,
        Gmask: Uint32,
        Bmask: Uint32,
        Amask: Uint32,
    ) -> *mut SDL_Surface;
}
extern "C" {
    pub fn SDL_CreateRGBSurfaceWithFormatFrom(
        pixels: *mut libc::c_void,
        width: libc::c_int,
        height: libc::c_int,
        depth: libc::c_int,
        pitch: libc::c_int,
        format: Uint32,
    ) -> *mut SDL_Surface;
}
extern "C" {
    pub fn SDL_FreeSurface(surface: *mut SDL_Surface);
}
extern "C" {
    #[doc = "  \\brief Set the palette used by a surface.\n\n  \\return 0, or -1 if the surface format doesn't use a palette.\n\n  \\note A single palette can be shared with many surfaces."]
    pub fn SDL_SetSurfacePalette(
        surface: *mut SDL_Surface,
        palette: *mut SDL_Palette,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Sets up a surface for directly accessing the pixels.\n\n  Between calls to SDL_LockSurface() / SDL_UnlockSurface(), you can write\n  to and read from \\c surface->pixels, using the pixel format stored in\n  \\c surface->format.  Once you are done accessing the surface, you should\n  use SDL_UnlockSurface() to release it.\n\n  Not all surfaces require locking.  If SDL_MUSTLOCK(surface) evaluates\n  to 0, then you can read and write to the surface at any time, and the\n  pixel format of the surface will not change.\n\n  No operating system or library calls should be made between lock/unlock\n  pairs, as critical system locks may be held during this time.\n\n  SDL_LockSurface() returns 0, or -1 if the surface couldn't be locked.\n\n  \\sa SDL_UnlockSurface()"]
    pub fn SDL_LockSurface(surface: *mut SDL_Surface) -> libc::c_int;
}
extern "C" {
    #[doc = " \\sa SDL_LockSurface()"]
    pub fn SDL_UnlockSurface(surface: *mut SDL_Surface);
}
extern "C" {
    #[doc = "  Load a surface from a seekable SDL data stream (memory or file).\n\n  If \\c freesrc is non-zero, the stream will be closed after being read.\n\n  The new surface should be freed with SDL_FreeSurface().\n\n  \\return the new surface, or NULL if there was an error."]
    pub fn SDL_LoadBMP_RW(src: *mut SDL_RWops, freesrc: libc::c_int) -> *mut SDL_Surface;
}
extern "C" {
    #[doc = "  Save a surface to a seekable SDL data stream (memory or file).\n\n  Surfaces with a 24-bit, 32-bit and paletted 8-bit format get saved in the\n  BMP directly. Other RGB formats with 8-bit or higher get converted to a\n  24-bit surface or, if they have an alpha mask or a colorkey, to a 32-bit\n  surface before they are saved. YUV and paletted 1-bit and 4-bit formats are\n  not supported.\n\n  If \\c freedst is non-zero, the stream will be closed after being written.\n\n  \\return 0 if successful or -1 if there was an error."]
    pub fn SDL_SaveBMP_RW(
        surface: *mut SDL_Surface,
        dst: *mut SDL_RWops,
        freedst: libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Sets the RLE acceleration hint for a surface.\n\n  \\return 0 on success, or -1 if the surface is not valid\n\n  \\note If RLE is enabled, colorkey and alpha blending blits are much faster,\n        but the surface must be locked before directly accessing the pixels."]
    pub fn SDL_SetSurfaceRLE(surface: *mut SDL_Surface, flag: libc::c_int) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Sets the color key (transparent pixel) in a blittable surface.\n\n  \\param surface The surface to update\n  \\param flag Non-zero to enable colorkey and 0 to disable colorkey\n  \\param key The transparent pixel in the native surface format\n\n  \\return 0 on success, or -1 if the surface is not valid\n\n  You can pass SDL_RLEACCEL to enable RLE accelerated blits."]
    pub fn SDL_SetColorKey(
        surface: *mut SDL_Surface,
        flag: libc::c_int,
        key: Uint32,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Returns whether the surface has a color key\n\n  \\return SDL_TRUE if the surface has a color key, or SDL_FALSE if the surface is NULL or has no color key"]
    pub fn SDL_HasColorKey(surface: *mut SDL_Surface) -> SDL_bool;
}
extern "C" {
    #[doc = "  \\brief Gets the color key (transparent pixel) in a blittable surface.\n\n  \\param surface The surface to update\n  \\param key A pointer filled in with the transparent pixel in the native\n             surface format\n\n  \\return 0 on success, or -1 if the surface is not valid or colorkey is not\n          enabled."]
    pub fn SDL_GetColorKey(surface: *mut SDL_Surface, key: *mut Uint32) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Set an additional color value used in blit operations.\n\n  \\param surface The surface to update.\n  \\param r The red color value multiplied into blit operations.\n  \\param g The green color value multiplied into blit operations.\n  \\param b The blue color value multiplied into blit operations.\n\n  \\return 0 on success, or -1 if the surface is not valid.\n\n  \\sa SDL_GetSurfaceColorMod()"]
    pub fn SDL_SetSurfaceColorMod(
        surface: *mut SDL_Surface,
        r: Uint8,
        g: Uint8,
        b: Uint8,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Get the additional color value used in blit operations.\n\n  \\param surface The surface to query.\n  \\param r A pointer filled in with the current red color value.\n  \\param g A pointer filled in with the current green color value.\n  \\param b A pointer filled in with the current blue color value.\n\n  \\return 0 on success, or -1 if the surface is not valid.\n\n  \\sa SDL_SetSurfaceColorMod()"]
    pub fn SDL_GetSurfaceColorMod(
        surface: *mut SDL_Surface,
        r: *mut Uint8,
        g: *mut Uint8,
        b: *mut Uint8,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Set an additional alpha value used in blit operations.\n\n  \\param surface The surface to update.\n  \\param alpha The alpha value multiplied into blit operations.\n\n  \\return 0 on success, or -1 if the surface is not valid.\n\n  \\sa SDL_GetSurfaceAlphaMod()"]
    pub fn SDL_SetSurfaceAlphaMod(surface: *mut SDL_Surface, alpha: Uint8) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Get the additional alpha value used in blit operations.\n\n  \\param surface The surface to query.\n  \\param alpha A pointer filled in with the current alpha value.\n\n  \\return 0 on success, or -1 if the surface is not valid.\n\n  \\sa SDL_SetSurfaceAlphaMod()"]
    pub fn SDL_GetSurfaceAlphaMod(surface: *mut SDL_Surface, alpha: *mut Uint8) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Set the blend mode used for blit operations.\n\n  \\param surface The surface to update.\n  \\param blendMode ::SDL_BlendMode to use for blit blending.\n\n  \\return 0 on success, or -1 if the parameters are not valid.\n\n  \\sa SDL_GetSurfaceBlendMode()"]
    pub fn SDL_SetSurfaceBlendMode(
        surface: *mut SDL_Surface,
        blendMode: SDL_BlendMode,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Get the blend mode used for blit operations.\n\n  \\param surface   The surface to query.\n  \\param blendMode A pointer filled in with the current blend mode.\n\n  \\return 0 on success, or -1 if the surface is not valid.\n\n  \\sa SDL_SetSurfaceBlendMode()"]
    pub fn SDL_GetSurfaceBlendMode(
        surface: *mut SDL_Surface,
        blendMode: *mut SDL_BlendMode,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  Sets the clipping rectangle for the destination surface in a blit.\n\n  If the clip rectangle is NULL, clipping will be disabled.\n\n  If the clip rectangle doesn't intersect the surface, the function will\n  return SDL_FALSE and blits will be completely clipped.  Otherwise the\n  function returns SDL_TRUE and blits to the surface will be clipped to\n  the intersection of the surface area and the clipping rectangle.\n\n  Note that blits are automatically clipped to the edges of the source\n  and destination surfaces."]
    pub fn SDL_SetClipRect(surface: *mut SDL_Surface, rect: *const SDL_Rect) -> SDL_bool;
}
extern "C" {
    #[doc = "  Gets the clipping rectangle for the destination surface in a blit.\n\n  \\c rect must be a pointer to a valid rectangle which will be filled\n  with the correct values."]
    pub fn SDL_GetClipRect(surface: *mut SDL_Surface, rect: *mut SDL_Rect);
}
extern "C" {
    pub fn SDL_DuplicateSurface(surface: *mut SDL_Surface) -> *mut SDL_Surface;
}
extern "C" {
    #[doc = "  Creates a new surface of the specified format, and then copies and maps\n  the given surface to it so the blit of the converted surface will be as\n  fast as possible.  If this function fails, it returns NULL.\n\n  The \\c flags parameter is passed to SDL_CreateRGBSurface() and has those\n  semantics.  You can also pass ::SDL_RLEACCEL in the flags parameter and\n  SDL will try to RLE accelerate colorkey and alpha blits in the resulting\n  surface."]
    pub fn SDL_ConvertSurface(
        src: *mut SDL_Surface,
        fmt: *const SDL_PixelFormat,
        flags: Uint32,
    ) -> *mut SDL_Surface;
}
extern "C" {
    pub fn SDL_ConvertSurfaceFormat(
        src: *mut SDL_Surface,
        pixel_format: Uint32,
        flags: Uint32,
    ) -> *mut SDL_Surface;
}
extern "C" {
    #[doc = " \\brief Copy a block of pixels of one format to another format\n\n  \\return 0 on success, or -1 if there was an error"]
    pub fn SDL_ConvertPixels(
        width: libc::c_int,
        height: libc::c_int,
        src_format: Uint32,
        src: *const libc::c_void,
        src_pitch: libc::c_int,
        dst_format: Uint32,
        dst: *mut libc::c_void,
        dst_pitch: libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  Performs a fast fill of the given rectangle with \\c color.\n\n  If \\c rect is NULL, the whole surface will be filled with \\c color.\n\n  The color should be a pixel of the format used by the surface, and\n  can be generated by the SDL_MapRGB() function.\n\n  \\return 0 on success, or -1 on error."]
    pub fn SDL_FillRect(dst: *mut SDL_Surface, rect: *const SDL_Rect, color: Uint32)
        -> libc::c_int;
}
extern "C" {
    pub fn SDL_FillRects(
        dst: *mut SDL_Surface,
        rects: *const SDL_Rect,
        count: libc::c_int,
        color: Uint32,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  This is the public blit function, SDL_BlitSurface(), and it performs\n  rectangle validation and clipping before passing it to SDL_LowerBlit()"]
    pub fn SDL_UpperBlit(
        src: *mut SDL_Surface,
        srcrect: *const SDL_Rect,
        dst: *mut SDL_Surface,
        dstrect: *mut SDL_Rect,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  This is a semi-private blit function and it performs low-level surface\n  blitting only."]
    pub fn SDL_LowerBlit(
        src: *mut SDL_Surface,
        srcrect: *mut SDL_Rect,
        dst: *mut SDL_Surface,
        dstrect: *mut SDL_Rect,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Perform a fast, low quality, stretch blit between two surfaces of the\n         same pixel format.\n\n  \\note This function uses a static buffer, and is not thread-safe."]
    pub fn SDL_SoftStretch(
        src: *mut SDL_Surface,
        srcrect: *const SDL_Rect,
        dst: *mut SDL_Surface,
        dstrect: *const SDL_Rect,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  This is the public scaled blit function, SDL_BlitScaled(), and it performs\n  rectangle validation and clipping before passing it to SDL_LowerBlitScaled()"]
    pub fn SDL_UpperBlitScaled(
        src: *mut SDL_Surface,
        srcrect: *const SDL_Rect,
        dst: *mut SDL_Surface,
        dstrect: *mut SDL_Rect,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  This is a semi-private blit function and it performs low-level surface\n  scaled blitting only."]
    pub fn SDL_LowerBlitScaled(
        src: *mut SDL_Surface,
        srcrect: *mut SDL_Rect,
        dst: *mut SDL_Surface,
        dstrect: *mut SDL_Rect,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Set the YUV conversion mode"]
    pub fn SDL_SetYUVConversionMode(mode: SDL_YUV_CONVERSION_MODE);
}
extern "C" {
    #[doc = "  \\brief Get the YUV conversion mode"]
    pub fn SDL_GetYUVConversionMode() -> SDL_YUV_CONVERSION_MODE;
}
extern "C" {
    #[doc = "  \\brief Get the YUV conversion mode, returning the correct mode for the resolution when the current conversion mode is SDL_YUV_CONVERSION_AUTOMATIC"]
    pub fn SDL_GetYUVConversionModeForResolution(
        width: libc::c_int,
        height: libc::c_int,
    ) -> SDL_YUV_CONVERSION_MODE;
}
#[doc = "  \\brief  The structure that defines a display mode\n\n  \\sa SDL_GetNumDisplayModes()\n  \\sa SDL_GetDisplayMode()\n  \\sa SDL_GetDesktopDisplayMode()\n  \\sa SDL_GetCurrentDisplayMode()\n  \\sa SDL_GetClosestDisplayMode()\n  \\sa SDL_SetWindowDisplayMode()\n  \\sa SDL_GetWindowDisplayMode()"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_DisplayMode {
    #[doc = "< pixel format"]
    pub format: Uint32,
    #[doc = "< width, in screen coordinates"]
    pub w: libc::c_int,
    #[doc = "< height, in screen coordinates"]
    pub h: libc::c_int,
    #[doc = "< refresh rate (or zero for unspecified)"]
    pub refresh_rate: libc::c_int,
    #[doc = "< driver-specific data, initialize to 0"]
    pub driverdata: *mut libc::c_void,
}
#[test]
fn bindgen_test_layout_SDL_DisplayMode() {
    const UNINIT: ::core::mem::MaybeUninit<SDL_DisplayMode> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<SDL_DisplayMode>(),
        20usize,
        concat!("Size of: ", stringify!(SDL_DisplayMode))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_DisplayMode>(),
        4usize,
        concat!("Alignment of ", stringify!(SDL_DisplayMode))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_DisplayMode),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).w) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_DisplayMode),
            "::",
            stringify!(w)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).h) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_DisplayMode),
            "::",
            stringify!(h)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).refresh_rate) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_DisplayMode),
            "::",
            stringify!(refresh_rate)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).driverdata) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_DisplayMode),
            "::",
            stringify!(driverdata)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_Window {
    _unused: [u8; 0],
}
#[doc = "< fullscreen window"]
pub const SDL_WindowFlags_SDL_WINDOW_FULLSCREEN: SDL_WindowFlags = 1;
#[doc = "< window usable with OpenGL context"]
pub const SDL_WindowFlags_SDL_WINDOW_OPENGL: SDL_WindowFlags = 2;
#[doc = "< window is visible"]
pub const SDL_WindowFlags_SDL_WINDOW_SHOWN: SDL_WindowFlags = 4;
#[doc = "< window is not visible"]
pub const SDL_WindowFlags_SDL_WINDOW_HIDDEN: SDL_WindowFlags = 8;
#[doc = "< no window decoration"]
pub const SDL_WindowFlags_SDL_WINDOW_BORDERLESS: SDL_WindowFlags = 16;
#[doc = "< window can be resized"]
pub const SDL_WindowFlags_SDL_WINDOW_RESIZABLE: SDL_WindowFlags = 32;
#[doc = "< window is minimized"]
pub const SDL_WindowFlags_SDL_WINDOW_MINIMIZED: SDL_WindowFlags = 64;
#[doc = "< window is maximized"]
pub const SDL_WindowFlags_SDL_WINDOW_MAXIMIZED: SDL_WindowFlags = 128;
#[doc = "< window has grabbed input focus"]
pub const SDL_WindowFlags_SDL_WINDOW_INPUT_GRABBED: SDL_WindowFlags = 256;
#[doc = "< window has input focus"]
pub const SDL_WindowFlags_SDL_WINDOW_INPUT_FOCUS: SDL_WindowFlags = 512;
#[doc = "< window has mouse focus"]
pub const SDL_WindowFlags_SDL_WINDOW_MOUSE_FOCUS: SDL_WindowFlags = 1024;
pub const SDL_WindowFlags_SDL_WINDOW_FULLSCREEN_DESKTOP: SDL_WindowFlags = 4097;
#[doc = "< window not created by SDL"]
pub const SDL_WindowFlags_SDL_WINDOW_FOREIGN: SDL_WindowFlags = 2048;
#[doc = "< window should be created in high-DPI mode if supported.\nOn macOS NSHighResolutionCapable must be set true in the\napplication's Info.plist for this to have any effect."]
pub const SDL_WindowFlags_SDL_WINDOW_ALLOW_HIGHDPI: SDL_WindowFlags = 8192;
#[doc = "< window has mouse captured (unrelated to INPUT_GRABBED)"]
pub const SDL_WindowFlags_SDL_WINDOW_MOUSE_CAPTURE: SDL_WindowFlags = 16384;
#[doc = "< window should always be above others"]
pub const SDL_WindowFlags_SDL_WINDOW_ALWAYS_ON_TOP: SDL_WindowFlags = 32768;
#[doc = "< window should not be added to the taskbar"]
pub const SDL_WindowFlags_SDL_WINDOW_SKIP_TASKBAR: SDL_WindowFlags = 65536;
#[doc = "< window should be treated as a utility window"]
pub const SDL_WindowFlags_SDL_WINDOW_UTILITY: SDL_WindowFlags = 131072;
#[doc = "< window should be treated as a tooltip"]
pub const SDL_WindowFlags_SDL_WINDOW_TOOLTIP: SDL_WindowFlags = 262144;
#[doc = "< window should be treated as a popup menu"]
pub const SDL_WindowFlags_SDL_WINDOW_POPUP_MENU: SDL_WindowFlags = 524288;
#[doc = "< window usable for Vulkan surface"]
pub const SDL_WindowFlags_SDL_WINDOW_VULKAN: SDL_WindowFlags = 268435456;
#[doc = "  \\brief The flags on a window\n\n  \\sa SDL_GetWindowFlags()"]
pub type SDL_WindowFlags = libc::c_int;
#[doc = "< Never used"]
pub const SDL_WindowEventID_SDL_WINDOWEVENT_NONE: SDL_WindowEventID = 0;
#[doc = "< Window has been shown"]
pub const SDL_WindowEventID_SDL_WINDOWEVENT_SHOWN: SDL_WindowEventID = 1;
#[doc = "< Window has been hidden"]
pub const SDL_WindowEventID_SDL_WINDOWEVENT_HIDDEN: SDL_WindowEventID = 2;
#[doc = "< Window has been exposed and should be\nredrawn"]
pub const SDL_WindowEventID_SDL_WINDOWEVENT_EXPOSED: SDL_WindowEventID = 3;
#[doc = "< Window has been moved to data1, data2"]
pub const SDL_WindowEventID_SDL_WINDOWEVENT_MOVED: SDL_WindowEventID = 4;
#[doc = "< Window has been resized to data1xdata2"]
pub const SDL_WindowEventID_SDL_WINDOWEVENT_RESIZED: SDL_WindowEventID = 5;
#[doc = "< The window size has changed, either as\na result of an API call or through the\nsystem or user changing the window size."]
pub const SDL_WindowEventID_SDL_WINDOWEVENT_SIZE_CHANGED: SDL_WindowEventID = 6;
#[doc = "< Window has been minimized"]
pub const SDL_WindowEventID_SDL_WINDOWEVENT_MINIMIZED: SDL_WindowEventID = 7;
#[doc = "< Window has been maximized"]
pub const SDL_WindowEventID_SDL_WINDOWEVENT_MAXIMIZED: SDL_WindowEventID = 8;
#[doc = "< Window has been restored to normal size\nand position"]
pub const SDL_WindowEventID_SDL_WINDOWEVENT_RESTORED: SDL_WindowEventID = 9;
#[doc = "< Window has gained mouse focus"]
pub const SDL_WindowEventID_SDL_WINDOWEVENT_ENTER: SDL_WindowEventID = 10;
#[doc = "< Window has lost mouse focus"]
pub const SDL_WindowEventID_SDL_WINDOWEVENT_LEAVE: SDL_WindowEventID = 11;
#[doc = "< Window has gained keyboard focus"]
pub const SDL_WindowEventID_SDL_WINDOWEVENT_FOCUS_GAINED: SDL_WindowEventID = 12;
#[doc = "< Window has lost keyboard focus"]
pub const SDL_WindowEventID_SDL_WINDOWEVENT_FOCUS_LOST: SDL_WindowEventID = 13;
#[doc = "< The window manager requests that the window be closed"]
pub const SDL_WindowEventID_SDL_WINDOWEVENT_CLOSE: SDL_WindowEventID = 14;
#[doc = "< Window is being offered a focus (should SetWindowInputFocus() on itself or a subwindow, or ignore)"]
pub const SDL_WindowEventID_SDL_WINDOWEVENT_TAKE_FOCUS: SDL_WindowEventID = 15;
#[doc = "< Window had a hit test that wasn't SDL_HITTEST_NORMAL."]
pub const SDL_WindowEventID_SDL_WINDOWEVENT_HIT_TEST: SDL_WindowEventID = 16;
#[doc = "  \\brief Event subtype for window events"]
pub type SDL_WindowEventID = libc::c_int;
#[doc = "< Never used"]
pub const SDL_DisplayEventID_SDL_DISPLAYEVENT_NONE: SDL_DisplayEventID = 0;
#[doc = "< Display orientation has changed to data1"]
pub const SDL_DisplayEventID_SDL_DISPLAYEVENT_ORIENTATION: SDL_DisplayEventID = 1;
#[doc = "  \\brief Event subtype for display events"]
pub type SDL_DisplayEventID = libc::c_int;
#[doc = "< The display orientation can't be determined"]
pub const SDL_DisplayOrientation_SDL_ORIENTATION_UNKNOWN: SDL_DisplayOrientation = 0;
#[doc = "< The display is in landscape mode, with the right side up, relative to portrait mode"]
pub const SDL_DisplayOrientation_SDL_ORIENTATION_LANDSCAPE: SDL_DisplayOrientation = 1;
#[doc = "< The display is in landscape mode, with the left side up, relative to portrait mode"]
pub const SDL_DisplayOrientation_SDL_ORIENTATION_LANDSCAPE_FLIPPED: SDL_DisplayOrientation = 2;
#[doc = "< The display is in portrait mode"]
pub const SDL_DisplayOrientation_SDL_ORIENTATION_PORTRAIT: SDL_DisplayOrientation = 3;
#[doc = "< The display is in portrait mode, upside down"]
pub const SDL_DisplayOrientation_SDL_ORIENTATION_PORTRAIT_FLIPPED: SDL_DisplayOrientation = 4;
pub type SDL_DisplayOrientation = libc::c_int;
#[doc = "  \\brief An opaque handle to an OpenGL context."]
pub type SDL_GLContext = *mut libc::c_void;
pub const SDL_GLattr_SDL_GL_RED_SIZE: SDL_GLattr = 0;
pub const SDL_GLattr_SDL_GL_GREEN_SIZE: SDL_GLattr = 1;
pub const SDL_GLattr_SDL_GL_BLUE_SIZE: SDL_GLattr = 2;
pub const SDL_GLattr_SDL_GL_ALPHA_SIZE: SDL_GLattr = 3;
pub const SDL_GLattr_SDL_GL_BUFFER_SIZE: SDL_GLattr = 4;
pub const SDL_GLattr_SDL_GL_DOUBLEBUFFER: SDL_GLattr = 5;
pub const SDL_GLattr_SDL_GL_DEPTH_SIZE: SDL_GLattr = 6;
pub const SDL_GLattr_SDL_GL_STENCIL_SIZE: SDL_GLattr = 7;
pub const SDL_GLattr_SDL_GL_ACCUM_RED_SIZE: SDL_GLattr = 8;
pub const SDL_GLattr_SDL_GL_ACCUM_GREEN_SIZE: SDL_GLattr = 9;
pub const SDL_GLattr_SDL_GL_ACCUM_BLUE_SIZE: SDL_GLattr = 10;
pub const SDL_GLattr_SDL_GL_ACCUM_ALPHA_SIZE: SDL_GLattr = 11;
pub const SDL_GLattr_SDL_GL_STEREO: SDL_GLattr = 12;
pub const SDL_GLattr_SDL_GL_MULTISAMPLEBUFFERS: SDL_GLattr = 13;
pub const SDL_GLattr_SDL_GL_MULTISAMPLESAMPLES: SDL_GLattr = 14;
pub const SDL_GLattr_SDL_GL_ACCELERATED_VISUAL: SDL_GLattr = 15;
pub const SDL_GLattr_SDL_GL_RETAINED_BACKING: SDL_GLattr = 16;
pub const SDL_GLattr_SDL_GL_CONTEXT_MAJOR_VERSION: SDL_GLattr = 17;
pub const SDL_GLattr_SDL_GL_CONTEXT_MINOR_VERSION: SDL_GLattr = 18;
pub const SDL_GLattr_SDL_GL_CONTEXT_EGL: SDL_GLattr = 19;
pub const SDL_GLattr_SDL_GL_CONTEXT_FLAGS: SDL_GLattr = 20;
pub const SDL_GLattr_SDL_GL_CONTEXT_PROFILE_MASK: SDL_GLattr = 21;
pub const SDL_GLattr_SDL_GL_SHARE_WITH_CURRENT_CONTEXT: SDL_GLattr = 22;
pub const SDL_GLattr_SDL_GL_FRAMEBUFFER_SRGB_CAPABLE: SDL_GLattr = 23;
pub const SDL_GLattr_SDL_GL_CONTEXT_RELEASE_BEHAVIOR: SDL_GLattr = 24;
pub const SDL_GLattr_SDL_GL_CONTEXT_RESET_NOTIFICATION: SDL_GLattr = 25;
pub const SDL_GLattr_SDL_GL_CONTEXT_NO_ERROR: SDL_GLattr = 26;
#[doc = "  \\brief OpenGL configuration attributes"]
pub type SDL_GLattr = libc::c_int;
pub const SDL_GLprofile_SDL_GL_CONTEXT_PROFILE_CORE: SDL_GLprofile = 1;
pub const SDL_GLprofile_SDL_GL_CONTEXT_PROFILE_COMPATIBILITY: SDL_GLprofile = 2;
#[doc = "< GLX_CONTEXT_ES2_PROFILE_BIT_EXT"]
pub const SDL_GLprofile_SDL_GL_CONTEXT_PROFILE_ES: SDL_GLprofile = 4;
pub type SDL_GLprofile = libc::c_int;
pub const SDL_GLcontextFlag_SDL_GL_CONTEXT_DEBUG_FLAG: SDL_GLcontextFlag = 1;
pub const SDL_GLcontextFlag_SDL_GL_CONTEXT_FORWARD_COMPATIBLE_FLAG: SDL_GLcontextFlag = 2;
pub const SDL_GLcontextFlag_SDL_GL_CONTEXT_ROBUST_ACCESS_FLAG: SDL_GLcontextFlag = 4;
pub const SDL_GLcontextFlag_SDL_GL_CONTEXT_RESET_ISOLATION_FLAG: SDL_GLcontextFlag = 8;
pub type SDL_GLcontextFlag = libc::c_int;
pub const SDL_GLcontextReleaseFlag_SDL_GL_CONTEXT_RELEASE_BEHAVIOR_NONE: SDL_GLcontextReleaseFlag =
    0;
pub const SDL_GLcontextReleaseFlag_SDL_GL_CONTEXT_RELEASE_BEHAVIOR_FLUSH: SDL_GLcontextReleaseFlag =
    1;
pub type SDL_GLcontextReleaseFlag = libc::c_int;
pub const SDL_GLContextResetNotification_SDL_GL_CONTEXT_RESET_NO_NOTIFICATION:
    SDL_GLContextResetNotification = 0;
pub const SDL_GLContextResetNotification_SDL_GL_CONTEXT_RESET_LOSE_CONTEXT:
    SDL_GLContextResetNotification = 1;
pub type SDL_GLContextResetNotification = libc::c_int;
extern "C" {
    #[doc = "  \\brief Get the number of video drivers compiled into SDL\n\n  \\sa SDL_GetVideoDriver()"]
    pub fn SDL_GetNumVideoDrivers() -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Get the name of a built in video driver.\n\n  \\note The video drivers are presented in the order in which they are\n        normally checked during initialization.\n\n  \\sa SDL_GetNumVideoDrivers()"]
    pub fn SDL_GetVideoDriver(index: libc::c_int) -> *const libc::c_char;
}
extern "C" {
    #[doc = "  \\brief Initialize the video subsystem, optionally specifying a video driver.\n\n  \\param driver_name Initialize a specific driver by name, or NULL for the\n                     default video driver.\n\n  \\return 0 on success, -1 on error\n\n  This function initializes the video subsystem; setting up a connection\n  to the window manager, etc, and determines the available display modes\n  and pixel formats, but does not initialize a window or graphics mode.\n\n  \\sa SDL_VideoQuit()"]
    pub fn SDL_VideoInit(driver_name: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Shuts down the video subsystem.\n\n  This function closes all windows, and restores the original video mode.\n\n  \\sa SDL_VideoInit()"]
    pub fn SDL_VideoQuit();
}
extern "C" {
    #[doc = "  \\brief Returns the name of the currently initialized video driver.\n\n  \\return The name of the current video driver or NULL if no driver\n          has been initialized\n\n  \\sa SDL_GetNumVideoDrivers()\n  \\sa SDL_GetVideoDriver()"]
    pub fn SDL_GetCurrentVideoDriver() -> *const libc::c_char;
}
extern "C" {
    #[doc = "  \\brief Returns the number of available video displays.\n\n  \\sa SDL_GetDisplayBounds()"]
    pub fn SDL_GetNumVideoDisplays() -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Get the name of a display in UTF-8 encoding\n\n  \\return The name of a display, or NULL for an invalid display index.\n\n  \\sa SDL_GetNumVideoDisplays()"]
    pub fn SDL_GetDisplayName(displayIndex: libc::c_int) -> *const libc::c_char;
}
extern "C" {
    #[doc = "  \\brief Get the desktop area represented by a display, with the primary\n         display located at 0,0\n\n  \\return 0 on success, or -1 if the index is out of range.\n\n  \\sa SDL_GetNumVideoDisplays()"]
    pub fn SDL_GetDisplayBounds(displayIndex: libc::c_int, rect: *mut SDL_Rect) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Get the usable desktop area represented by a display, with the\n         primary display located at 0,0\n\n  This is the same area as SDL_GetDisplayBounds() reports, but with portions\n  reserved by the system removed. For example, on Mac OS X, this subtracts\n  the area occupied by the menu bar and dock.\n\n  Setting a window to be fullscreen generally bypasses these unusable areas,\n  so these are good guidelines for the maximum space available to a\n  non-fullscreen window.\n\n  \\return 0 on success, or -1 if the index is out of range.\n\n  \\sa SDL_GetDisplayBounds()\n  \\sa SDL_GetNumVideoDisplays()"]
    pub fn SDL_GetDisplayUsableBounds(
        displayIndex: libc::c_int,
        rect: *mut SDL_Rect,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Get the dots/pixels-per-inch for a display\n\n  \\note Diagonal, horizontal and vertical DPI can all be optionally\n        returned if the parameter is non-NULL.\n\n  \\return 0 on success, or -1 if no DPI information is available or the index is out of range.\n\n  \\sa SDL_GetNumVideoDisplays()"]
    pub fn SDL_GetDisplayDPI(
        displayIndex: libc::c_int,
        ddpi: *mut f32,
        hdpi: *mut f32,
        vdpi: *mut f32,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Get the orientation of a display\n\n  \\return The orientation of the display, or SDL_ORIENTATION_UNKNOWN if it isn't available.\n\n  \\sa SDL_GetNumVideoDisplays()"]
    pub fn SDL_GetDisplayOrientation(displayIndex: libc::c_int) -> SDL_DisplayOrientation;
}
extern "C" {
    #[doc = "  \\brief Returns the number of available display modes.\n\n  \\sa SDL_GetDisplayMode()"]
    pub fn SDL_GetNumDisplayModes(displayIndex: libc::c_int) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Fill in information about a specific display mode.\n\n  \\note The display modes are sorted in this priority:\n        \\li bits per pixel -> more colors to fewer colors\n        \\li width -> largest to smallest\n        \\li height -> largest to smallest\n        \\li refresh rate -> highest to lowest\n\n  \\sa SDL_GetNumDisplayModes()"]
    pub fn SDL_GetDisplayMode(
        displayIndex: libc::c_int,
        modeIndex: libc::c_int,
        mode: *mut SDL_DisplayMode,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Fill in information about the desktop display mode."]
    pub fn SDL_GetDesktopDisplayMode(
        displayIndex: libc::c_int,
        mode: *mut SDL_DisplayMode,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Fill in information about the current display mode."]
    pub fn SDL_GetCurrentDisplayMode(
        displayIndex: libc::c_int,
        mode: *mut SDL_DisplayMode,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Get the closest match to the requested display mode.\n\n  \\param displayIndex The index of display from which mode should be queried.\n  \\param mode The desired display mode\n  \\param closest A pointer to a display mode to be filled in with the closest\n                 match of the available display modes.\n\n  \\return The passed in value \\c closest, or NULL if no matching video mode\n          was available.\n\n  The available display modes are scanned, and \\c closest is filled in with the\n  closest mode matching the requested mode and returned.  The mode format and\n  refresh_rate default to the desktop mode if they are 0.  The modes are\n  scanned with size being first priority, format being second priority, and\n  finally checking the refresh_rate.  If all the available modes are too\n  small, then NULL is returned.\n\n  \\sa SDL_GetNumDisplayModes()\n  \\sa SDL_GetDisplayMode()"]
    pub fn SDL_GetClosestDisplayMode(
        displayIndex: libc::c_int,
        mode: *const SDL_DisplayMode,
        closest: *mut SDL_DisplayMode,
    ) -> *mut SDL_DisplayMode;
}
extern "C" {
    #[doc = "  \\brief Get the display index associated with a window.\n\n  \\return the display index of the display containing the center of the\n          window, or -1 on error."]
    pub fn SDL_GetWindowDisplayIndex(window: *mut SDL_Window) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Set the display mode used when a fullscreen window is visible.\n\n  By default the window's dimensions and the desktop format and refresh rate\n  are used.\n\n  \\param window The window for which the display mode should be set.\n  \\param mode The mode to use, or NULL for the default mode.\n\n  \\return 0 on success, or -1 if setting the display mode failed.\n\n  \\sa SDL_GetWindowDisplayMode()\n  \\sa SDL_SetWindowFullscreen()"]
    pub fn SDL_SetWindowDisplayMode(
        window: *mut SDL_Window,
        mode: *const SDL_DisplayMode,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Fill in information about the display mode used when a fullscreen\n         window is visible.\n\n  \\sa SDL_SetWindowDisplayMode()\n  \\sa SDL_SetWindowFullscreen()"]
    pub fn SDL_GetWindowDisplayMode(
        window: *mut SDL_Window,
        mode: *mut SDL_DisplayMode,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Get the pixel format associated with the window."]
    pub fn SDL_GetWindowPixelFormat(window: *mut SDL_Window) -> Uint32;
}
extern "C" {
    #[doc = "  \\brief Create a window with the specified position, dimensions, and flags.\n\n  \\param title The title of the window, in UTF-8 encoding.\n  \\param x     The x position of the window, ::SDL_WINDOWPOS_CENTERED, or\n               ::SDL_WINDOWPOS_UNDEFINED.\n  \\param y     The y position of the window, ::SDL_WINDOWPOS_CENTERED, or\n               ::SDL_WINDOWPOS_UNDEFINED.\n  \\param w     The width of the window, in screen coordinates.\n  \\param h     The height of the window, in screen coordinates.\n  \\param flags The flags for the window, a mask of any of the following:\n               ::SDL_WINDOW_FULLSCREEN,    ::SDL_WINDOW_OPENGL,\n               ::SDL_WINDOW_HIDDEN,        ::SDL_WINDOW_BORDERLESS,\n               ::SDL_WINDOW_RESIZABLE,     ::SDL_WINDOW_MAXIMIZED,\n               ::SDL_WINDOW_MINIMIZED,     ::SDL_WINDOW_INPUT_GRABBED,\n               ::SDL_WINDOW_ALLOW_HIGHDPI, ::SDL_WINDOW_VULKAN.\n\n  \\return The created window, or NULL if window creation failed.\n\n  If the window is created with the SDL_WINDOW_ALLOW_HIGHDPI flag, its size\n  in pixels may differ from its size in screen coordinates on platforms with\n  high-DPI support (e.g. iOS and Mac OS X). Use SDL_GetWindowSize() to query\n  the client area's size in screen coordinates, and SDL_GL_GetDrawableSize(),\n  SDL_Vulkan_GetDrawableSize(), or SDL_GetRendererOutputSize() to query the\n  drawable size in pixels.\n\n  If the window is created with any of the SDL_WINDOW_OPENGL or\n  SDL_WINDOW_VULKAN flags, then the corresponding LoadLibrary function\n  (SDL_GL_LoadLibrary or SDL_Vulkan_LoadLibrary) is called and the\n  corresponding UnloadLibrary function is called by SDL_DestroyWindow().\n\n  If SDL_WINDOW_VULKAN is specified and there isn't a working Vulkan driver,\n  SDL_CreateWindow() will fail because SDL_Vulkan_LoadLibrary() will fail.\n\n  \\note On non-Apple devices, SDL requires you to either not link to the\n        Vulkan loader or link to a dynamic library version. This limitation\n        may be removed in a future version of SDL.\n\n  \\sa SDL_DestroyWindow()\n  \\sa SDL_GL_LoadLibrary()\n  \\sa SDL_Vulkan_LoadLibrary()"]
    pub fn SDL_CreateWindow(
        title: *const libc::c_char,
        x: libc::c_int,
        y: libc::c_int,
        w: libc::c_int,
        h: libc::c_int,
        flags: Uint32,
    ) -> *mut SDL_Window;
}
extern "C" {
    #[doc = "  \\brief Create an SDL window from an existing native window.\n\n  \\param data A pointer to driver-dependent window creation data\n\n  \\return The created window, or NULL if window creation failed.\n\n  \\sa SDL_DestroyWindow()"]
    pub fn SDL_CreateWindowFrom(data: *const libc::c_void) -> *mut SDL_Window;
}
extern "C" {
    #[doc = "  \\brief Get the numeric ID of a window, for logging purposes."]
    pub fn SDL_GetWindowID(window: *mut SDL_Window) -> Uint32;
}
extern "C" {
    #[doc = "  \\brief Get a window from a stored ID, or NULL if it doesn't exist."]
    pub fn SDL_GetWindowFromID(id: Uint32) -> *mut SDL_Window;
}
extern "C" {
    #[doc = "  \\brief Get the window flags."]
    pub fn SDL_GetWindowFlags(window: *mut SDL_Window) -> Uint32;
}
extern "C" {
    #[doc = "  \\brief Set the title of a window, in UTF-8 format.\n\n  \\sa SDL_GetWindowTitle()"]
    pub fn SDL_SetWindowTitle(window: *mut SDL_Window, title: *const libc::c_char);
}
extern "C" {
    #[doc = "  \\brief Get the title of a window, in UTF-8 format.\n\n  \\sa SDL_SetWindowTitle()"]
    pub fn SDL_GetWindowTitle(window: *mut SDL_Window) -> *const libc::c_char;
}
extern "C" {
    #[doc = "  \\brief Set the icon for a window.\n\n  \\param window The window for which the icon should be set.\n  \\param icon The icon for the window."]
    pub fn SDL_SetWindowIcon(window: *mut SDL_Window, icon: *mut SDL_Surface);
}
extern "C" {
    #[doc = "  \\brief Associate an arbitrary named pointer with a window.\n\n  \\param window   The window to associate with the pointer.\n  \\param name     The name of the pointer.\n  \\param userdata The associated pointer.\n\n  \\return The previous value associated with 'name'\n\n  \\note The name is case-sensitive.\n\n  \\sa SDL_GetWindowData()"]
    pub fn SDL_SetWindowData(
        window: *mut SDL_Window,
        name: *const libc::c_char,
        userdata: *mut libc::c_void,
    ) -> *mut libc::c_void;
}
extern "C" {
    #[doc = "  \\brief Retrieve the data pointer associated with a window.\n\n  \\param window   The window to query.\n  \\param name     The name of the pointer.\n\n  \\return The value associated with 'name'\n\n  \\sa SDL_SetWindowData()"]
    pub fn SDL_GetWindowData(
        window: *mut SDL_Window,
        name: *const libc::c_char,
    ) -> *mut libc::c_void;
}
extern "C" {
    #[doc = "  \\brief Set the position of a window.\n\n  \\param window   The window to reposition.\n  \\param x        The x coordinate of the window in screen coordinates, or\n                  ::SDL_WINDOWPOS_CENTERED or ::SDL_WINDOWPOS_UNDEFINED.\n  \\param y        The y coordinate of the window in screen coordinates, or\n                  ::SDL_WINDOWPOS_CENTERED or ::SDL_WINDOWPOS_UNDEFINED.\n\n  \\note The window coordinate origin is the upper left of the display.\n\n  \\sa SDL_GetWindowPosition()"]
    pub fn SDL_SetWindowPosition(window: *mut SDL_Window, x: libc::c_int, y: libc::c_int);
}
extern "C" {
    #[doc = "  \\brief Get the position of a window.\n\n  \\param window   The window to query.\n  \\param x        Pointer to variable for storing the x position, in screen\n                  coordinates. May be NULL.\n  \\param y        Pointer to variable for storing the y position, in screen\n                  coordinates. May be NULL.\n\n  \\sa SDL_SetWindowPosition()"]
    pub fn SDL_GetWindowPosition(window: *mut SDL_Window, x: *mut libc::c_int, y: *mut libc::c_int);
}
extern "C" {
    #[doc = "  \\brief Set the size of a window's client area.\n\n  \\param window   The window to resize.\n  \\param w        The width of the window, in screen coordinates. Must be >0.\n  \\param h        The height of the window, in screen coordinates. Must be >0.\n\n  \\note Fullscreen windows automatically match the size of the display mode,\n        and you should use SDL_SetWindowDisplayMode() to change their size.\n\n  The window size in screen coordinates may differ from the size in pixels, if\n  the window was created with SDL_WINDOW_ALLOW_HIGHDPI on a platform with\n  high-dpi support (e.g. iOS or OS X). Use SDL_GL_GetDrawableSize() or\n  SDL_GetRendererOutputSize() to get the real client area size in pixels.\n\n  \\sa SDL_GetWindowSize()\n  \\sa SDL_SetWindowDisplayMode()"]
    pub fn SDL_SetWindowSize(window: *mut SDL_Window, w: libc::c_int, h: libc::c_int);
}
extern "C" {
    #[doc = "  \\brief Get the size of a window's client area.\n\n  \\param window   The window to query.\n  \\param w        Pointer to variable for storing the width, in screen\n                  coordinates. May be NULL.\n  \\param h        Pointer to variable for storing the height, in screen\n                  coordinates. May be NULL.\n\n  The window size in screen coordinates may differ from the size in pixels, if\n  the window was created with SDL_WINDOW_ALLOW_HIGHDPI on a platform with\n  high-dpi support (e.g. iOS or OS X). Use SDL_GL_GetDrawableSize() or\n  SDL_GetRendererOutputSize() to get the real client area size in pixels.\n\n  \\sa SDL_SetWindowSize()"]
    pub fn SDL_GetWindowSize(window: *mut SDL_Window, w: *mut libc::c_int, h: *mut libc::c_int);
}
extern "C" {
    #[doc = "  \\brief Get the size of a window's borders (decorations) around the client area.\n\n  \\param window The window to query.\n  \\param top Pointer to variable for storing the size of the top border. NULL is permitted.\n  \\param left Pointer to variable for storing the size of the left border. NULL is permitted.\n  \\param bottom Pointer to variable for storing the size of the bottom border. NULL is permitted.\n  \\param right Pointer to variable for storing the size of the right border. NULL is permitted.\n\n  \\return 0 on success, or -1 if getting this information is not supported.\n\n  \\note if this function fails (returns -1), the size values will be\n        initialized to 0, 0, 0, 0 (if a non-NULL pointer is provided), as\n        if the window in question was borderless."]
    pub fn SDL_GetWindowBordersSize(
        window: *mut SDL_Window,
        top: *mut libc::c_int,
        left: *mut libc::c_int,
        bottom: *mut libc::c_int,
        right: *mut libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Set the minimum size of a window's client area.\n\n  \\param window    The window to set a new minimum size.\n  \\param min_w     The minimum width of the window, must be >0\n  \\param min_h     The minimum height of the window, must be >0\n\n  \\note You can't change the minimum size of a fullscreen window, it\n        automatically matches the size of the display mode.\n\n  \\sa SDL_GetWindowMinimumSize()\n  \\sa SDL_SetWindowMaximumSize()"]
    pub fn SDL_SetWindowMinimumSize(
        window: *mut SDL_Window,
        min_w: libc::c_int,
        min_h: libc::c_int,
    );
}
extern "C" {
    #[doc = "  \\brief Get the minimum size of a window's client area.\n\n  \\param window   The window to query.\n  \\param w        Pointer to variable for storing the minimum width, may be NULL\n  \\param h        Pointer to variable for storing the minimum height, may be NULL\n\n  \\sa SDL_GetWindowMaximumSize()\n  \\sa SDL_SetWindowMinimumSize()"]
    pub fn SDL_GetWindowMinimumSize(
        window: *mut SDL_Window,
        w: *mut libc::c_int,
        h: *mut libc::c_int,
    );
}
extern "C" {
    #[doc = "  \\brief Set the maximum size of a window's client area.\n\n  \\param window    The window to set a new maximum size.\n  \\param max_w     The maximum width of the window, must be >0\n  \\param max_h     The maximum height of the window, must be >0\n\n  \\note You can't change the maximum size of a fullscreen window, it\n        automatically matches the size of the display mode.\n\n  \\sa SDL_GetWindowMaximumSize()\n  \\sa SDL_SetWindowMinimumSize()"]
    pub fn SDL_SetWindowMaximumSize(
        window: *mut SDL_Window,
        max_w: libc::c_int,
        max_h: libc::c_int,
    );
}
extern "C" {
    #[doc = "  \\brief Get the maximum size of a window's client area.\n\n  \\param window   The window to query.\n  \\param w        Pointer to variable for storing the maximum width, may be NULL\n  \\param h        Pointer to variable for storing the maximum height, may be NULL\n\n  \\sa SDL_GetWindowMinimumSize()\n  \\sa SDL_SetWindowMaximumSize()"]
    pub fn SDL_GetWindowMaximumSize(
        window: *mut SDL_Window,
        w: *mut libc::c_int,
        h: *mut libc::c_int,
    );
}
extern "C" {
    #[doc = "  \\brief Set the border state of a window.\n\n  This will add or remove the window's SDL_WINDOW_BORDERLESS flag and\n  add or remove the border from the actual window. This is a no-op if the\n  window's border already matches the requested state.\n\n  \\param window The window of which to change the border state.\n  \\param bordered SDL_FALSE to remove border, SDL_TRUE to add border.\n\n  \\note You can't change the border state of a fullscreen window.\n\n  \\sa SDL_GetWindowFlags()"]
    pub fn SDL_SetWindowBordered(window: *mut SDL_Window, bordered: SDL_bool);
}
extern "C" {
    #[doc = "  \\brief Set the user-resizable state of a window.\n\n  This will add or remove the window's SDL_WINDOW_RESIZABLE flag and\n  allow/disallow user resizing of the window. This is a no-op if the\n  window's resizable state already matches the requested state.\n\n  \\param window The window of which to change the resizable state.\n  \\param resizable SDL_TRUE to allow resizing, SDL_FALSE to disallow.\n\n  \\note You can't change the resizable state of a fullscreen window.\n\n  \\sa SDL_GetWindowFlags()"]
    pub fn SDL_SetWindowResizable(window: *mut SDL_Window, resizable: SDL_bool);
}
extern "C" {
    #[doc = "  \\brief Show a window.\n\n  \\sa SDL_HideWindow()"]
    pub fn SDL_ShowWindow(window: *mut SDL_Window);
}
extern "C" {
    #[doc = "  \\brief Hide a window.\n\n  \\sa SDL_ShowWindow()"]
    pub fn SDL_HideWindow(window: *mut SDL_Window);
}
extern "C" {
    #[doc = "  \\brief Raise a window above other windows and set the input focus."]
    pub fn SDL_RaiseWindow(window: *mut SDL_Window);
}
extern "C" {
    #[doc = "  \\brief Make a window as large as possible.\n\n  \\sa SDL_RestoreWindow()"]
    pub fn SDL_MaximizeWindow(window: *mut SDL_Window);
}
extern "C" {
    #[doc = "  \\brief Minimize a window to an iconic representation.\n\n  \\sa SDL_RestoreWindow()"]
    pub fn SDL_MinimizeWindow(window: *mut SDL_Window);
}
extern "C" {
    #[doc = "  \\brief Restore the size and position of a minimized or maximized window.\n\n  \\sa SDL_MaximizeWindow()\n  \\sa SDL_MinimizeWindow()"]
    pub fn SDL_RestoreWindow(window: *mut SDL_Window);
}
extern "C" {
    #[doc = "  \\brief Set a window's fullscreen state.\n\n  \\return 0 on success, or -1 if setting the display mode failed.\n\n  \\sa SDL_SetWindowDisplayMode()\n  \\sa SDL_GetWindowDisplayMode()"]
    pub fn SDL_SetWindowFullscreen(window: *mut SDL_Window, flags: Uint32) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Get the SDL surface associated with the window.\n\n  \\return The window's framebuffer surface, or NULL on error.\n\n  A new surface will be created with the optimal format for the window,\n  if necessary. This surface will be freed when the window is destroyed.\n\n  \\note You may not combine this with 3D or the rendering API on this window.\n\n  \\sa SDL_UpdateWindowSurface()\n  \\sa SDL_UpdateWindowSurfaceRects()"]
    pub fn SDL_GetWindowSurface(window: *mut SDL_Window) -> *mut SDL_Surface;
}
extern "C" {
    #[doc = "  \\brief Copy the window surface to the screen.\n\n  \\return 0 on success, or -1 on error.\n\n  \\sa SDL_GetWindowSurface()\n  \\sa SDL_UpdateWindowSurfaceRects()"]
    pub fn SDL_UpdateWindowSurface(window: *mut SDL_Window) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Copy a number of rectangles on the window surface to the screen.\n\n  \\return 0 on success, or -1 on error.\n\n  \\sa SDL_GetWindowSurface()\n  \\sa SDL_UpdateWindowSurface()"]
    pub fn SDL_UpdateWindowSurfaceRects(
        window: *mut SDL_Window,
        rects: *const SDL_Rect,
        numrects: libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Set a window's input grab mode.\n\n  \\param window The window for which the input grab mode should be set.\n  \\param grabbed This is SDL_TRUE to grab input, and SDL_FALSE to release input.\n\n  If the caller enables a grab while another window is currently grabbed,\n  the other window loses its grab in favor of the caller's window.\n\n  \\sa SDL_GetWindowGrab()"]
    pub fn SDL_SetWindowGrab(window: *mut SDL_Window, grabbed: SDL_bool);
}
extern "C" {
    #[doc = "  \\brief Get a window's input grab mode.\n\n  \\return This returns SDL_TRUE if input is grabbed, and SDL_FALSE otherwise.\n\n  \\sa SDL_SetWindowGrab()"]
    pub fn SDL_GetWindowGrab(window: *mut SDL_Window) -> SDL_bool;
}
extern "C" {
    #[doc = "  \\brief Get the window that currently has an input grab enabled.\n\n  \\return This returns the window if input is grabbed, and NULL otherwise.\n\n  \\sa SDL_SetWindowGrab()"]
    pub fn SDL_GetGrabbedWindow() -> *mut SDL_Window;
}
extern "C" {
    #[doc = "  \\brief Set the brightness (gamma correction) for a window.\n\n  \\return 0 on success, or -1 if setting the brightness isn't supported.\n\n  \\sa SDL_GetWindowBrightness()\n  \\sa SDL_SetWindowGammaRamp()"]
    pub fn SDL_SetWindowBrightness(window: *mut SDL_Window, brightness: f32) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Get the brightness (gamma correction) for a window.\n\n  \\return The last brightness value passed to SDL_SetWindowBrightness()\n\n  \\sa SDL_SetWindowBrightness()"]
    pub fn SDL_GetWindowBrightness(window: *mut SDL_Window) -> f32;
}
extern "C" {
    #[doc = "  \\brief Set the opacity for a window\n\n  \\param window The window which will be made transparent or opaque\n  \\param opacity Opacity (0.0f - transparent, 1.0f - opaque) This will be\n                 clamped internally between 0.0f and 1.0f.\n\n  \\return 0 on success, or -1 if setting the opacity isn't supported.\n\n  \\sa SDL_GetWindowOpacity()"]
    pub fn SDL_SetWindowOpacity(window: *mut SDL_Window, opacity: f32) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Get the opacity of a window.\n\n  If transparency isn't supported on this platform, opacity will be reported\n  as 1.0f without error.\n\n  \\param window The window in question.\n  \\param out_opacity Opacity (0.0f - transparent, 1.0f - opaque)\n\n  \\return 0 on success, or -1 on error (invalid window, etc).\n\n  \\sa SDL_SetWindowOpacity()"]
    pub fn SDL_GetWindowOpacity(window: *mut SDL_Window, out_opacity: *mut f32) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Sets the window as a modal for another window (TODO: reconsider this function and/or its name)\n\n  \\param modal_window The window that should be modal\n  \\param parent_window The parent window\n\n  \\return 0 on success, or -1 otherwise."]
    pub fn SDL_SetWindowModalFor(
        modal_window: *mut SDL_Window,
        parent_window: *mut SDL_Window,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Explicitly sets input focus to the window.\n\n  You almost certainly want SDL_RaiseWindow() instead of this function. Use\n  this with caution, as you might give focus to a window that's completely\n  obscured by other windows.\n\n  \\param window The window that should get the input focus\n\n  \\return 0 on success, or -1 otherwise.\n  \\sa SDL_RaiseWindow()"]
    pub fn SDL_SetWindowInputFocus(window: *mut SDL_Window) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Set the gamma ramp for a window.\n\n  \\param window The window for which the gamma ramp should be set.\n  \\param red The translation table for the red channel, or NULL.\n  \\param green The translation table for the green channel, or NULL.\n  \\param blue The translation table for the blue channel, or NULL.\n\n  \\return 0 on success, or -1 if gamma ramps are unsupported.\n\n  Set the gamma translation table for the red, green, and blue channels\n  of the video hardware.  Each table is an array of 256 16-bit quantities,\n  representing a mapping between the input and output for that channel.\n  The input is the index into the array, and the output is the 16-bit\n  gamma value at that index, scaled to the output color precision.\n\n  \\sa SDL_GetWindowGammaRamp()"]
    pub fn SDL_SetWindowGammaRamp(
        window: *mut SDL_Window,
        red: *const Uint16,
        green: *const Uint16,
        blue: *const Uint16,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Get the gamma ramp for a window.\n\n  \\param window The window from which the gamma ramp should be queried.\n  \\param red   A pointer to a 256 element array of 16-bit quantities to hold\n               the translation table for the red channel, or NULL.\n  \\param green A pointer to a 256 element array of 16-bit quantities to hold\n               the translation table for the green channel, or NULL.\n  \\param blue  A pointer to a 256 element array of 16-bit quantities to hold\n               the translation table for the blue channel, or NULL.\n\n  \\return 0 on success, or -1 if gamma ramps are unsupported.\n\n  \\sa SDL_SetWindowGammaRamp()"]
    pub fn SDL_GetWindowGammaRamp(
        window: *mut SDL_Window,
        red: *mut Uint16,
        green: *mut Uint16,
        blue: *mut Uint16,
    ) -> libc::c_int;
}
#[doc = "< Region is normal. No special properties."]
pub const SDL_HitTestResult_SDL_HITTEST_NORMAL: SDL_HitTestResult = 0;
#[doc = "< Region can drag entire window."]
pub const SDL_HitTestResult_SDL_HITTEST_DRAGGABLE: SDL_HitTestResult = 1;
pub const SDL_HitTestResult_SDL_HITTEST_RESIZE_TOPLEFT: SDL_HitTestResult = 2;
pub const SDL_HitTestResult_SDL_HITTEST_RESIZE_TOP: SDL_HitTestResult = 3;
pub const SDL_HitTestResult_SDL_HITTEST_RESIZE_TOPRIGHT: SDL_HitTestResult = 4;
pub const SDL_HitTestResult_SDL_HITTEST_RESIZE_RIGHT: SDL_HitTestResult = 5;
pub const SDL_HitTestResult_SDL_HITTEST_RESIZE_BOTTOMRIGHT: SDL_HitTestResult = 6;
pub const SDL_HitTestResult_SDL_HITTEST_RESIZE_BOTTOM: SDL_HitTestResult = 7;
pub const SDL_HitTestResult_SDL_HITTEST_RESIZE_BOTTOMLEFT: SDL_HitTestResult = 8;
pub const SDL_HitTestResult_SDL_HITTEST_RESIZE_LEFT: SDL_HitTestResult = 9;
#[doc = "  \\brief Possible return values from the SDL_HitTest callback.\n\n  \\sa SDL_HitTest"]
pub type SDL_HitTestResult = libc::c_int;
#[doc = "  \\brief Callback used for hit-testing.\n\n  \\sa SDL_SetWindowHitTest"]
pub type SDL_HitTest = ::core::option::Option<
    unsafe extern "C" fn(
        win: *mut SDL_Window,
        area: *const SDL_Point,
        data: *mut libc::c_void,
    ) -> SDL_HitTestResult,
>;
extern "C" {
    #[doc = "  \\brief Provide a callback that decides if a window region has special properties.\n\n  Normally windows are dragged and resized by decorations provided by the\n  system window manager (a title bar, borders, etc), but for some apps, it\n  makes sense to drag them from somewhere else inside the window itself; for\n  example, one might have a borderless window that wants to be draggable\n  from any part, or simulate its own title bar, etc.\n\n  This function lets the app provide a callback that designates pieces of\n  a given window as special. This callback is run during event processing\n  if we need to tell the OS to treat a region of the window specially; the\n  use of this callback is known as \"hit testing.\"\n\n  Mouse input may not be delivered to your application if it is within\n  a special area; the OS will often apply that input to moving the window or\n  resizing the window and not deliver it to the application.\n\n  Specifying NULL for a callback disables hit-testing. Hit-testing is\n  disabled by default.\n\n  Platforms that don't support this functionality will return -1\n  unconditionally, even if you're attempting to disable hit-testing.\n\n  Your callback may fire at any time, and its firing does not indicate any\n  specific behavior (for example, on Windows, this certainly might fire\n  when the OS is deciding whether to drag your window, but it fires for lots\n  of other reasons, too, some unrelated to anything you probably care about\n  _and when the mouse isn't actually at the location it is testing_).\n  Since this can fire at any time, you should try to keep your callback\n  efficient, devoid of allocations, etc.\n\n  \\param window The window to set hit-testing on.\n  \\param callback The callback to call when doing a hit-test.\n  \\param callback_data An app-defined void pointer passed to the callback.\n  \\return 0 on success, -1 on error (including unsupported)."]
    pub fn SDL_SetWindowHitTest(
        window: *mut SDL_Window,
        callback: SDL_HitTest,
        callback_data: *mut libc::c_void,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Destroy a window."]
    pub fn SDL_DestroyWindow(window: *mut SDL_Window);
}
extern "C" {
    #[doc = "  \\brief Returns whether the screensaver is currently enabled (default off).\n\n  \\sa SDL_EnableScreenSaver()\n  \\sa SDL_DisableScreenSaver()"]
    pub fn SDL_IsScreenSaverEnabled() -> SDL_bool;
}
extern "C" {
    #[doc = "  \\brief Allow the screen to be blanked by a screensaver\n\n  \\sa SDL_IsScreenSaverEnabled()\n  \\sa SDL_DisableScreenSaver()"]
    pub fn SDL_EnableScreenSaver();
}
extern "C" {
    #[doc = "  \\brief Prevent the screen from being blanked by a screensaver\n\n  \\sa SDL_IsScreenSaverEnabled()\n  \\sa SDL_EnableScreenSaver()"]
    pub fn SDL_DisableScreenSaver();
}
extern "C" {
    #[doc = "  \\brief Dynamically load an OpenGL library.\n\n  \\param path The platform dependent OpenGL library name, or NULL to open the\n              default OpenGL library.\n\n  \\return 0 on success, or -1 if the library couldn't be loaded.\n\n  This should be done after initializing the video driver, but before\n  creating any OpenGL windows.  If no OpenGL library is loaded, the default\n  library will be loaded upon creation of the first OpenGL window.\n\n  \\note If you do this, you need to retrieve all of the GL functions used in\n        your program from the dynamic library using SDL_GL_GetProcAddress().\n\n  \\sa SDL_GL_GetProcAddress()\n  \\sa SDL_GL_UnloadLibrary()"]
    pub fn SDL_GL_LoadLibrary(path: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Get the address of an OpenGL function."]
    pub fn SDL_GL_GetProcAddress(proc_: *const libc::c_char) -> *mut libc::c_void;
}
extern "C" {
    #[doc = "  \\brief Unload the OpenGL library previously loaded by SDL_GL_LoadLibrary().\n\n  \\sa SDL_GL_LoadLibrary()"]
    pub fn SDL_GL_UnloadLibrary();
}
extern "C" {
    #[doc = "  \\brief Return true if an OpenGL extension is supported for the current\n         context."]
    pub fn SDL_GL_ExtensionSupported(extension: *const libc::c_char) -> SDL_bool;
}
extern "C" {
    #[doc = "  \\brief Reset all previously set OpenGL context attributes to their default values"]
    pub fn SDL_GL_ResetAttributes();
}
extern "C" {
    #[doc = "  \\brief Set an OpenGL window attribute before window creation.\n\n  \\return 0 on success, or -1 if the attribute could not be set."]
    pub fn SDL_GL_SetAttribute(attr: SDL_GLattr, value: libc::c_int) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Get the actual value for an attribute from the current context.\n\n  \\return 0 on success, or -1 if the attribute could not be retrieved.\n          The integer at \\c value will be modified in either case."]
    pub fn SDL_GL_GetAttribute(attr: SDL_GLattr, value: *mut libc::c_int) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Create an OpenGL context for use with an OpenGL window, and make it\n         current.\n\n  \\sa SDL_GL_DeleteContext()"]
    pub fn SDL_GL_CreateContext(window: *mut SDL_Window) -> SDL_GLContext;
}
extern "C" {
    #[doc = "  \\brief Set up an OpenGL context for rendering into an OpenGL window.\n\n  \\note The context must have been created with a compatible window."]
    pub fn SDL_GL_MakeCurrent(window: *mut SDL_Window, context: SDL_GLContext) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Get the currently active OpenGL window."]
    pub fn SDL_GL_GetCurrentWindow() -> *mut SDL_Window;
}
extern "C" {
    #[doc = "  \\brief Get the currently active OpenGL context."]
    pub fn SDL_GL_GetCurrentContext() -> SDL_GLContext;
}
extern "C" {
    #[doc = "  \\brief Get the size of a window's underlying drawable in pixels (for use\n         with glViewport).\n\n  \\param window   Window from which the drawable size should be queried\n  \\param w        Pointer to variable for storing the width in pixels, may be NULL\n  \\param h        Pointer to variable for storing the height in pixels, may be NULL\n\n This may differ from SDL_GetWindowSize() if we're rendering to a high-DPI\n drawable, i.e. the window was created with SDL_WINDOW_ALLOW_HIGHDPI on a\n platform with high-DPI support (Apple calls this \"Retina\"), and not disabled\n by the SDL_HINT_VIDEO_HIGHDPI_DISABLED hint.\n\n  \\sa SDL_GetWindowSize()\n  \\sa SDL_CreateWindow()"]
    pub fn SDL_GL_GetDrawableSize(
        window: *mut SDL_Window,
        w: *mut libc::c_int,
        h: *mut libc::c_int,
    );
}
extern "C" {
    #[doc = "  \\brief Set the swap interval for the current OpenGL context.\n\n  \\param interval 0 for immediate updates, 1 for updates synchronized with the\n                  vertical retrace. If the system supports it, you may\n                  specify -1 to allow late swaps to happen immediately\n                  instead of waiting for the next retrace.\n\n  \\return 0 on success, or -1 if setting the swap interval is not supported.\n\n  \\sa SDL_GL_GetSwapInterval()"]
    pub fn SDL_GL_SetSwapInterval(interval: libc::c_int) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Get the swap interval for the current OpenGL context.\n\n  \\return 0 if there is no vertical retrace synchronization, 1 if the buffer\n          swap is synchronized with the vertical retrace, and -1 if late\n          swaps happen immediately instead of waiting for the next retrace.\n          If the system can't determine the swap interval, or there isn't a\n          valid current context, this will return 0 as a safe default.\n\n  \\sa SDL_GL_SetSwapInterval()"]
    pub fn SDL_GL_GetSwapInterval() -> libc::c_int;
}
extern "C" {
    #[doc = " \\brief Swap the OpenGL buffers for a window, if double-buffering is\n        supported."]
    pub fn SDL_GL_SwapWindow(window: *mut SDL_Window);
}
extern "C" {
    #[doc = "  \\brief Delete an OpenGL context.\n\n  \\sa SDL_GL_CreateContext()"]
    pub fn SDL_GL_DeleteContext(context: SDL_GLContext);
}
pub const SDL_Scancode_SDL_SCANCODE_UNKNOWN: SDL_Scancode = 0;
pub const SDL_Scancode_SDL_SCANCODE_A: SDL_Scancode = 4;
pub const SDL_Scancode_SDL_SCANCODE_B: SDL_Scancode = 5;
pub const SDL_Scancode_SDL_SCANCODE_C: SDL_Scancode = 6;
pub const SDL_Scancode_SDL_SCANCODE_D: SDL_Scancode = 7;
pub const SDL_Scancode_SDL_SCANCODE_E: SDL_Scancode = 8;
pub const SDL_Scancode_SDL_SCANCODE_F: SDL_Scancode = 9;
pub const SDL_Scancode_SDL_SCANCODE_G: SDL_Scancode = 10;
pub const SDL_Scancode_SDL_SCANCODE_H: SDL_Scancode = 11;
pub const SDL_Scancode_SDL_SCANCODE_I: SDL_Scancode = 12;
pub const SDL_Scancode_SDL_SCANCODE_J: SDL_Scancode = 13;
pub const SDL_Scancode_SDL_SCANCODE_K: SDL_Scancode = 14;
pub const SDL_Scancode_SDL_SCANCODE_L: SDL_Scancode = 15;
pub const SDL_Scancode_SDL_SCANCODE_M: SDL_Scancode = 16;
pub const SDL_Scancode_SDL_SCANCODE_N: SDL_Scancode = 17;
pub const SDL_Scancode_SDL_SCANCODE_O: SDL_Scancode = 18;
pub const SDL_Scancode_SDL_SCANCODE_P: SDL_Scancode = 19;
pub const SDL_Scancode_SDL_SCANCODE_Q: SDL_Scancode = 20;
pub const SDL_Scancode_SDL_SCANCODE_R: SDL_Scancode = 21;
pub const SDL_Scancode_SDL_SCANCODE_S: SDL_Scancode = 22;
pub const SDL_Scancode_SDL_SCANCODE_T: SDL_Scancode = 23;
pub const SDL_Scancode_SDL_SCANCODE_U: SDL_Scancode = 24;
pub const SDL_Scancode_SDL_SCANCODE_V: SDL_Scancode = 25;
pub const SDL_Scancode_SDL_SCANCODE_W: SDL_Scancode = 26;
pub const SDL_Scancode_SDL_SCANCODE_X: SDL_Scancode = 27;
pub const SDL_Scancode_SDL_SCANCODE_Y: SDL_Scancode = 28;
pub const SDL_Scancode_SDL_SCANCODE_Z: SDL_Scancode = 29;
pub const SDL_Scancode_SDL_SCANCODE_1: SDL_Scancode = 30;
pub const SDL_Scancode_SDL_SCANCODE_2: SDL_Scancode = 31;
pub const SDL_Scancode_SDL_SCANCODE_3: SDL_Scancode = 32;
pub const SDL_Scancode_SDL_SCANCODE_4: SDL_Scancode = 33;
pub const SDL_Scancode_SDL_SCANCODE_5: SDL_Scancode = 34;
pub const SDL_Scancode_SDL_SCANCODE_6: SDL_Scancode = 35;
pub const SDL_Scancode_SDL_SCANCODE_7: SDL_Scancode = 36;
pub const SDL_Scancode_SDL_SCANCODE_8: SDL_Scancode = 37;
pub const SDL_Scancode_SDL_SCANCODE_9: SDL_Scancode = 38;
pub const SDL_Scancode_SDL_SCANCODE_0: SDL_Scancode = 39;
pub const SDL_Scancode_SDL_SCANCODE_RETURN: SDL_Scancode = 40;
pub const SDL_Scancode_SDL_SCANCODE_ESCAPE: SDL_Scancode = 41;
pub const SDL_Scancode_SDL_SCANCODE_BACKSPACE: SDL_Scancode = 42;
pub const SDL_Scancode_SDL_SCANCODE_TAB: SDL_Scancode = 43;
pub const SDL_Scancode_SDL_SCANCODE_SPACE: SDL_Scancode = 44;
pub const SDL_Scancode_SDL_SCANCODE_MINUS: SDL_Scancode = 45;
pub const SDL_Scancode_SDL_SCANCODE_EQUALS: SDL_Scancode = 46;
pub const SDL_Scancode_SDL_SCANCODE_LEFTBRACKET: SDL_Scancode = 47;
pub const SDL_Scancode_SDL_SCANCODE_RIGHTBRACKET: SDL_Scancode = 48;
#[doc = "< Located at the lower left of the return\n   key on ISO keyboards and at the right end\n   of the QWERTY row on ANSI keyboards.\n   Produces REVERSE SOLIDUS (backslash) and\n   VERTICAL LINE in a US layout, REVERSE\n   SOLIDUS and VERTICAL LINE in a UK Mac\n   layout, NUMBER SIGN and TILDE in a UK\n   Windows layout, DOLLAR SIGN and POUND SIGN\n   in a Swiss German layout, NUMBER SIGN and\n   APOSTROPHE in a German layout, GRAVE\n   ACCENT and POUND SIGN in a French Mac\n   layout, and ASTERISK and MICRO SIGN in a\n   French Windows layout."]
pub const SDL_Scancode_SDL_SCANCODE_BACKSLASH: SDL_Scancode = 49;
#[doc = "< ISO USB keyboards actually use this code\n   instead of 49 for the same key, but all\n   OSes I've seen treat the two codes\n   identically. So, as an implementor, unless\n   your keyboard generates both of those\n   codes and your OS treats them differently,\n   you should generate SDL_SCANCODE_BACKSLASH\n   instead of this code. As a user, you\n   should not rely on this code because SDL\n   will never generate it with most (all?)\n   keyboards."]
pub const SDL_Scancode_SDL_SCANCODE_NONUSHASH: SDL_Scancode = 50;
pub const SDL_Scancode_SDL_SCANCODE_SEMICOLON: SDL_Scancode = 51;
pub const SDL_Scancode_SDL_SCANCODE_APOSTROPHE: SDL_Scancode = 52;
#[doc = "< Located in the top left corner (on both ANSI\n   and ISO keyboards). Produces GRAVE ACCENT and\n   TILDE in a US Windows layout and in US and UK\n   Mac layouts on ANSI keyboards, GRAVE ACCENT\n   and NOT SIGN in a UK Windows layout, SECTION\n   SIGN and PLUS-MINUS SIGN in US and UK Mac\n   layouts on ISO keyboards, SECTION SIGN and\n   DEGREE SIGN in a Swiss German layout (Mac:\n   only on ISO keyboards), CIRCUMFLEX ACCENT and\n   DEGREE SIGN in a German layout (Mac: only on\n   ISO keyboards), SUPERSCRIPT TWO and TILDE in a\n   French Windows layout, COMMERCIAL AT and\n   NUMBER SIGN in a French Mac layout on ISO\n   keyboards, and LESS-THAN SIGN and GREATER-THAN\n   SIGN in a Swiss German, German, or French Mac\n   layout on ANSI keyboards."]
pub const SDL_Scancode_SDL_SCANCODE_GRAVE: SDL_Scancode = 53;
pub const SDL_Scancode_SDL_SCANCODE_COMMA: SDL_Scancode = 54;
pub const SDL_Scancode_SDL_SCANCODE_PERIOD: SDL_Scancode = 55;
pub const SDL_Scancode_SDL_SCANCODE_SLASH: SDL_Scancode = 56;
pub const SDL_Scancode_SDL_SCANCODE_CAPSLOCK: SDL_Scancode = 57;
pub const SDL_Scancode_SDL_SCANCODE_F1: SDL_Scancode = 58;
pub const SDL_Scancode_SDL_SCANCODE_F2: SDL_Scancode = 59;
pub const SDL_Scancode_SDL_SCANCODE_F3: SDL_Scancode = 60;
pub const SDL_Scancode_SDL_SCANCODE_F4: SDL_Scancode = 61;
pub const SDL_Scancode_SDL_SCANCODE_F5: SDL_Scancode = 62;
pub const SDL_Scancode_SDL_SCANCODE_F6: SDL_Scancode = 63;
pub const SDL_Scancode_SDL_SCANCODE_F7: SDL_Scancode = 64;
pub const SDL_Scancode_SDL_SCANCODE_F8: SDL_Scancode = 65;
pub const SDL_Scancode_SDL_SCANCODE_F9: SDL_Scancode = 66;
pub const SDL_Scancode_SDL_SCANCODE_F10: SDL_Scancode = 67;
pub const SDL_Scancode_SDL_SCANCODE_F11: SDL_Scancode = 68;
pub const SDL_Scancode_SDL_SCANCODE_F12: SDL_Scancode = 69;
pub const SDL_Scancode_SDL_SCANCODE_PRINTSCREEN: SDL_Scancode = 70;
pub const SDL_Scancode_SDL_SCANCODE_SCROLLLOCK: SDL_Scancode = 71;
pub const SDL_Scancode_SDL_SCANCODE_PAUSE: SDL_Scancode = 72;
#[doc = "< insert on PC, help on some Mac keyboards (but\ndoes send code 73, not 117)"]
pub const SDL_Scancode_SDL_SCANCODE_INSERT: SDL_Scancode = 73;
pub const SDL_Scancode_SDL_SCANCODE_HOME: SDL_Scancode = 74;
pub const SDL_Scancode_SDL_SCANCODE_PAGEUP: SDL_Scancode = 75;
pub const SDL_Scancode_SDL_SCANCODE_DELETE: SDL_Scancode = 76;
pub const SDL_Scancode_SDL_SCANCODE_END: SDL_Scancode = 77;
pub const SDL_Scancode_SDL_SCANCODE_PAGEDOWN: SDL_Scancode = 78;
pub const SDL_Scancode_SDL_SCANCODE_RIGHT: SDL_Scancode = 79;
pub const SDL_Scancode_SDL_SCANCODE_LEFT: SDL_Scancode = 80;
pub const SDL_Scancode_SDL_SCANCODE_DOWN: SDL_Scancode = 81;
pub const SDL_Scancode_SDL_SCANCODE_UP: SDL_Scancode = 82;
#[doc = "< num lock on PC, clear on Mac keyboards"]
pub const SDL_Scancode_SDL_SCANCODE_NUMLOCKCLEAR: SDL_Scancode = 83;
pub const SDL_Scancode_SDL_SCANCODE_KP_DIVIDE: SDL_Scancode = 84;
pub const SDL_Scancode_SDL_SCANCODE_KP_MULTIPLY: SDL_Scancode = 85;
pub const SDL_Scancode_SDL_SCANCODE_KP_MINUS: SDL_Scancode = 86;
pub const SDL_Scancode_SDL_SCANCODE_KP_PLUS: SDL_Scancode = 87;
pub const SDL_Scancode_SDL_SCANCODE_KP_ENTER: SDL_Scancode = 88;
pub const SDL_Scancode_SDL_SCANCODE_KP_1: SDL_Scancode = 89;
pub const SDL_Scancode_SDL_SCANCODE_KP_2: SDL_Scancode = 90;
pub const SDL_Scancode_SDL_SCANCODE_KP_3: SDL_Scancode = 91;
pub const SDL_Scancode_SDL_SCANCODE_KP_4: SDL_Scancode = 92;
pub const SDL_Scancode_SDL_SCANCODE_KP_5: SDL_Scancode = 93;
pub const SDL_Scancode_SDL_SCANCODE_KP_6: SDL_Scancode = 94;
pub const SDL_Scancode_SDL_SCANCODE_KP_7: SDL_Scancode = 95;
pub const SDL_Scancode_SDL_SCANCODE_KP_8: SDL_Scancode = 96;
pub const SDL_Scancode_SDL_SCANCODE_KP_9: SDL_Scancode = 97;
pub const SDL_Scancode_SDL_SCANCODE_KP_0: SDL_Scancode = 98;
pub const SDL_Scancode_SDL_SCANCODE_KP_PERIOD: SDL_Scancode = 99;
#[doc = "< This is the additional key that ISO\n   keyboards have over ANSI ones,\n   located between left shift and Y.\n   Produces GRAVE ACCENT and TILDE in a\n   US or UK Mac layout, REVERSE SOLIDUS\n   (backslash) and VERTICAL LINE in a\n   US or UK Windows layout, and\n   LESS-THAN SIGN and GREATER-THAN SIGN\n   in a Swiss German, German, or French\n   layout."]
pub const SDL_Scancode_SDL_SCANCODE_NONUSBACKSLASH: SDL_Scancode = 100;
#[doc = "< windows contextual menu, compose"]
pub const SDL_Scancode_SDL_SCANCODE_APPLICATION: SDL_Scancode = 101;
#[doc = "< The USB document says this is a status flag,\n   not a physical key - but some Mac keyboards\n   do have a power key."]
pub const SDL_Scancode_SDL_SCANCODE_POWER: SDL_Scancode = 102;
pub const SDL_Scancode_SDL_SCANCODE_KP_EQUALS: SDL_Scancode = 103;
pub const SDL_Scancode_SDL_SCANCODE_F13: SDL_Scancode = 104;
pub const SDL_Scancode_SDL_SCANCODE_F14: SDL_Scancode = 105;
pub const SDL_Scancode_SDL_SCANCODE_F15: SDL_Scancode = 106;
pub const SDL_Scancode_SDL_SCANCODE_F16: SDL_Scancode = 107;
pub const SDL_Scancode_SDL_SCANCODE_F17: SDL_Scancode = 108;
pub const SDL_Scancode_SDL_SCANCODE_F18: SDL_Scancode = 109;
pub const SDL_Scancode_SDL_SCANCODE_F19: SDL_Scancode = 110;
pub const SDL_Scancode_SDL_SCANCODE_F20: SDL_Scancode = 111;
pub const SDL_Scancode_SDL_SCANCODE_F21: SDL_Scancode = 112;
pub const SDL_Scancode_SDL_SCANCODE_F22: SDL_Scancode = 113;
pub const SDL_Scancode_SDL_SCANCODE_F23: SDL_Scancode = 114;
pub const SDL_Scancode_SDL_SCANCODE_F24: SDL_Scancode = 115;
pub const SDL_Scancode_SDL_SCANCODE_EXECUTE: SDL_Scancode = 116;
pub const SDL_Scancode_SDL_SCANCODE_HELP: SDL_Scancode = 117;
pub const SDL_Scancode_SDL_SCANCODE_MENU: SDL_Scancode = 118;
pub const SDL_Scancode_SDL_SCANCODE_SELECT: SDL_Scancode = 119;
pub const SDL_Scancode_SDL_SCANCODE_STOP: SDL_Scancode = 120;
#[doc = "< redo"]
pub const SDL_Scancode_SDL_SCANCODE_AGAIN: SDL_Scancode = 121;
pub const SDL_Scancode_SDL_SCANCODE_UNDO: SDL_Scancode = 122;
pub const SDL_Scancode_SDL_SCANCODE_CUT: SDL_Scancode = 123;
pub const SDL_Scancode_SDL_SCANCODE_COPY: SDL_Scancode = 124;
pub const SDL_Scancode_SDL_SCANCODE_PASTE: SDL_Scancode = 125;
pub const SDL_Scancode_SDL_SCANCODE_FIND: SDL_Scancode = 126;
pub const SDL_Scancode_SDL_SCANCODE_MUTE: SDL_Scancode = 127;
pub const SDL_Scancode_SDL_SCANCODE_VOLUMEUP: SDL_Scancode = 128;
pub const SDL_Scancode_SDL_SCANCODE_VOLUMEDOWN: SDL_Scancode = 129;
pub const SDL_Scancode_SDL_SCANCODE_KP_COMMA: SDL_Scancode = 133;
pub const SDL_Scancode_SDL_SCANCODE_KP_EQUALSAS400: SDL_Scancode = 134;
#[doc = "< used on Asian keyboards, see\nfootnotes in USB doc"]
pub const SDL_Scancode_SDL_SCANCODE_INTERNATIONAL1: SDL_Scancode = 135;
pub const SDL_Scancode_SDL_SCANCODE_INTERNATIONAL2: SDL_Scancode = 136;
#[doc = "< Yen"]
pub const SDL_Scancode_SDL_SCANCODE_INTERNATIONAL3: SDL_Scancode = 137;
pub const SDL_Scancode_SDL_SCANCODE_INTERNATIONAL4: SDL_Scancode = 138;
pub const SDL_Scancode_SDL_SCANCODE_INTERNATIONAL5: SDL_Scancode = 139;
pub const SDL_Scancode_SDL_SCANCODE_INTERNATIONAL6: SDL_Scancode = 140;
pub const SDL_Scancode_SDL_SCANCODE_INTERNATIONAL7: SDL_Scancode = 141;
pub const SDL_Scancode_SDL_SCANCODE_INTERNATIONAL8: SDL_Scancode = 142;
pub const SDL_Scancode_SDL_SCANCODE_INTERNATIONAL9: SDL_Scancode = 143;
#[doc = "< Hangul/English toggle"]
pub const SDL_Scancode_SDL_SCANCODE_LANG1: SDL_Scancode = 144;
#[doc = "< Hanja conversion"]
pub const SDL_Scancode_SDL_SCANCODE_LANG2: SDL_Scancode = 145;
#[doc = "< Katakana"]
pub const SDL_Scancode_SDL_SCANCODE_LANG3: SDL_Scancode = 146;
#[doc = "< Hiragana"]
pub const SDL_Scancode_SDL_SCANCODE_LANG4: SDL_Scancode = 147;
#[doc = "< Zenkaku/Hankaku"]
pub const SDL_Scancode_SDL_SCANCODE_LANG5: SDL_Scancode = 148;
#[doc = "< reserved"]
pub const SDL_Scancode_SDL_SCANCODE_LANG6: SDL_Scancode = 149;
#[doc = "< reserved"]
pub const SDL_Scancode_SDL_SCANCODE_LANG7: SDL_Scancode = 150;
#[doc = "< reserved"]
pub const SDL_Scancode_SDL_SCANCODE_LANG8: SDL_Scancode = 151;
#[doc = "< reserved"]
pub const SDL_Scancode_SDL_SCANCODE_LANG9: SDL_Scancode = 152;
#[doc = "< Erase-Eaze"]
pub const SDL_Scancode_SDL_SCANCODE_ALTERASE: SDL_Scancode = 153;
pub const SDL_Scancode_SDL_SCANCODE_SYSREQ: SDL_Scancode = 154;
pub const SDL_Scancode_SDL_SCANCODE_CANCEL: SDL_Scancode = 155;
pub const SDL_Scancode_SDL_SCANCODE_CLEAR: SDL_Scancode = 156;
pub const SDL_Scancode_SDL_SCANCODE_PRIOR: SDL_Scancode = 157;
pub const SDL_Scancode_SDL_SCANCODE_RETURN2: SDL_Scancode = 158;
pub const SDL_Scancode_SDL_SCANCODE_SEPARATOR: SDL_Scancode = 159;
pub const SDL_Scancode_SDL_SCANCODE_OUT: SDL_Scancode = 160;
pub const SDL_Scancode_SDL_SCANCODE_OPER: SDL_Scancode = 161;
pub const SDL_Scancode_SDL_SCANCODE_CLEARAGAIN: SDL_Scancode = 162;
pub const SDL_Scancode_SDL_SCANCODE_CRSEL: SDL_Scancode = 163;
pub const SDL_Scancode_SDL_SCANCODE_EXSEL: SDL_Scancode = 164;
pub const SDL_Scancode_SDL_SCANCODE_KP_00: SDL_Scancode = 176;
pub const SDL_Scancode_SDL_SCANCODE_KP_000: SDL_Scancode = 177;
pub const SDL_Scancode_SDL_SCANCODE_THOUSANDSSEPARATOR: SDL_Scancode = 178;
pub const SDL_Scancode_SDL_SCANCODE_DECIMALSEPARATOR: SDL_Scancode = 179;
pub const SDL_Scancode_SDL_SCANCODE_CURRENCYUNIT: SDL_Scancode = 180;
pub const SDL_Scancode_SDL_SCANCODE_CURRENCYSUBUNIT: SDL_Scancode = 181;
pub const SDL_Scancode_SDL_SCANCODE_KP_LEFTPAREN: SDL_Scancode = 182;
pub const SDL_Scancode_SDL_SCANCODE_KP_RIGHTPAREN: SDL_Scancode = 183;
pub const SDL_Scancode_SDL_SCANCODE_KP_LEFTBRACE: SDL_Scancode = 184;
pub const SDL_Scancode_SDL_SCANCODE_KP_RIGHTBRACE: SDL_Scancode = 185;
pub const SDL_Scancode_SDL_SCANCODE_KP_TAB: SDL_Scancode = 186;
pub const SDL_Scancode_SDL_SCANCODE_KP_BACKSPACE: SDL_Scancode = 187;
pub const SDL_Scancode_SDL_SCANCODE_KP_A: SDL_Scancode = 188;
pub const SDL_Scancode_SDL_SCANCODE_KP_B: SDL_Scancode = 189;
pub const SDL_Scancode_SDL_SCANCODE_KP_C: SDL_Scancode = 190;
pub const SDL_Scancode_SDL_SCANCODE_KP_D: SDL_Scancode = 191;
pub const SDL_Scancode_SDL_SCANCODE_KP_E: SDL_Scancode = 192;
pub const SDL_Scancode_SDL_SCANCODE_KP_F: SDL_Scancode = 193;
pub const SDL_Scancode_SDL_SCANCODE_KP_XOR: SDL_Scancode = 194;
pub const SDL_Scancode_SDL_SCANCODE_KP_POWER: SDL_Scancode = 195;
pub const SDL_Scancode_SDL_SCANCODE_KP_PERCENT: SDL_Scancode = 196;
pub const SDL_Scancode_SDL_SCANCODE_KP_LESS: SDL_Scancode = 197;
pub const SDL_Scancode_SDL_SCANCODE_KP_GREATER: SDL_Scancode = 198;
pub const SDL_Scancode_SDL_SCANCODE_KP_AMPERSAND: SDL_Scancode = 199;
pub const SDL_Scancode_SDL_SCANCODE_KP_DBLAMPERSAND: SDL_Scancode = 200;
pub const SDL_Scancode_SDL_SCANCODE_KP_VERTICALBAR: SDL_Scancode = 201;
pub const SDL_Scancode_SDL_SCANCODE_KP_DBLVERTICALBAR: SDL_Scancode = 202;
pub const SDL_Scancode_SDL_SCANCODE_KP_COLON: SDL_Scancode = 203;
pub const SDL_Scancode_SDL_SCANCODE_KP_HASH: SDL_Scancode = 204;
pub const SDL_Scancode_SDL_SCANCODE_KP_SPACE: SDL_Scancode = 205;
pub const SDL_Scancode_SDL_SCANCODE_KP_AT: SDL_Scancode = 206;
pub const SDL_Scancode_SDL_SCANCODE_KP_EXCLAM: SDL_Scancode = 207;
pub const SDL_Scancode_SDL_SCANCODE_KP_MEMSTORE: SDL_Scancode = 208;
pub const SDL_Scancode_SDL_SCANCODE_KP_MEMRECALL: SDL_Scancode = 209;
pub const SDL_Scancode_SDL_SCANCODE_KP_MEMCLEAR: SDL_Scancode = 210;
pub const SDL_Scancode_SDL_SCANCODE_KP_MEMADD: SDL_Scancode = 211;
pub const SDL_Scancode_SDL_SCANCODE_KP_MEMSUBTRACT: SDL_Scancode = 212;
pub const SDL_Scancode_SDL_SCANCODE_KP_MEMMULTIPLY: SDL_Scancode = 213;
pub const SDL_Scancode_SDL_SCANCODE_KP_MEMDIVIDE: SDL_Scancode = 214;
pub const SDL_Scancode_SDL_SCANCODE_KP_PLUSMINUS: SDL_Scancode = 215;
pub const SDL_Scancode_SDL_SCANCODE_KP_CLEAR: SDL_Scancode = 216;
pub const SDL_Scancode_SDL_SCANCODE_KP_CLEARENTRY: SDL_Scancode = 217;
pub const SDL_Scancode_SDL_SCANCODE_KP_BINARY: SDL_Scancode = 218;
pub const SDL_Scancode_SDL_SCANCODE_KP_OCTAL: SDL_Scancode = 219;
pub const SDL_Scancode_SDL_SCANCODE_KP_DECIMAL: SDL_Scancode = 220;
pub const SDL_Scancode_SDL_SCANCODE_KP_HEXADECIMAL: SDL_Scancode = 221;
pub const SDL_Scancode_SDL_SCANCODE_LCTRL: SDL_Scancode = 224;
pub const SDL_Scancode_SDL_SCANCODE_LSHIFT: SDL_Scancode = 225;
#[doc = "< alt, option"]
pub const SDL_Scancode_SDL_SCANCODE_LALT: SDL_Scancode = 226;
#[doc = "< windows, command (apple), meta"]
pub const SDL_Scancode_SDL_SCANCODE_LGUI: SDL_Scancode = 227;
pub const SDL_Scancode_SDL_SCANCODE_RCTRL: SDL_Scancode = 228;
pub const SDL_Scancode_SDL_SCANCODE_RSHIFT: SDL_Scancode = 229;
#[doc = "< alt gr, option"]
pub const SDL_Scancode_SDL_SCANCODE_RALT: SDL_Scancode = 230;
#[doc = "< windows, command (apple), meta"]
pub const SDL_Scancode_SDL_SCANCODE_RGUI: SDL_Scancode = 231;
#[doc = "< I'm not sure if this is really not covered\n   by any of the above, but since there's a\n   special KMOD_MODE for it I'm adding it here"]
pub const SDL_Scancode_SDL_SCANCODE_MODE: SDL_Scancode = 257;
pub const SDL_Scancode_SDL_SCANCODE_AUDIONEXT: SDL_Scancode = 258;
pub const SDL_Scancode_SDL_SCANCODE_AUDIOPREV: SDL_Scancode = 259;
pub const SDL_Scancode_SDL_SCANCODE_AUDIOSTOP: SDL_Scancode = 260;
pub const SDL_Scancode_SDL_SCANCODE_AUDIOPLAY: SDL_Scancode = 261;
pub const SDL_Scancode_SDL_SCANCODE_AUDIOMUTE: SDL_Scancode = 262;
pub const SDL_Scancode_SDL_SCANCODE_MEDIASELECT: SDL_Scancode = 263;
pub const SDL_Scancode_SDL_SCANCODE_WWW: SDL_Scancode = 264;
pub const SDL_Scancode_SDL_SCANCODE_MAIL: SDL_Scancode = 265;
pub const SDL_Scancode_SDL_SCANCODE_CALCULATOR: SDL_Scancode = 266;
pub const SDL_Scancode_SDL_SCANCODE_COMPUTER: SDL_Scancode = 267;
pub const SDL_Scancode_SDL_SCANCODE_AC_SEARCH: SDL_Scancode = 268;
pub const SDL_Scancode_SDL_SCANCODE_AC_HOME: SDL_Scancode = 269;
pub const SDL_Scancode_SDL_SCANCODE_AC_BACK: SDL_Scancode = 270;
pub const SDL_Scancode_SDL_SCANCODE_AC_FORWARD: SDL_Scancode = 271;
pub const SDL_Scancode_SDL_SCANCODE_AC_STOP: SDL_Scancode = 272;
pub const SDL_Scancode_SDL_SCANCODE_AC_REFRESH: SDL_Scancode = 273;
pub const SDL_Scancode_SDL_SCANCODE_AC_BOOKMARKS: SDL_Scancode = 274;
pub const SDL_Scancode_SDL_SCANCODE_BRIGHTNESSDOWN: SDL_Scancode = 275;
pub const SDL_Scancode_SDL_SCANCODE_BRIGHTNESSUP: SDL_Scancode = 276;
#[doc = "< display mirroring/dual display\nswitch, video mode switch"]
pub const SDL_Scancode_SDL_SCANCODE_DISPLAYSWITCH: SDL_Scancode = 277;
pub const SDL_Scancode_SDL_SCANCODE_KBDILLUMTOGGLE: SDL_Scancode = 278;
pub const SDL_Scancode_SDL_SCANCODE_KBDILLUMDOWN: SDL_Scancode = 279;
pub const SDL_Scancode_SDL_SCANCODE_KBDILLUMUP: SDL_Scancode = 280;
pub const SDL_Scancode_SDL_SCANCODE_EJECT: SDL_Scancode = 281;
pub const SDL_Scancode_SDL_SCANCODE_SLEEP: SDL_Scancode = 282;
pub const SDL_Scancode_SDL_SCANCODE_APP1: SDL_Scancode = 283;
pub const SDL_Scancode_SDL_SCANCODE_APP2: SDL_Scancode = 284;
pub const SDL_Scancode_SDL_SCANCODE_AUDIOREWIND: SDL_Scancode = 285;
pub const SDL_Scancode_SDL_SCANCODE_AUDIOFASTFORWARD: SDL_Scancode = 286;
#[doc = "< not a key, just marks the number of scancodes\nfor array bounds"]
pub const SDL_Scancode_SDL_NUM_SCANCODES: SDL_Scancode = 512;
#[doc = "  \\brief The SDL keyboard scancode representation.\n\n  Values of this type are used to represent keyboard keys, among other places\n  in the \\link SDL_Keysym::scancode key.keysym.scancode \\endlink field of the\n  SDL_Event structure.\n\n  The values in this enumeration are based on the USB usage page standard:\n  https://www.usb.org/sites/default/files/documents/hut1_12v2.pdf"]
pub type SDL_Scancode = libc::c_int;
#[doc = "  \\brief The SDL virtual key representation.\n\n  Values of this type are used to represent keyboard keys using the current\n  layout of the keyboard.  These values include Unicode values representing\n  the unmodified character that would be generated by pressing the key, or\n  an SDLK_* constant for those keys that do not generate characters.\n\n  A special exception is the number keys at the top of the keyboard which\n  always map to SDLK_0...SDLK_9, regardless of layout."]
pub type SDL_Keycode = Sint32;
pub const SDLK_UNKNOWN: _bindgen_ty_15 = 0;
pub const SDLK_RETURN: _bindgen_ty_15 = 13;
pub const SDLK_ESCAPE: _bindgen_ty_15 = 27;
pub const SDLK_BACKSPACE: _bindgen_ty_15 = 8;
pub const SDLK_TAB: _bindgen_ty_15 = 9;
pub const SDLK_SPACE: _bindgen_ty_15 = 32;
pub const SDLK_EXCLAIM: _bindgen_ty_15 = 33;
pub const SDLK_QUOTEDBL: _bindgen_ty_15 = 34;
pub const SDLK_HASH: _bindgen_ty_15 = 35;
pub const SDLK_PERCENT: _bindgen_ty_15 = 37;
pub const SDLK_DOLLAR: _bindgen_ty_15 = 36;
pub const SDLK_AMPERSAND: _bindgen_ty_15 = 38;
pub const SDLK_QUOTE: _bindgen_ty_15 = 39;
pub const SDLK_LEFTPAREN: _bindgen_ty_15 = 40;
pub const SDLK_RIGHTPAREN: _bindgen_ty_15 = 41;
pub const SDLK_ASTERISK: _bindgen_ty_15 = 42;
pub const SDLK_PLUS: _bindgen_ty_15 = 43;
pub const SDLK_COMMA: _bindgen_ty_15 = 44;
pub const SDLK_MINUS: _bindgen_ty_15 = 45;
pub const SDLK_PERIOD: _bindgen_ty_15 = 46;
pub const SDLK_SLASH: _bindgen_ty_15 = 47;
pub const SDLK_0: _bindgen_ty_15 = 48;
pub const SDLK_1: _bindgen_ty_15 = 49;
pub const SDLK_2: _bindgen_ty_15 = 50;
pub const SDLK_3: _bindgen_ty_15 = 51;
pub const SDLK_4: _bindgen_ty_15 = 52;
pub const SDLK_5: _bindgen_ty_15 = 53;
pub const SDLK_6: _bindgen_ty_15 = 54;
pub const SDLK_7: _bindgen_ty_15 = 55;
pub const SDLK_8: _bindgen_ty_15 = 56;
pub const SDLK_9: _bindgen_ty_15 = 57;
pub const SDLK_COLON: _bindgen_ty_15 = 58;
pub const SDLK_SEMICOLON: _bindgen_ty_15 = 59;
pub const SDLK_LESS: _bindgen_ty_15 = 60;
pub const SDLK_EQUALS: _bindgen_ty_15 = 61;
pub const SDLK_GREATER: _bindgen_ty_15 = 62;
pub const SDLK_QUESTION: _bindgen_ty_15 = 63;
pub const SDLK_AT: _bindgen_ty_15 = 64;
pub const SDLK_LEFTBRACKET: _bindgen_ty_15 = 91;
pub const SDLK_BACKSLASH: _bindgen_ty_15 = 92;
pub const SDLK_RIGHTBRACKET: _bindgen_ty_15 = 93;
pub const SDLK_CARET: _bindgen_ty_15 = 94;
pub const SDLK_UNDERSCORE: _bindgen_ty_15 = 95;
pub const SDLK_BACKQUOTE: _bindgen_ty_15 = 96;
pub const SDLK_a: _bindgen_ty_15 = 97;
pub const SDLK_b: _bindgen_ty_15 = 98;
pub const SDLK_c: _bindgen_ty_15 = 99;
pub const SDLK_d: _bindgen_ty_15 = 100;
pub const SDLK_e: _bindgen_ty_15 = 101;
pub const SDLK_f: _bindgen_ty_15 = 102;
pub const SDLK_g: _bindgen_ty_15 = 103;
pub const SDLK_h: _bindgen_ty_15 = 104;
pub const SDLK_i: _bindgen_ty_15 = 105;
pub const SDLK_j: _bindgen_ty_15 = 106;
pub const SDLK_k: _bindgen_ty_15 = 107;
pub const SDLK_l: _bindgen_ty_15 = 108;
pub const SDLK_m: _bindgen_ty_15 = 109;
pub const SDLK_n: _bindgen_ty_15 = 110;
pub const SDLK_o: _bindgen_ty_15 = 111;
pub const SDLK_p: _bindgen_ty_15 = 112;
pub const SDLK_q: _bindgen_ty_15 = 113;
pub const SDLK_r: _bindgen_ty_15 = 114;
pub const SDLK_s: _bindgen_ty_15 = 115;
pub const SDLK_t: _bindgen_ty_15 = 116;
pub const SDLK_u: _bindgen_ty_15 = 117;
pub const SDLK_v: _bindgen_ty_15 = 118;
pub const SDLK_w: _bindgen_ty_15 = 119;
pub const SDLK_x: _bindgen_ty_15 = 120;
pub const SDLK_y: _bindgen_ty_15 = 121;
pub const SDLK_z: _bindgen_ty_15 = 122;
pub const SDLK_CAPSLOCK: _bindgen_ty_15 = 1073741881;
pub const SDLK_F1: _bindgen_ty_15 = 1073741882;
pub const SDLK_F2: _bindgen_ty_15 = 1073741883;
pub const SDLK_F3: _bindgen_ty_15 = 1073741884;
pub const SDLK_F4: _bindgen_ty_15 = 1073741885;
pub const SDLK_F5: _bindgen_ty_15 = 1073741886;
pub const SDLK_F6: _bindgen_ty_15 = 1073741887;
pub const SDLK_F7: _bindgen_ty_15 = 1073741888;
pub const SDLK_F8: _bindgen_ty_15 = 1073741889;
pub const SDLK_F9: _bindgen_ty_15 = 1073741890;
pub const SDLK_F10: _bindgen_ty_15 = 1073741891;
pub const SDLK_F11: _bindgen_ty_15 = 1073741892;
pub const SDLK_F12: _bindgen_ty_15 = 1073741893;
pub const SDLK_PRINTSCREEN: _bindgen_ty_15 = 1073741894;
pub const SDLK_SCROLLLOCK: _bindgen_ty_15 = 1073741895;
pub const SDLK_PAUSE: _bindgen_ty_15 = 1073741896;
